{
  "ticker": "APOG",
  "company": "Apogee",
  "title": "Apogee (APOG) Q3 2026 Earnings Call Transcript",
  "year": 2026,
  "quarter": 3,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/apogee-apog-q3-2026-earnings-call-transcript/",
  "transcript": "NASDAQ:APOG\n\nApogee Enterprises\n\nImage source: The Motley Fool.\n\nDATE\n\nWednesday, January 7, 2026 at 9 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nApogee Enterprises(APOG+4.69%)reported modest top-line expansion this quarter, primarily from the UW Solutions acquisition, while overall margin performance lagged the previous year due to cost increases and softer pricing. Cost headwinds from aluminum inflation, health insurance, and normalizing incentive compensation remain a source of downward pressure and were called out by management as continuing into the next quarter and beyond. Expanded restructuring under Fortify phase two aims to deliver substantial annual cost savings, but these benefits are not expected to fully offset near-term headwinds, setting conservative guidance. Management explicitly reaffirmed all strategic priorities, including disciplined M&A and operational excellence through the Apogee Management System, with no deviation in financial return hurdles or long-term targets.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nDon Nolan:Before I begin my prepared remarks, I want to acknowledge an announcement made earlier today. Matt Osberg has informed us of his decision to leave the company to pursue an opportunity elsewhere. Want to thank Matt for his many contributions over the past three years, and wish him continued success in the future. Stepping in as the interim CFO is our chief accounting officer, Mark Ogdahl. Who has been at Apogee for over twenty-five years. I look forward to partnering with him as we begin our search for the company's next CFO. Next, I'd like to start by saying it's a real privilege have the opportunity to lead the company through this period of transition.\n\nWhile I've served on Apogee's board since 2013, the past few months as CEO have given me a deeper perspective strengthening my confidence in Apogee's future. I'd like to share a few observations. First, our customers consistently tell us how much they value the quality and reliability of our products and services. That feedback is energizing and underscores a core principle of mine, Companies that delight their customers, win in the market. Apogee has built that reputation over seventy-six years and continues to raise the bar. Second, across Apogee, we have exceptional talent. Individuals who are passionate, resilient, and relentlessly focused on exceeding the expectations of customers.\n\nTheir ability to deliver tremendous value especially in this dynamic environment, reinforces the strength of this company and gives me tremendous confidence in our future. And third, the Apogee management system continues to drive value across our manufacturing footprint. The returns on our AMS investments are fueling margin benefits and reinforcing the operational excellence helps define our organization. I'd also like to highlight the UW Solutions acquisition which celebrated its one-year anniversary this quarter. We pleased with the initial results, and the team is on track to deliver our fiscal 2026 expectations of $100 million in net sales approximately 20% in adjusted EBITDA margin.\n\nUW Solutions expands our market and geographical reach adding substrate capabilities and coding technology and provides a platform for potential growth in fiscal 2027 and beyond. Now turning to our results for the quarter. I am pleased with the team's ability to deliver in a dynamic environment. This performance reflects not only disciplined execution, but also the strength of our culture the dedication for our people. It reinforces my confidence in the strategies put in place and our ability to adapt and win in dynamic markets. Although macroeconomic factors remain challenging, Apogee is well positioned because of three key strengths.\n\nOperational excellence through AMS, driving continued productivity improvement across our manufacturing footprint, our proven cost out execution with Fortify phase one, phase two, and a strong balance sheet and healthy cash generation, giving us flexibility for future M&A. These fundamentals, combined with the talent of our team, enable us to navigate near-term challenges and capitalize on long-term opportunities. In the near term, our priorities remain clear and unchanged. First, become the economic leader in our target markets with differentiated product and service offerings and competitive cost structures. Number two, managing our portfolio through pursuing accretive M&A opportunities aligned with our strategic and financial objectives.\n\nAnd number three, strengthening our core by driving more efficient operations, greater scalability, and enabling sustained profitable growth. I'm confident in our strategy and excited about what's ahead Together, we have the opportunity to create significant value for all stakeholders. With that, I'll turn it over to Mark. Thanks, Don, and good morning, everyone. First, I'll begin with the review of the results of the third quarter. And then follow with commentary on our outlook for the remainder of fiscal 2026 and some early insights into fiscal 2027. Beginning with our consolidated results, net sales increased 2.1% to $348.6 million primarily driven by $18.4 million of inorganic sales from the acquisition of UW Solutions. As well as favorable product mix.\n\nThis was partially offset by lower volume primarily in metals. Adjusted EBITDA margin decreased slightly to 13.2%, The year-over-year change was primarily driven by lower volume and price and higher aluminum and health insurance costs. These were partially offset by lower incentive compensation expense and benefits from the cost savings related to Fortify phase two. Adjusted diluted EPS was $1.02. In line with our expectations and down year over year primarily driven by higher amortization and interest expense as a result of the UW Solutions acquisition. Turning to our segment results. Metals net sales declined primarily due to lower volume partially offset by favorable price and product mix.\n\nAdjusted EBITDA margin improved to 13.5%, primarily driven by increased productivity, including cost savings from Fortify phase two, lower incentive compensation expense, and favorable price and product mix.\n\nMark Ogdahl:These were partially offset by lower volume. Our services segment delivered its seventh consecutive quarter of year-over-year net sales growth. Primarily due to increased volume. Adjusted EBITDA margin increased to 9.7% mostly driven by lower incentive compensation expense. Partially offset by unfavorable project mix. Additionally, backlog for services ended the quarter at $775 million down slightly from Q2 but up over 4% compared to Q3 of last year. Glass net sales increased slightly to approximately $71 million primarily driven by increased volume and favorable mix. Partially offset by lower price driven by end market demand softness. Adjusted EBITDA margin moderated from last year primarily due to lower price and higher material costs.\n\nPartially offset by higher volume favorable product mix, and lower incentive compensation expense. Performance surfaces net sales increased driven by the inorganic sales contribution from the acquisition of UW Solutions. Inorganic growth primarily from price. Adjusted EBITDA margin decreased primarily driven by the dilutive impact of lower adjusted EBITDA margin from the UW Solutions and unfavorable productivity. Partially offset by favorable product mix and price. Turning to cash flow and the balance sheet. For the third quarter, net cash provided by operating activities was $29.3 million down slightly from $31 million in the third quarter of prior year.\n\nOn a year-to-date basis, cash from operating activities was $66.6 million compared to $95.1 million a year ago, due to lower operating cash flow in the first quarter. Our balance sheet remains strong\n\nDon Nolan:with a consolidated leverage ratio of 1.4 times.\n\nMark Ogdahl:No near-term debt maturities and significant capital available for future deployment. Turning now to our outlook for the remainder of fiscal 2026. We are updating our estimates for both net sales and adjusted diluted EPS. We now expect net sales to be approximately $1.39 billion and adjusted diluted EPS in the range of $3.40 to $3.50. This outlook includes an updated estimate of the EPS impact from tariffs of approximately $0.30 Our updated outlook assumes an adjusted effective tax rate of approximately 27% and capital expenditures between $25 million and $30 million The current macroeconomic backdrop remains challenging, in both our metals and glass segments competitive market dynamics continue to put significant pressure on pricing and volume.\n\nAdditionally, in our metal segment, average aluminum prices in the third quarter rose approximately 13% compared to the second quarter and are up over 50% compared to the third quarter of last year. These factors are driving volume pressure and margin compression. And we anticipate this dynamic will continue to impact us through the fourth quarter and to some extent, into fiscal 2027. Additionally, as we look ahead to fiscal 2027, we expect cost headwinds from the normalization of incentive compensation expense. And higher health insurance costs. In order to offset a portion of the anticipated impact of these headwinds, we have expanded the scope of Project Fortify Phase two to include further restructuring actions primarily in metals and corporate.\n\nBased on the expected benefits of the expanded scope of Fortify phase two, we now expect to incur a total of approximately $28 to $29 million in pretax charges and deliver an estimated annual pretax cost savings of approximately $25 to $26 million. With approximately $10 million of that benefit to be realized in fiscal 2027. In addition, we expect the majority of the tariff impact of fiscal 2026 not to repeat. And to be a benefit to fiscal 2027. Although we are on the in the initial stages of our planning for fiscal 2027, we are taking proactive measures.\n\nSuch as the expansion of Fortify phase two to manage near-term headwinds as well as position us to be more agile and better equipped to capitalize on growth opportunities as market conditions stabilize. Finally, I wanna recognize and thank our employees for their resilience and dedication. Their commitment is critical to our success. By executing with rigor today, we are laying the groundwork for long-term value creation opportunities for our shareholders.\n\nDon Nolan:With that,\n\nMark Ogdahl:will now open the call to questions. Operator, please go ahead.\n\nOperator:Thank you. As a reminder, to ask a question at this time, you will need to press 11 on your telephone and wait for your name to be announced. Please stand by while we compile the Q and A roster. First question coming from the line of Brent Thielman with D. A. Davidson. Your line is now open.\n\nBrent Thielman:Hey. Thanks. Good morning. Don, I mean, a lot has changed here since the last earnings call.\n\nDon Nolan:And maybe if you could just start off and talk about what the board is looking for in terms of new leadership on a go forward basis. And is there any different view on the strategic direction of the company going forward versus what's been vocalized is the strategy before, particularly sort of scaling the Performance Services business? Hi, Brent.\n\nBrent Thielman:Thanks for that question. No. No change in strategy. We remain focused on the existing strategies. The strategies that quite frankly, were working, you know, before my tenure. On becoming the economic leader in our target market, continuing to manage the portfolio, and pursuing accretive M&A opportunities in faster growing markets. You UW Solutions being the best example And then, you know, strengthening our core, driving more efficient operations, greater scalability, and enabling, you know, sustained profitable growth. So notes, strict There's no change whatsoever.\n\nBrent Thielman:Okay. And sorry, Don. In terms of what you're looking for in terms of new leadership as you're out with\n\nDon Nolan:CEO search here? Yeah. So look, we started we started our process. And clearly, we're looking for someone who has deep growth and operational excellence experience M&A integration, you know, the things that are called out in our strategy.\n\nBrent Thielman:Alright. And then I mean, in terms of the updated outlook, it looks to me like the big impact there is just discontinued inflation and aluminum that we continue to see post quarter. Assume it's predominantly impacting the metals Yes, Brian, if I could. But that's the yeah. Yeah. Please. I'll let you follow-up with your the rest of your question. No. Just in regard to the outlook. And the updated outlook, looks like it's primarily the metals segment, I presume. If that's the case,\n\nDon Nolan:looks like\n\nBrent Thielman:you're sort of embedding a more severe impact to margins in metals in the fourth quarter relative to what you saw in the third quarter. Is that the right way to think about this? Yeah, Brent. Good observations. You have you know, both I would say both in metals and in glass,\n\nDon Nolan:market dynamics continue to be very they continue to evolve. So, yeah, back on metals, the prime primary issue there is\n\nBrent Thielman:the aluminum prices continue to increase. You know, in our prepared comments, we commented that\n\nDon Nolan:between Q2 and Q3,\n\nBrent Thielman:aluminum prices went up third 13%.\n\nDon Nolan:And then even here in December, we're seeing, you know, continued increases in that price So the margin pressures continue to build.\n\nBrent Thielman:And then, you know, maybe a little bit in glass as well.\n\nDon Nolan:You know, we have about a sixty day window on what we can see for orders. At the '3 or excuse me, at the '2, we thought that we would kinda maintain that level, but we're we're seeing slightly declines there. So we're again, seeing a little bit of an impact both on volume and price going into the fourth quarter. I would tell you, though, that, you know, we you know, we remain focused on managing our margin dollars.\n\nBrent Thielman:So as\n\nDon Nolan:to the best of our abilities, we're controlling costs and implementing things that we can control those costs, Fortify phase two expansion as an example.\n\nBrent Thielman:And I guess not notwithstanding some of these short term pressures that you are seeing in the market, are the long term kind of EBITDA margin targets that you laid out before they'll sort of appropriate to think about? Again, know there's going to be some nuances in the near term for some of the things you called out.\n\nDon Nolan:That's exactly right, Brent.\n\nBrent Thielman:Okay. Okay. Thank you. I'll pass it on.\n\nDon Nolan:Thank you.\n\nOperator:And our next question in queue coming from the line of Jon Braatz with KCCA. Your line is now open.\n\nJon Braatz:Hello?\n\nDon Nolan:Hi, Jon. Oh, I'm sorry. I missed my queue.\n\nJon Braatz:Don, I just want to go back to the\n\nDon Nolan:sort of the strategic direction of the company. And\n\nJon Braatz:how much emphasis you might place on M&A activity because\n\nDon Nolan:let's face it, in the past, it just it hasn't turned out to M&A activity hasn't been that\n\nJon Braatz:positive for Apogee. And it seems to me the focus should be almost exclusively on running the business as profitably as possible\n\nDon Nolan:returning cash flow to\n\nJon Braatz:to shareholders in terms of dividends and share repurchases. So I wanna get a better sense from you as\n\nDon Nolan:where you see M&A going forward.\n\nJon Braatz:Well, look. Our pipeline for M&A is robust. It's very active right now. And, you know, I we have spent a great deal of time and energy building all the processes and systems in the company. To continue to drive M&A. UW Solutions was a great a great acquisition for us. Twelve months in, we have achieved or beat all of our objectives. So you know, it's a business that's growing robustly. You know, our performance services business, that segment, was able to successfully integrate a the UW Solutions almost doubling the size of the business and deliver organic growth at the same time.\n\nSo we've demonstrated that we can execute We can we can select a great acquisition that works for in our strategy. We have the discipline to execute on the integration. And we continue to work our pipeline aggressively.\n\nJon Braatz:Okay. Another question. In the fourth quarter of last year, when Project Fortify was announced, mentioned $26 million in cost, costs that will be incurred and savings of 13 to 15 million.\n\nDon Nolan:And\n\nJon Braatz:this quarter, said cost of 28 million to 29 million a little bit higher. But savings of 25 to 26. Is what's the difference between the fourth quarter savings and what you said here in the first quarter? Am I have something wrong there? Nope. Jon, I'll take that Yes. You're the ranges that you provided were accurate. The increases in costs are primarily head headcount based, and re and holding our cost structure tight, we did incur some footprint related matters in the fourth quarter here.\n\nDon Nolan:Which was the\n\nJon Braatz:the primary cost in the court in the fourth quarter. But, you know, again, we're we're focusing on things that will drive cost savings going forward.\n\nDon Nolan:So the cost savings\n\nJon Braatz:13 to 15 to 25 to 26, that's correct with that number? Yep. That's what we're showing.\n\nDon Nolan:Okay. Alright. Alright. Thank you.\n\nOperator:Thank you. Our next question coming from the line of Gowshihan Sriharan with Singling Research. Your line is now open.\n\nGowshihan Sriharan:Good morning. Can you hear me?\n\nDon Nolan:Yes. Loud and clear.\n\nGowshihan Sriharan:Thank you. Thank you for taking my questions. My first question is on the metals in glass. I know you guys have mentioned some pricing discipline\n\nDon Nolan:with keeping the plants efficiently utilized. How are you thinking about the bid approval process threshold and hurdle mud hurdle margins changing over the six months. I mean, have you walked away from any large pack, projects or packages that might that might leave kind of under absorption risk in early fiscal twenty seven? And are you willing to or when would you start considering the flexibility around the pricing discipline?\n\nDon Nolan:I'll I'll start off, and\n\nMark Ogdahl:then turn it over to Mark. But look, glass is a highly competitive market.\n\nDon Nolan:But the glass team has been working hard maximize EBITDA dollar contribution while protect protecting their premium margins. They faced significant challenges on volume and price, true, But, look, the business is in a much stronger position than during the last downturn. Even with the market challenges that we face today, glass is still operating in the teens EBITDA margin versus mid single digit in the last downturn. So, you know, yes, we're we're gonna continue to focus on maximizing EBITDA dollar contribution. As we move as the market, you know, shifts.\n\nMark Ogdahl:Don, I really I don't really have anything to add. I think you covered up what I thought was important with is, you know, we implemented some really, really nice and solid pricing strategies as we were executing our initiating our current strategy. And we intend to continue on that process. Of course, you know, volume\n\nDon Nolan:matters.\n\nMark Ogdahl:So we need to we need to look at every project and every opportunity when they come across. The other thing I would mention is you know, as was pointed out, you know, fortify one, fortify two,\n\nDon Nolan:we continue to actively manage our cost structure. To mitigate, you know, these short term headwinds. So in addition to making sure that we hold onto our margins and manage the top line appropriately. Also managing our cost structure.\n\nGowshihan Sriharan:Gotcha. And are you seeing any noticeable pricing differences between your, say, your strategic repeat customers as opposed to your more transactional work? Has that\n\nDon Nolan:No. I don't think so.\n\nGowshihan Sriharan:Gap kind of widened or narrow since we spoke, in Q2?\n\nDon Nolan:You know, I think we're we're look. We're seeing higher volume of projects.\n\nMark Ogdahl:In glass for sure.\n\nDon Nolan:And, you know, on average, a little smaller. What we've seen in the past.\n\nMark Ogdahl:Yep. Primarily Oh, it's a very challenging environment. There you go. Thank you. Yes.\n\nGowshihan Sriharan:And on the performance services side, can you kind of unpack on how much of that growth is coming from the high margin SKUs versus kind of mid tier offerings? And with the current mix, would you adjust your long term margin aspirations for that segment?\n\nDon Nolan:Well, we've so we've mentioned this in past quarters. We took some share over the past few quarters in our distribution business. So these are, you know, think of it as retail shelf space. Okay? So we've we've expanded our shelf space. A couple years ago, we lost some. And we gained that back.\n\nMark Ogdahl:And\n\nDon Nolan:that is that is a very attractive business.\n\nGowshihan Sriharan:Gotcha. The other the other area that I might mention is\n\nDon Nolan:look, the UWS solutions, one of the reasons why we thought this was such an attractive acquisition is because it allowed us to enter a part of the flooring market that serves warehouses and manufacturing facilities.\n\nMark Ogdahl:So this is a growth area\n\nDon Nolan:and has demonstrated some nice organic growth for us.\n\nMark Ogdahl:Okay. In our highest in our highest performing segment.\n\nDon Nolan:Yeah. Highest margin segment. Yeah.\n\nGowshihan Sriharan:I'll make this my last question. I know you've highlighted the lower incentive compensation as a tailwind to margin across several segments. This quarter. I know I think you've alluded that there will be some kind of normalization in the intensive compensation. But how should we think about from a sustainability and talent standpoint? Are you structurally resetting some of that incentive programs? Or is this or is this, paying below at a at a at a tough year? Are you as you look at the labor market in your key regions, are you comfortable with the overall comp structure remains competitive? Enough to, execute project 45 and your growth plans.\n\nMark Ogdahl:Yeah. We believe our structure is fine. We just entered a into a more difficult year and our we're not meeting our targets. So our compensation will be less this year, but we expect that to normalize. Into the future.\n\nGowshihan Sriharan:Thank you. That's all I have. Thank you, guys.\n\nOperator:Thank you. Our next question coming from the line of Julio Romero with Sidoti. Your line is now open.\n\nJulio Romero:Thanks. Hey. Good morning. Don, could you help us think about how you view the company's growth trajectory and opportunity set And then also, how does the next leg of growth in your view for the company translate to any change in ROIC hurdles or metrics?\n\nDon Nolan:Well,\n\nJulio Romero:you know, first of all, we'll be the strategy that we're focused on hasn't changed. So we remain focused on becoming the economic leader in the target markets we serve. Managing our portfolio, and strength strengthening the core.\n\nJulio Romero:So\n\nDon Nolan:no change, Julio, in how we think about where we're where we're gonna grow and how. The addition of UW Solutions certainly opened up new markets, new products, that will enable us to grow faster. And as part of our managing portfolio strategy, we continue to look for new opportunities along those lines. So looking for acquisitions that will enable faster growth and at higher margins. We're gonna we're gonna talk a lot more about that on our next call when we talk about fiscal year 2027.\n\nJulio Romero:Okay. Understood. I guess maybe can you dig into a little bit into the priorities that are more near term in nature. Obviously, you have project Fortify expansion any other kind of quicker turn wins, or low hanging fruit that\n\nMark Ogdahl:looking to kind of achieve early on?\n\nDon Nolan:Well,\n\nJulio Romero:delivering the results you know, delivering our results will be critical. Know, we're we're focused on delivering the year. Right now.\n\nJulio Romero:I mean, that's that's front and center.\n\nMark Ogdahl:Hooey, I would just add yes, project four to five phase two is probably the most important, but I would I would suggest that, you know, we're amping up AMS. Again as it as we think about, you know, how we're trying to drive cost structure down, our best tool to do that is through the Apogee management system. So that's that's our that's gonna be our tool to get there.\n\nDon Nolan:I mean, to Frank, Julio, so AMS, I mean, that's one of my observations for the search my first sixty days. Operational excellence of productivity improvements that we've been able to deliver through AMS are truly extraordinary, especially in the glass business. We're seeing strength across the board, safety, quality, on time delivery, you name it. And by the way, that was the birthplace of AMS. So they're leading the way and it shows what we could do with the rest of the company. So it's it'll be a key focus for us. Last thing is, you know, I mentioned a couple times, but accretive M&A, it's it's right. It's front and center too.\n\nWe have a very we have a robust pipeline and we're active.\n\nJulio Romero:Got it. And I guess it just you know, just going back to my first question a little bit more, you know, and it ties into the your comment about robust M&A pipeline. Do you see any kind of you know, viewpoint difference with regards to yourself versus the last management team with regards to kind of kind of you know, IRR hurdles or rate of return hurdles, when you look at that M&A and kind of moving forward with that.\n\nDon Nolan:No. I don't think any difference in the\n\nJulio Romero:in the financial\n\nDon Nolan:analysis, but I would say, you know, move faster. And you know, we move with discipline, of course, but also faster.\n\nJulio Romero:Got it. That's that's helpful. I appreciate it. And then last one for me would just be on you know, you gave some preliminary commentary on your fiscal twenty seven You talked about you don't expect the tariff impact to reoccur in fiscal twenty seven, but any other kind of high level thoughts with regards to how you see, you know, the possibility of revenue or profit growth in '27?\n\nMark Ogdahl:Yeah. I guess I'll reiterate, you know, kind of in the process right now of our doing our AOPs. We highlighted what I viewed are the are the key headwinds and headwinds that have in front of us, tailwinds being project four to five phase two, and the tariffs not repeating. In the headwinds, of course, you know, we've covered now several times with normal normalization of incentive comp and certainly, aluminum prices will continue to be monitored as we go through the fourth quarter and as we scenario plan our AOP.\n\nJulio Romero:Helpful. Best of luck, guys. Thanks.\n\nDon Nolan:Thank you.\n\nOperator:Thank you. And I'm showing no further questions in queue at this time. I will now turn the call back over to Donald for any closing comments.\n\nDon Nolan:Well, thank you for joining us today. We look forward to sharing the fourth quarter and full year results in April. Along with our fiscal 2027 outlet. I would look. I hope you have a great week.\n\nOperator:Ladies and gentlemen, this concludes today's conference call. I Thank you for your participation, and you may now disconnect.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:APOG\n\nApogee Enterprises\n\nImage source: The Motley Fool.\n\nDATE\n\nWednesday, January 7, 2026 at 9 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nApogee Enterprises(APOG+4.69%)reported modest top-line expansion this quarter, primarily from the UW Solutions acquisition, while overall margin performance lagged the previous year due to cost increases and softer pricing. Cost headwinds from aluminum inflation, health insurance, and normalizing incentive compensation remain a source of downward pressure and were called out by management as continuing into the next quarter and beyond. Expanded restructuring under Fortify phase two aims to deliver substantial annual cost savings, but these benefits are not expected to fully offset near-term headwinds, setting conservative guidance. Management explicitly reaffirmed all strategic priorities, including disciplined M&A and operational excellence through the Apogee Management System, with no deviation in financial return hurdles or long-term targets.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nDon Nolan:Before I begin my prepared remarks, I want to acknowledge an announcement made earlier today. Matt Osberg has informed us of his decision to leave the company to pursue an opportunity elsewhere. Want to thank Matt for his many contributions over the past three years, and wish him continued success in the future. Stepping in as the interim CFO is our chief accounting officer, Mark Ogdahl. Who has been at Apogee for over twenty-five years. I look forward to partnering with him as we begin our search for the company's next CFO. Next, I'd like to start by saying it's a real privilege have the opportunity to lead the company through this period of transition.\n\nWhile I've served on Apogee's board since 2013, the past few months as CEO have given me a deeper perspective strengthening my confidence in Apogee's future. I'd like to share a few observations. First, our customers consistently tell us how much they value the quality and reliability of our products and services. That feedback is energizing and underscores a core principle of mine, Companies that delight their customers, win in the market. Apogee has built that reputation over seventy-six years and continues to raise the bar. Second, across Apogee, we have exceptional talent. Individuals who are passionate, resilient, and relentlessly focused on exceeding the expectations of customers.\n\nTheir ability to deliver tremendous value especially in this dynamic environment, reinforces the strength of this company and gives me tremendous confidence in our future. And third, the Apogee management system continues to drive value across our manufacturing footprint. The returns on our AMS investments are fueling margin benefits and reinforcing the operational excellence helps define our organization. I'd also like to highlight the UW Solutions acquisition which celebrated its one-year anniversary this quarter. We pleased with the initial results, and the team is on track to deliver our fiscal 2026 expectations of $100 million in net sales approximately 20% in adjusted EBITDA margin.\n\nUW Solutions expands our market and geographical reach adding substrate capabilities and coding technology and provides a platform for potential growth in fiscal 2027 and beyond. Now turning to our results for the quarter. I am pleased with the team's ability to deliver in a dynamic environment. This performance reflects not only disciplined execution, but also the strength of our culture the dedication for our people. It reinforces my confidence in the strategies put in place and our ability to adapt and win in dynamic markets. Although macroeconomic factors remain challenging, Apogee is well positioned because of three key strengths.\n\nOperational excellence through AMS, driving continued productivity improvement across our manufacturing footprint, our proven cost out execution with Fortify phase one, phase two, and a strong balance sheet and healthy cash generation, giving us flexibility for future M&A. These fundamentals, combined with the talent of our team, enable us to navigate near-term challenges and capitalize on long-term opportunities. In the near term, our priorities remain clear and unchanged. First, become the economic leader in our target markets with differentiated product and service offerings and competitive cost structures. Number two, managing our portfolio through pursuing accretive M&A opportunities aligned with our strategic and financial objectives.\n\nAnd number three, strengthening our core by driving more efficient operations, greater scalability, and enabling sustained profitable growth. I'm confident in our strategy and excited about what's ahead Together, we have the opportunity to create significant value for all stakeholders. With that, I'll turn it over to Mark. Thanks, Don, and good morning, everyone. First, I'll begin with the review of the results of the third quarter. And then follow with commentary on our outlook for the remainder of fiscal 2026 and some early insights into fiscal 2027. Beginning with our consolidated results, net sales increased 2.1% to $348.6 million primarily driven by $18.4 million of inorganic sales from the acquisition of UW Solutions. As well as favorable product mix.\n\nThis was partially offset by lower volume primarily in metals. Adjusted EBITDA margin decreased slightly to 13.2%, The year-over-year change was primarily driven by lower volume and price and higher aluminum and health insurance costs. These were partially offset by lower incentive compensation expense and benefits from the cost savings related to Fortify phase two. Adjusted diluted EPS was $1.02. In line with our expectations and down year over year primarily driven by higher amortization and interest expense as a result of the UW Solutions acquisition. Turning to our segment results. Metals net sales declined primarily due to lower volume partially offset by favorable price and product mix.\n\nAdjusted EBITDA margin improved to 13.5%, primarily driven by increased productivity, including cost savings from Fortify phase two, lower incentive compensation expense, and favorable price and product mix.\n\nMark Ogdahl:These were partially offset by lower volume. Our services segment delivered its seventh consecutive quarter of year-over-year net sales growth. Primarily due to increased volume. Adjusted EBITDA margin increased to 9.7% mostly driven by lower incentive compensation expense. Partially offset by unfavorable project mix. Additionally, backlog for services ended the quarter at $775 million down slightly from Q2 but up over 4% compared to Q3 of last year. Glass net sales increased slightly to approximately $71 million primarily driven by increased volume and favorable mix. Partially offset by lower price driven by end market demand softness. Adjusted EBITDA margin moderated from last year primarily due to lower price and higher material costs.\n\nPartially offset by higher volume favorable product mix, and lower incentive compensation expense. Performance surfaces net sales increased driven by the inorganic sales contribution from the acquisition of UW Solutions. Inorganic growth primarily from price. Adjusted EBITDA margin decreased primarily driven by the dilutive impact of lower adjusted EBITDA margin from the UW Solutions and unfavorable productivity. Partially offset by favorable product mix and price. Turning to cash flow and the balance sheet. For the third quarter, net cash provided by operating activities was $29.3 million down slightly from $31 million in the third quarter of prior year.\n\nOn a year-to-date basis, cash from operating activities was $66.6 million compared to $95.1 million a year ago, due to lower operating cash flow in the first quarter. Our balance sheet remains strong\n\nDon Nolan:with a consolidated leverage ratio of 1.4 times.\n\nMark Ogdahl:No near-term debt maturities and significant capital available for future deployment. Turning now to our outlook for the remainder of fiscal 2026. We are updating our estimates for both net sales and adjusted diluted EPS. We now expect net sales to be approximately $1.39 billion and adjusted diluted EPS in the range of $3.40 to $3.50. This outlook includes an updated estimate of the EPS impact from tariffs of approximately $0.30 Our updated outlook assumes an adjusted effective tax rate of approximately 27% and capital expenditures between $25 million and $30 million The current macroeconomic backdrop remains challenging, in both our metals and glass segments competitive market dynamics continue to put significant pressure on pricing and volume.\n\nAdditionally, in our metal segment, average aluminum prices in the third quarter rose approximately 13% compared to the second quarter and are up over 50% compared to the third quarter of last year. These factors are driving volume pressure and margin compression. And we anticipate this dynamic will continue to impact us through the fourth quarter and to some extent, into fiscal 2027. Additionally, as we look ahead to fiscal 2027, we expect cost headwinds from the normalization of incentive compensation expense. And higher health insurance costs. In order to offset a portion of the anticipated impact of these headwinds, we have expanded the scope of Project Fortify Phase two to include further restructuring actions primarily in metals and corporate.\n\nBased on the expected benefits of the expanded scope of Fortify phase two, we now expect to incur a total of approximately $28 to $29 million in pretax charges and deliver an estimated annual pretax cost savings of approximately $25 to $26 million. With approximately $10 million of that benefit to be realized in fiscal 2027. In addition, we expect the majority of the tariff impact of fiscal 2026 not to repeat. And to be a benefit to fiscal 2027. Although we are on the in the initial stages of our planning for fiscal 2027, we are taking proactive measures.\n\nSuch as the expansion of Fortify phase two to manage near-term headwinds as well as position us to be more agile and better equipped to capitalize on growth opportunities as market conditions stabilize. Finally, I wanna recognize and thank our employees for their resilience and dedication. Their commitment is critical to our success. By executing with rigor today, we are laying the groundwork for long-term value creation opportunities for our shareholders.\n\nDon Nolan:With that,\n\nMark Ogdahl:will now open the call to questions. Operator, please go ahead.\n\nOperator:Thank you. As a reminder, to ask a question at this time, you will need to press 11 on your telephone and wait for your name to be announced. Please stand by while we compile the Q and A roster. First question coming from the line of Brent Thielman with D. A. Davidson. Your line is now open.\n\nBrent Thielman:Hey. Thanks. Good morning. Don, I mean, a lot has changed here since the last earnings call.\n\nDon Nolan:And maybe if you could just start off and talk about what the board is looking for in terms of new leadership on a go forward basis. And is there any different view on the strategic direction of the company going forward versus what's been vocalized is the strategy before, particularly sort of scaling the Performance Services business? Hi, Brent.\n\nBrent Thielman:Thanks for that question. No. No change in strategy. We remain focused on the existing strategies. The strategies that quite frankly, were working, you know, before my tenure. On becoming the economic leader in our target market, continuing to manage the portfolio, and pursuing accretive M&A opportunities in faster growing markets. You UW Solutions being the best example And then, you know, strengthening our core, driving more efficient operations, greater scalability, and enabling, you know, sustained profitable growth. So notes, strict There's no change whatsoever.\n\nBrent Thielman:Okay. And sorry, Don. In terms of what you're looking for in terms of new leadership as you're out with\n\nDon Nolan:CEO search here? Yeah. So look, we started we started our process. And clearly, we're looking for someone who has deep growth and operational excellence experience M&A integration, you know, the things that are called out in our strategy.\n\nBrent Thielman:Alright. And then I mean, in terms of the updated outlook, it looks to me like the big impact there is just discontinued inflation and aluminum that we continue to see post quarter. Assume it's predominantly impacting the metals Yes, Brian, if I could. But that's the yeah. Yeah. Please. I'll let you follow-up with your the rest of your question. No. Just in regard to the outlook. And the updated outlook, looks like it's primarily the metals segment, I presume. If that's the case,\n\nDon Nolan:looks like\n\nBrent Thielman:you're sort of embedding a more severe impact to margins in metals in the fourth quarter relative to what you saw in the third quarter. Is that the right way to think about this? Yeah, Brent. Good observations. You have you know, both I would say both in metals and in glass,\n\nDon Nolan:market dynamics continue to be very they continue to evolve. So, yeah, back on metals, the prime primary issue there is\n\nBrent Thielman:the aluminum prices continue to increase. You know, in our prepared comments, we commented that\n\nDon Nolan:between Q2 and Q3,\n\nBrent Thielman:aluminum prices went up third 13%.\n\nDon Nolan:And then even here in December, we're seeing, you know, continued increases in that price So the margin pressures continue to build.\n\nBrent Thielman:And then, you know, maybe a little bit in glass as well.\n\nDon Nolan:You know, we have about a sixty day window on what we can see for orders. At the '3 or excuse me, at the '2, we thought that we would kinda maintain that level, but we're we're seeing slightly declines there. So we're again, seeing a little bit of an impact both on volume and price going into the fourth quarter. I would tell you, though, that, you know, we you know, we remain focused on managing our margin dollars.\n\nBrent Thielman:So as\n\nDon Nolan:to the best of our abilities, we're controlling costs and implementing things that we can control those costs, Fortify phase two expansion as an example.\n\nBrent Thielman:And I guess not notwithstanding some of these short term pressures that you are seeing in the market, are the long term kind of EBITDA margin targets that you laid out before they'll sort of appropriate to think about? Again, know there's going to be some nuances in the near term for some of the things you called out.\n\nDon Nolan:That's exactly right, Brent.\n\nBrent Thielman:Okay. Okay. Thank you. I'll pass it on.\n\nDon Nolan:Thank you.\n\nOperator:And our next question in queue coming from the line of Jon Braatz with KCCA. Your line is now open.\n\nJon Braatz:Hello?\n\nDon Nolan:Hi, Jon. Oh, I'm sorry. I missed my queue.\n\nJon Braatz:Don, I just want to go back to the\n\nDon Nolan:sort of the strategic direction of the company. And\n\nJon Braatz:how much emphasis you might place on M&A activity because\n\nDon Nolan:let's face it, in the past, it just it hasn't turned out to M&A activity hasn't been that\n\nJon Braatz:positive for Apogee. And it seems to me the focus should be almost exclusively on running the business as profitably as possible\n\nDon Nolan:returning cash flow to\n\nJon Braatz:to shareholders in terms of dividends and share repurchases. So I wanna get a better sense from you as\n\nDon Nolan:where you see M&A going forward.\n\nJon Braatz:Well, look. Our pipeline for M&A is robust. It's very active right now. And, you know, I we have spent a great deal of time and energy building all the processes and systems in the company. To continue to drive M&A. UW Solutions was a great a great acquisition for us. Twelve months in, we have achieved or beat all of our objectives. So you know, it's a business that's growing robustly. You know, our performance services business, that segment, was able to successfully integrate a the UW Solutions almost doubling the size of the business and deliver organic growth at the same time.\n\nSo we've demonstrated that we can execute We can we can select a great acquisition that works for in our strategy. We have the discipline to execute on the integration. And we continue to work our pipeline aggressively.\n\nJon Braatz:Okay. Another question. In the fourth quarter of last year, when Project Fortify was announced, mentioned $26 million in cost, costs that will be incurred and savings of 13 to 15 million.\n\nDon Nolan:And\n\nJon Braatz:this quarter, said cost of 28 million to 29 million a little bit higher. But savings of 25 to 26. Is what's the difference between the fourth quarter savings and what you said here in the first quarter? Am I have something wrong there? Nope. Jon, I'll take that Yes. You're the ranges that you provided were accurate. The increases in costs are primarily head headcount based, and re and holding our cost structure tight, we did incur some footprint related matters in the fourth quarter here.\n\nDon Nolan:Which was the\n\nJon Braatz:the primary cost in the court in the fourth quarter. But, you know, again, we're we're focusing on things that will drive cost savings going forward.\n\nDon Nolan:So the cost savings\n\nJon Braatz:13 to 15 to 25 to 26, that's correct with that number? Yep. That's what we're showing.\n\nDon Nolan:Okay. Alright. Alright. Thank you.\n\nOperator:Thank you. Our next question coming from the line of Gowshihan Sriharan with Singling Research. Your line is now open.\n\nGowshihan Sriharan:Good morning. Can you hear me?\n\nDon Nolan:Yes. Loud and clear.\n\nGowshihan Sriharan:Thank you. Thank you for taking my questions. My first question is on the metals in glass. I know you guys have mentioned some pricing discipline\n\nDon Nolan:with keeping the plants efficiently utilized. How are you thinking about the bid approval process threshold and hurdle mud hurdle margins changing over the six months. I mean, have you walked away from any large pack, projects or packages that might that might leave kind of under absorption risk in early fiscal twenty seven? And are you willing to or when would you start considering the flexibility around the pricing discipline?\n\nDon Nolan:I'll I'll start off, and\n\nMark Ogdahl:then turn it over to Mark. But look, glass is a highly competitive market.\n\nDon Nolan:But the glass team has been working hard maximize EBITDA dollar contribution while protect protecting their premium margins. They faced significant challenges on volume and price, true, But, look, the business is in a much stronger position than during the last downturn. Even with the market challenges that we face today, glass is still operating in the teens EBITDA margin versus mid single digit in the last downturn. So, you know, yes, we're we're gonna continue to focus on maximizing EBITDA dollar contribution. As we move as the market, you know, shifts.\n\nMark Ogdahl:Don, I really I don't really have anything to add. I think you covered up what I thought was important with is, you know, we implemented some really, really nice and solid pricing strategies as we were executing our initiating our current strategy. And we intend to continue on that process. Of course, you know, volume\n\nDon Nolan:matters.\n\nMark Ogdahl:So we need to we need to look at every project and every opportunity when they come across. The other thing I would mention is you know, as was pointed out, you know, fortify one, fortify two,\n\nDon Nolan:we continue to actively manage our cost structure. To mitigate, you know, these short term headwinds. So in addition to making sure that we hold onto our margins and manage the top line appropriately. Also managing our cost structure.\n\nGowshihan Sriharan:Gotcha. And are you seeing any noticeable pricing differences between your, say, your strategic repeat customers as opposed to your more transactional work? Has that\n\nDon Nolan:No. I don't think so.\n\nGowshihan Sriharan:Gap kind of widened or narrow since we spoke, in Q2?\n\nDon Nolan:You know, I think we're we're look. We're seeing higher volume of projects.\n\nMark Ogdahl:In glass for sure.\n\nDon Nolan:And, you know, on average, a little smaller. What we've seen in the past.\n\nMark Ogdahl:Yep. Primarily Oh, it's a very challenging environment. There you go. Thank you. Yes.\n\nGowshihan Sriharan:And on the performance services side, can you kind of unpack on how much of that growth is coming from the high margin SKUs versus kind of mid tier offerings? And with the current mix, would you adjust your long term margin aspirations for that segment?\n\nDon Nolan:Well, we've so we've mentioned this in past quarters. We took some share over the past few quarters in our distribution business. So these are, you know, think of it as retail shelf space. Okay? So we've we've expanded our shelf space. A couple years ago, we lost some. And we gained that back.\n\nMark Ogdahl:And\n\nDon Nolan:that is that is a very attractive business.\n\nGowshihan Sriharan:Gotcha. The other the other area that I might mention is\n\nDon Nolan:look, the UWS solutions, one of the reasons why we thought this was such an attractive acquisition is because it allowed us to enter a part of the flooring market that serves warehouses and manufacturing facilities.\n\nMark Ogdahl:So this is a growth area\n\nDon Nolan:and has demonstrated some nice organic growth for us.\n\nMark Ogdahl:Okay. In our highest in our highest performing segment.\n\nDon Nolan:Yeah. Highest margin segment. Yeah.\n\nGowshihan Sriharan:I'll make this my last question. I know you've highlighted the lower incentive compensation as a tailwind to margin across several segments. This quarter. I know I think you've alluded that there will be some kind of normalization in the intensive compensation. But how should we think about from a sustainability and talent standpoint? Are you structurally resetting some of that incentive programs? Or is this or is this, paying below at a at a at a tough year? Are you as you look at the labor market in your key regions, are you comfortable with the overall comp structure remains competitive? Enough to, execute project 45 and your growth plans.\n\nMark Ogdahl:Yeah. We believe our structure is fine. We just entered a into a more difficult year and our we're not meeting our targets. So our compensation will be less this year, but we expect that to normalize. Into the future.\n\nGowshihan Sriharan:Thank you. That's all I have. Thank you, guys.\n\nOperator:Thank you. Our next question coming from the line of Julio Romero with Sidoti. Your line is now open.\n\nJulio Romero:Thanks. Hey. Good morning. Don, could you help us think about how you view the company's growth trajectory and opportunity set And then also, how does the next leg of growth in your view for the company translate to any change in ROIC hurdles or metrics?\n\nDon Nolan:Well,\n\nJulio Romero:you know, first of all, we'll be the strategy that we're focused on hasn't changed. So we remain focused on becoming the economic leader in the target markets we serve. Managing our portfolio, and strength strengthening the core.\n\nJulio Romero:So\n\nDon Nolan:no change, Julio, in how we think about where we're where we're gonna grow and how. The addition of UW Solutions certainly opened up new markets, new products, that will enable us to grow faster. And as part of our managing portfolio strategy, we continue to look for new opportunities along those lines. So looking for acquisitions that will enable faster growth and at higher margins. We're gonna we're gonna talk a lot more about that on our next call when we talk about fiscal year 2027.\n\nJulio Romero:Okay. Understood. I guess maybe can you dig into a little bit into the priorities that are more near term in nature. Obviously, you have project Fortify expansion any other kind of quicker turn wins, or low hanging fruit that\n\nMark Ogdahl:looking to kind of achieve early on?\n\nDon Nolan:Well,\n\nJulio Romero:delivering the results you know, delivering our results will be critical. Know, we're we're focused on delivering the year. Right now.\n\nJulio Romero:I mean, that's that's front and center.\n\nMark Ogdahl:Hooey, I would just add yes, project four to five phase two is probably the most important, but I would I would suggest that, you know, we're amping up AMS. Again as it as we think about, you know, how we're trying to drive cost structure down, our best tool to do that is through the Apogee management system. So that's that's our that's gonna be our tool to get there.\n\nDon Nolan:I mean, to Frank, Julio, so AMS, I mean, that's one of my observations for the search my first sixty days. Operational excellence of productivity improvements that we've been able to deliver through AMS are truly extraordinary, especially in the glass business. We're seeing strength across the board, safety, quality, on time delivery, you name it. And by the way, that was the birthplace of AMS. So they're leading the way and it shows what we could do with the rest of the company. So it's it'll be a key focus for us. Last thing is, you know, I mentioned a couple times, but accretive M&A, it's it's right. It's front and center too.\n\nWe have a very we have a robust pipeline and we're active.\n\nJulio Romero:Got it. And I guess it just you know, just going back to my first question a little bit more, you know, and it ties into the your comment about robust M&A pipeline. Do you see any kind of you know, viewpoint difference with regards to yourself versus the last management team with regards to kind of kind of you know, IRR hurdles or rate of return hurdles, when you look at that M&A and kind of moving forward with that.\n\nDon Nolan:No. I don't think any difference in the\n\nJulio Romero:in the financial\n\nDon Nolan:analysis, but I would say, you know, move faster. And you know, we move with discipline, of course, but also faster.\n\nJulio Romero:Got it. That's that's helpful. I appreciate it. And then last one for me would just be on you know, you gave some preliminary commentary on your fiscal twenty seven You talked about you don't expect the tariff impact to reoccur in fiscal twenty seven, but any other kind of high level thoughts with regards to how you see, you know, the possibility of revenue or profit growth in '27?\n\nMark Ogdahl:Yeah. I guess I'll reiterate, you know, kind of in the process right now of our doing our AOPs. We highlighted what I viewed are the are the key headwinds and headwinds that have in front of us, tailwinds being project four to five phase two, and the tariffs not repeating. In the headwinds, of course, you know, we've covered now several times with normal normalization of incentive comp and certainly, aluminum prices will continue to be monitored as we go through the fourth quarter and as we scenario plan our AOP.\n\nJulio Romero:Helpful. Best of luck, guys. Thanks.\n\nDon Nolan:Thank you.\n\nOperator:Thank you. And I'm showing no further questions in queue at this time. I will now turn the call back over to Donald for any closing comments.\n\nDon Nolan:Well, thank you for joining us today. We look forward to sharing the fourth quarter and full year results in April. Along with our fiscal 2027 outlet. I would look. I hope you have a great week.\n\nOperator:Ladies and gentlemen, this concludes today's conference call. I Thank you for your participation, and you may now disconnect.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "qa_section": "",
  "source": "motley-fool",
  "word_count": 4629,
  "scraped_at": "2026-01-11T10:52:39.233911",
  "filename": "APOG_2026_Q3_633270.json"
}