{
  "ticker": "CSBR",
  "company": "Champions Oncology",
  "title": "Champions Oncology (CSBR) Earnings Transcript",
  "year": null,
  "quarter": null,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/champions-oncology-csbr-earnings-transcript/",
  "transcript": "NASDAQ:CSBR\n\nChampions Oncology\n\nImage source: The Motley Fool.\n\nDate\n\nMonday, September 15, 2025 at 4:30 p.m. ET\n\nCall participants\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTakeaways\n\nSummary\n\nChampions Oncology(CSBR0.16%)initiated fiscal 2026 with a stabilization in total revenue and a return to positive adjusted EBITDA, following temporary revenue softness in the prior quarter. Management highlighted the platform transition in radiopharmaceutical services as a driver for future margin expansion and announced that the data business has generated revenue for three consecutive quarters. Executive commentary emphasized rising activity among large pharmaceutical clients, reflecting enhanced bookings and revenue conversion as customer budget pressures showed early signs of easing. The company’s cash position improved through positive operating flows and disciplined working capital management, and management underscored a debt-free balance sheet supporting continued organic growth.\n\nIndustry glossary\n\nFull Conference Call Transcript\n\nRobert Brainin:Good afternoon. I'm Rob Brainin, CEO of Champions Oncology, and I'm joined today by our CFO, David Miller. Thank you for joining our quarterly earnings call. Before we begin, I'll remind you that today's remarks may include forward-looking statements. Actual results may differ materially, and more information can be found in our filings with the SEC. As many of you know, fiscal 2025 is a pivotal year for Champions as we rebounded after a difficult 2024 to achieve record annual revenue and profitability. Now as we move into fiscal year 2026, I'm honored to step into the role of leading Champions forward.\n\nMy focus is on building on the strong foundation, sharpening strategic execution and positioning Champions for sustainable long-term growth. Having been on the Board of Directors of Champions Oncology, I have been intimately involved with Ronnie in shaping the strategy, which is strong and will remain consistent. Together, we are committed to driving the large value opportunities we see in Corellia and in our data business while continuing to expand our core TOS platform, which remains the heart and soul of Champions. Turning to the first quarter of fiscal 2026. The company delivered $14 million in revenue, rebounding from temporary softness in Q4. Growth was led by our TOS business with meaningful contributions from our emerging data platform.\n\nThe momentum we built in fiscal 2025 has carried into this year, reinforcing our confidence in continued top line growth. Our foundation remains our industry-leading PDX bank with its deep multiomic characterization. This unique resource continues to power pharmacology studies across biopharma. While the macro environment is still challenging with biotech funding and R&D budgets still under pressure, we are encouraged by improving trends. Customer cancellations are down, bookings to revenue conversion has increased and our growing relationships with large pharma are creating opportunities for larger, more durable bookings. We're also excited about the progress in our radiopharmaceutical services platform.\n\nBacked by our expanded radioactive materials license, new radiochemistry infrastructure and more than 30 screened PDX models, we can now deliver fully integrated workflows from biodistribution to efficacy testing on clinically relevant tumor models. Strategically, this expands our customer offering in a fast-growing field while also reducing costs and improving gross margins by bringing work in-house. Our data platform is also gaining momentum. Since closing our first licensing deal less than a year ago, we've now generated data sales for 3 consecutive quarters. By leveraging our uniquely characterized PDX bank, we're creating the most comprehensive and clinically relevant tumor data set in the industry.\n\nAs AI and machine learning become increasingly central to drug discovery, we see significant long-term opportunity in this business. Finally, Corellia, our wholly owned drug discovery subsidiary, continues to advance. The data emerging from our platform and in vivo experiments is compelling. And despite the funding headwinds in biotech, we remain confident this work will translate into meaningful investment opportunities in the future. In summary, Q1 was a solid start to fiscal 2026. We returned to growth, advanced our strategic initiatives in radiopharma and data and reinforced the foundation for long-term success.\n\nOn a personal note, I'm grateful for the opportunity to lead Champions into this next chapter, and I want to thank Ronnie for his leadership in building a great company with an exceptional team. With the talent, platform and momentum we have in place, I'm confident in our ability to execute and deliver lasting value for our shareholders. And now I'll turn it over to David Miller to discuss our financial results.\n\nDavid Miller:Thanks, Rob, and welcome. Good afternoon, everyone. Before I dive in, just a quick reminder that our full results will be filed on Form 10-Q with the SEC later today. And as always, I'll reference certain non-GAAP metrics with reconciliations to GAAP included in our earnings release. Our first quarter results show that we are back on the path of growth and profitability that characterized most of fiscal 2025 after the pause we experienced in the final quarter of last year. Revenue for Q1 was $14 million. That's essentially flat with the first quarter of last year, but importantly, it represents a solid rebound from the $12.4 million we reported in Q4.\n\nWithin that, our research services business contributed $13.7 million and our data business provided the balance. While the year-over-year comparison looks flat, we view this quarter as a return to stability and the start of renewed momentum for the year ahead. On a GAAP basis, we recorded a loss from operations of $0.5 million compared to income from operations of $1.3 million in the same quarter last year. It's worth noting that this operating loss included about $600,000 in noncash expenses, primarily stock-based compensation and depreciation. If you exclude those, adjusted EBITDA for the quarter was slightly positive at $60,000. That compares to $2 million of adjusted EBITDA in the year ago period. Turning to margins.\n\nCost of sales for the quarter was $8 million compared to $7 million last year. That resulted in a gross margin of 43% versus 50% in Q1 of last year. The margin decline was primarily due to an increase in outsourced lab service costs for our radio labeling work. As we bring this work in-house, we anticipate gross margin expansion. Operating expenses for the quarter were $6 million, up about $1 million from last year. Let me break that down. R&D increased by about $0.6 million as we continue to build our data platform and add depth to our models.\n\nSales and marketing were up about $0.2 million, driven by the expansion of our business development team to support growth in the data business. And G&A increased about $0.2 million, mostly related to IT costs. We expect some of those G&A increases to be temporary as we work through system inefficiencies and find ways to streamline costs. I want to stress that the increases in R&D and sales and marketing were very intentional. These are investments that directly support our data business, which is high margin and strategically important. We're already seeing early signs of payoff in terms of a pipeline expansion, and we expect these investments to support growth in the coming quarters. Turning to cash.\n\nWe ended Q1 with $10.3 million in cash, up $0.5 million from year-end. We remain debt-free, which continues to give us flexibility and resilience. Operating cash flow was positive at $0.6 million supported by receivables conversion and normal working capital activity. Looking forward, we expect to remain roughly cash neutral in the second quarter. Beyond that, we anticipate cash growth in the second half of fiscal 2026 as revenues increased and margins expand. Importantly, we are in a strong position to fund our ongoing operations, continue to invest in organic growth and support any necessary capital expenditures tied to expansion. So to summarize, Q1 was a solid start to fiscal 2026.\n\nWe rebounded from the Q4 softness, stabilized revenue at $14 million, returned to adjusted EBITDA profitability and strengthened our balance sheet. As we look ahead, we expect sequential revenue growth, continued profitability on an adjusted EBITDA basis and margin expansion as radio labeling work shifts in-house. Combined with our growing data business and disciplined cost management, these drivers give us confidence in both the near-term trajectory and our long-term outlook. Our balance sheet is strong with no debt and projected increase in cash and we remain focused on expanding profitability and delivering shareholder value. We look forward to updating you on our second quarter results in mid-December. We will now open the call up to questions.\n\nOperator:[Operator Instructions]The first question comes from George Marema with Pareto Ventures.\n\nGeorge Marema:First question was on the data model. Is there any changes in the strategy on either the business model or go-to-market with the data licensing business?\n\nRobert Brainin:George, thanks for the question. I would just say it's -- there's no changes, just to point blank answer, but it's still early. We've had some early wins. We see a lot of potential there. There's definitely customer engagement and excitement. So we're encouraged, and we've got a pipeline building. So -- and to be honest, it's one of the things that attracted me to Champions, but we still have a lot of work to do. So we'll continue to update that in the coming quarters as we continue to get traction there.\n\nGeorge Marema:And how would you characterize the size of the opportunity of this business relative to the traditional business you have?\n\nRobert Brainin:Boy, I wish I knew that answer for sure. I think it's still early, and it's premature to predict the exact size and success of this opportunity. We know there's potential. We know there's interest. We know that this is the type of data that's feeding the AI and ML models that is fueling the latest rounds of drug discovery and development as to how much of that we can capture we'll find out together as we execute on these deals.\n\nGeorge Marema:Okay. And then on Corellia, what are some of like the frameworks that you guys are entertaining and structuring deals with that? Is it more of a royalty milestone framework or other frameworks or how are you looking at this?\n\nRobert Brainin:We're looking at it. It's a wholly owned subsidiary of Champions, and we are actively involved in raising funds to help fund and support that wholly owned subsidiary, looking for external partners and funding to help them continue to advance the great work that they're doing. We're very encouraged by the data we're seeing there. It's quite compelling, and we'd like to bring in some external investment to help drive that forward.\n\nOperator:[Operator Instructions]The next question comes from Matthew Hewitt with Craig-Hallum.\n\nTollef Kohrman:This is Tollef Kohrman on for Matt. Can you please provide some color on the broader investment landscape and what you're seeing from customers?\n\nRobert Brainin:Yes. It's still a tough environment. I think it's consistent with what Ronnie has kind of shared over the past several quarters. We're cautiously optimistic that the market is improving and the budget constraints that have been out there are starting to ease. So we see glimmers of hope, but at the same time, I don't -- I certainly don't think the floodgates have opened. So I put us squarely in that cautiously optimistic camp that things are turning around.\n\nAnd we really feel well positioned as they do with our proprietary tumor bank, and the work that we've done and are continuing to do internally to improve our processes and strategies, and it gives a good opportunity with me coming in for Ronnie to really continue to do that and drive that. And hopefully, as that window continues to open, we're well positioned to execute on it.\n\nTollef Kohrman:Okay. And I realize you don't have a crystal ball, but you're speaking to second half of this year with margin expansion and growth in the top line. So would you consider a stabilization period to be more first half of this year?\n\nRobert Brainin:Yes. Maybe I'll ask David to take that one. My crystal ball is pretty fuzzy to you, David, I don't know if you want to comment there?\n\nDavid Miller:Sure. Yes, we definitely feel like this is potentially the low point for the fiscal year in terms of revenue, and we do anticipate that it will expand over the coming quarters. I think as we look ahead, just to reflect back on the previous question that we had from George, one of the big drivers will be data and whether or not we're able to convert that this year as opposed to sometimes things get delayed by a couple of months and then flips into next year. So we certainly feel from a services business, we see revenue building gradually over the coming year.\n\nAnd then like I said, where we really wish we had that crystal ball was on when some of these data deals will hit.\n\nOperator:[Operator Instructions]We have a question coming from [ Clay Hoffman ] with Hoffman.\n\nUnknown Analyst:Yes. Do you guys have any color on Q2 so far on revenue compared to last year? You're about halfway through the quarter.\n\nDavid Miller:We certainly have a good handle on where revenue will come out where specifically I'm not giving specific guidance in terms of what that number will be. As I just said before, I do anticipate that our revenue will increase on a quarterly basis. But in terms of the exact numbers or percentages, we're not ready to provide that type of guidance at this time.\n\nOperator:We have no further questions in queue. I'd like to turn the floor back to management for any closing remarks.\n\nRobert Brainin:Yes. Thank you. I'm excited to have joined the operating team and ready to dig in more. This is still less than 1 month on the job for me. But in that, I'll reiterate my appreciation to Ronnie for being a great partner as I transition in. I am a real believer in the potential of this business, and that's across all 3 vectors. Our core TOS business, our data opportunity and then the great work that the Corellia team has done. And I look forward to sharing the progress made on some of these questions you've asked at our next earnings call in mid-December. Thanks for joining us today.\n\nOperator:This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:CSBR\n\nChampions Oncology\n\nImage source: The Motley Fool.\n\nDate\n\nMonday, September 15, 2025 at 4:30 p.m. ET\n\nCall participants\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTakeaways\n\nSummary\n\nChampions Oncology(CSBR0.16%)initiated fiscal 2026 with a stabilization in total revenue and a return to positive adjusted EBITDA, following temporary revenue softness in the prior quarter. Management highlighted the platform transition in radiopharmaceutical services as a driver for future margin expansion and announced that the data business has generated revenue for three consecutive quarters. Executive commentary emphasized rising activity among large pharmaceutical clients, reflecting enhanced bookings and revenue conversion as customer budget pressures showed early signs of easing. The company’s cash position improved through positive operating flows and disciplined working capital management, and management underscored a debt-free balance sheet supporting continued organic growth.\n\nIndustry glossary\n\nFull Conference Call Transcript\n\nRobert Brainin:Good afternoon. I'm Rob Brainin, CEO of Champions Oncology, and I'm joined today by our CFO, David Miller. Thank you for joining our quarterly earnings call. Before we begin, I'll remind you that today's remarks may include forward-looking statements. Actual results may differ materially, and more information can be found in our filings with the SEC. As many of you know, fiscal 2025 is a pivotal year for Champions as we rebounded after a difficult 2024 to achieve record annual revenue and profitability. Now as we move into fiscal year 2026, I'm honored to step into the role of leading Champions forward.\n\nMy focus is on building on the strong foundation, sharpening strategic execution and positioning Champions for sustainable long-term growth. Having been on the Board of Directors of Champions Oncology, I have been intimately involved with Ronnie in shaping the strategy, which is strong and will remain consistent. Together, we are committed to driving the large value opportunities we see in Corellia and in our data business while continuing to expand our core TOS platform, which remains the heart and soul of Champions. Turning to the first quarter of fiscal 2026. The company delivered $14 million in revenue, rebounding from temporary softness in Q4. Growth was led by our TOS business with meaningful contributions from our emerging data platform.\n\nThe momentum we built in fiscal 2025 has carried into this year, reinforcing our confidence in continued top line growth. Our foundation remains our industry-leading PDX bank with its deep multiomic characterization. This unique resource continues to power pharmacology studies across biopharma. While the macro environment is still challenging with biotech funding and R&D budgets still under pressure, we are encouraged by improving trends. Customer cancellations are down, bookings to revenue conversion has increased and our growing relationships with large pharma are creating opportunities for larger, more durable bookings. We're also excited about the progress in our radiopharmaceutical services platform.\n\nBacked by our expanded radioactive materials license, new radiochemistry infrastructure and more than 30 screened PDX models, we can now deliver fully integrated workflows from biodistribution to efficacy testing on clinically relevant tumor models. Strategically, this expands our customer offering in a fast-growing field while also reducing costs and improving gross margins by bringing work in-house. Our data platform is also gaining momentum. Since closing our first licensing deal less than a year ago, we've now generated data sales for 3 consecutive quarters. By leveraging our uniquely characterized PDX bank, we're creating the most comprehensive and clinically relevant tumor data set in the industry.\n\nAs AI and machine learning become increasingly central to drug discovery, we see significant long-term opportunity in this business. Finally, Corellia, our wholly owned drug discovery subsidiary, continues to advance. The data emerging from our platform and in vivo experiments is compelling. And despite the funding headwinds in biotech, we remain confident this work will translate into meaningful investment opportunities in the future. In summary, Q1 was a solid start to fiscal 2026. We returned to growth, advanced our strategic initiatives in radiopharma and data and reinforced the foundation for long-term success.\n\nOn a personal note, I'm grateful for the opportunity to lead Champions into this next chapter, and I want to thank Ronnie for his leadership in building a great company with an exceptional team. With the talent, platform and momentum we have in place, I'm confident in our ability to execute and deliver lasting value for our shareholders. And now I'll turn it over to David Miller to discuss our financial results.\n\nDavid Miller:Thanks, Rob, and welcome. Good afternoon, everyone. Before I dive in, just a quick reminder that our full results will be filed on Form 10-Q with the SEC later today. And as always, I'll reference certain non-GAAP metrics with reconciliations to GAAP included in our earnings release. Our first quarter results show that we are back on the path of growth and profitability that characterized most of fiscal 2025 after the pause we experienced in the final quarter of last year. Revenue for Q1 was $14 million. That's essentially flat with the first quarter of last year, but importantly, it represents a solid rebound from the $12.4 million we reported in Q4.\n\nWithin that, our research services business contributed $13.7 million and our data business provided the balance. While the year-over-year comparison looks flat, we view this quarter as a return to stability and the start of renewed momentum for the year ahead. On a GAAP basis, we recorded a loss from operations of $0.5 million compared to income from operations of $1.3 million in the same quarter last year. It's worth noting that this operating loss included about $600,000 in noncash expenses, primarily stock-based compensation and depreciation. If you exclude those, adjusted EBITDA for the quarter was slightly positive at $60,000. That compares to $2 million of adjusted EBITDA in the year ago period. Turning to margins.\n\nCost of sales for the quarter was $8 million compared to $7 million last year. That resulted in a gross margin of 43% versus 50% in Q1 of last year. The margin decline was primarily due to an increase in outsourced lab service costs for our radio labeling work. As we bring this work in-house, we anticipate gross margin expansion. Operating expenses for the quarter were $6 million, up about $1 million from last year. Let me break that down. R&D increased by about $0.6 million as we continue to build our data platform and add depth to our models.\n\nSales and marketing were up about $0.2 million, driven by the expansion of our business development team to support growth in the data business. And G&A increased about $0.2 million, mostly related to IT costs. We expect some of those G&A increases to be temporary as we work through system inefficiencies and find ways to streamline costs. I want to stress that the increases in R&D and sales and marketing were very intentional. These are investments that directly support our data business, which is high margin and strategically important. We're already seeing early signs of payoff in terms of a pipeline expansion, and we expect these investments to support growth in the coming quarters. Turning to cash.\n\nWe ended Q1 with $10.3 million in cash, up $0.5 million from year-end. We remain debt-free, which continues to give us flexibility and resilience. Operating cash flow was positive at $0.6 million supported by receivables conversion and normal working capital activity. Looking forward, we expect to remain roughly cash neutral in the second quarter. Beyond that, we anticipate cash growth in the second half of fiscal 2026 as revenues increased and margins expand. Importantly, we are in a strong position to fund our ongoing operations, continue to invest in organic growth and support any necessary capital expenditures tied to expansion. So to summarize, Q1 was a solid start to fiscal 2026.\n\nWe rebounded from the Q4 softness, stabilized revenue at $14 million, returned to adjusted EBITDA profitability and strengthened our balance sheet. As we look ahead, we expect sequential revenue growth, continued profitability on an adjusted EBITDA basis and margin expansion as radio labeling work shifts in-house. Combined with our growing data business and disciplined cost management, these drivers give us confidence in both the near-term trajectory and our long-term outlook. Our balance sheet is strong with no debt and projected increase in cash and we remain focused on expanding profitability and delivering shareholder value. We look forward to updating you on our second quarter results in mid-December. We will now open the call up to questions.\n\nOperator:[Operator Instructions]The first question comes from George Marema with Pareto Ventures.\n\nGeorge Marema:First question was on the data model. Is there any changes in the strategy on either the business model or go-to-market with the data licensing business?\n\nRobert Brainin:George, thanks for the question. I would just say it's -- there's no changes, just to point blank answer, but it's still early. We've had some early wins. We see a lot of potential there. There's definitely customer engagement and excitement. So we're encouraged, and we've got a pipeline building. So -- and to be honest, it's one of the things that attracted me to Champions, but we still have a lot of work to do. So we'll continue to update that in the coming quarters as we continue to get traction there.\n\nGeorge Marema:And how would you characterize the size of the opportunity of this business relative to the traditional business you have?\n\nRobert Brainin:Boy, I wish I knew that answer for sure. I think it's still early, and it's premature to predict the exact size and success of this opportunity. We know there's potential. We know there's interest. We know that this is the type of data that's feeding the AI and ML models that is fueling the latest rounds of drug discovery and development as to how much of that we can capture we'll find out together as we execute on these deals.\n\nGeorge Marema:Okay. And then on Corellia, what are some of like the frameworks that you guys are entertaining and structuring deals with that? Is it more of a royalty milestone framework or other frameworks or how are you looking at this?\n\nRobert Brainin:We're looking at it. It's a wholly owned subsidiary of Champions, and we are actively involved in raising funds to help fund and support that wholly owned subsidiary, looking for external partners and funding to help them continue to advance the great work that they're doing. We're very encouraged by the data we're seeing there. It's quite compelling, and we'd like to bring in some external investment to help drive that forward.\n\nOperator:[Operator Instructions]The next question comes from Matthew Hewitt with Craig-Hallum.\n\nTollef Kohrman:This is Tollef Kohrman on for Matt. Can you please provide some color on the broader investment landscape and what you're seeing from customers?\n\nRobert Brainin:Yes. It's still a tough environment. I think it's consistent with what Ronnie has kind of shared over the past several quarters. We're cautiously optimistic that the market is improving and the budget constraints that have been out there are starting to ease. So we see glimmers of hope, but at the same time, I don't -- I certainly don't think the floodgates have opened. So I put us squarely in that cautiously optimistic camp that things are turning around.\n\nAnd we really feel well positioned as they do with our proprietary tumor bank, and the work that we've done and are continuing to do internally to improve our processes and strategies, and it gives a good opportunity with me coming in for Ronnie to really continue to do that and drive that. And hopefully, as that window continues to open, we're well positioned to execute on it.\n\nTollef Kohrman:Okay. And I realize you don't have a crystal ball, but you're speaking to second half of this year with margin expansion and growth in the top line. So would you consider a stabilization period to be more first half of this year?\n\nRobert Brainin:Yes. Maybe I'll ask David to take that one. My crystal ball is pretty fuzzy to you, David, I don't know if you want to comment there?\n\nDavid Miller:Sure. Yes, we definitely feel like this is potentially the low point for the fiscal year in terms of revenue, and we do anticipate that it will expand over the coming quarters. I think as we look ahead, just to reflect back on the previous question that we had from George, one of the big drivers will be data and whether or not we're able to convert that this year as opposed to sometimes things get delayed by a couple of months and then flips into next year. So we certainly feel from a services business, we see revenue building gradually over the coming year.\n\nAnd then like I said, where we really wish we had that crystal ball was on when some of these data deals will hit.\n\nOperator:[Operator Instructions]We have a question coming from [ Clay Hoffman ] with Hoffman.\n\nUnknown Analyst:Yes. Do you guys have any color on Q2 so far on revenue compared to last year? You're about halfway through the quarter.\n\nDavid Miller:We certainly have a good handle on where revenue will come out where specifically I'm not giving specific guidance in terms of what that number will be. As I just said before, I do anticipate that our revenue will increase on a quarterly basis. But in terms of the exact numbers or percentages, we're not ready to provide that type of guidance at this time.\n\nOperator:We have no further questions in queue. I'd like to turn the floor back to management for any closing remarks.\n\nRobert Brainin:Yes. Thank you. I'm excited to have joined the operating team and ready to dig in more. This is still less than 1 month on the job for me. But in that, I'll reiterate my appreciation to Ronnie for being a great partner as I transition in. I am a real believer in the potential of this business, and that's across all 3 vectors. Our core TOS business, our data opportunity and then the great work that the Corellia team has done. And I look forward to sharing the progress made on some of these questions you've asked at our next earnings call in mid-December. Thanks for joining us today.\n\nOperator:This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "qa_section": "",
  "source": "motley-fool",
  "word_count": 2555,
  "scraped_at": "2026-01-11T17:55:05.203504",
  "filename": "CSBR_None_QNone_3bc211.json"
}