{
  "ticker": "CSPI",
  "company": "CSP",
  "title": "CSP (CSPI) Q1 2025 Earnings Call Transcript",
  "year": 2025,
  "quarter": 1,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/csp-cspi-q1-2025-earnings-call-transcript/",
  "transcript": "NASDAQ:CSPI\n\nCsp\n\nImage source: The Motley Fool.\n\nDate\n\nMonday, Feb. 10, 2025 at 10 a.m. ET\n\nCall participants\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTakeaways\n\nSummary\n\nCSP(CSPI+1.22%)management outlined a business performance driven by expanding service revenue, margin gains, and recurring revenue growth in critical markets. Channel strategy for AZT PROTECT was emphasized, with initial Rockwell Automation distribution agreements newly executed and further expansion targeted before the end of the month. Patent portfolio development continues alongside new customer wins and renewal activity in the OT security space. Management reported the company is budgeting for a \"significant increase in revenue\" from AZT PROTECT in the current fiscal year.\n\nIndustry glossary\n\nFull Conference Call Transcript\n\nMichael Polyviou:Thank you, Paul. Hello, everyone, and thank you for joining us to review CSPi's Fiscal 2025 First Quarter Financial Results, as well as recent operating developments. The fiscal quarter ended December 31, 2024. Today, with me on the call is Victor Dellovo, CSPi's Chief Executive Officer; and Gary Levine, CSPi's Chief Financial Officer. After Victor and Gary conclude their opening remarks, we'll then open the call for questions. During the Q&A session, we ask participants to limit themselves to one question and one follow-up question and then re-queue if they have additional questions.\n\nStatements made by CSPi's management on today's call regarding the company's business that are not historical facts may be forward-looking statements as terms identified in federal securities laws. The words may, will, expect, believe, anticipate, project, plan, intend, estimate and continue, as well as similar expressions are intended to identify forward-looking statements. Forward-looking statements should not be meant as a guarantee of future performance or results. The company cautions you that these statements reflect current expectations about the company's future performance or events and are subject to several uncertainties, risks, and other influences, many of which are beyond the company's control that may influence the accuracy of the statements and the projections upon which the segment and statements are based.\n\nFactors that may affect the company's results include, but are not limited to, the risks and uncertainties discussed in the Risk Factors section of the annual report on Form 10-K and the quarterly report on Form 10-Q filed with the Securities and Exchange Commission. Forward-looking statements are based on information available at the time those statements are made and management's good faith belief as of the time with respect to future events. All forward-looking statements are qualified in entirety by this cautionary statement and CSPi undertakes no obligation to publicly revise or update any forward-looking statements, whether as a result of new information, future events or otherwise after the date thereof.\n\nWith that, I'll turn the call over to Victor Dellovo, Chief Executive Officer. Victor, please go ahead.\n\nVictor Dellovo:Thanks, Michael, and good morning, everyone. It has been less than two months since we last talked with you. And during the first quarter, our business maintained the momentum we described to you back in December. We generated an increase in total revenue, boosted by 17% in service revenue and expanded our gross margins by a healthy 200 basis points, while earning $0.05 per diluted common share. We finished the quarter with more than $30 million in cash and cash equivalent, while continuing to invest in our AZT PROTECT product line. And the Board of Directors authorized another $0.03 per share quarterly cash dividend.\n\nOur Technology Solutions business once again led the way for us during the quarter, generating approximately $15.2 million in sales. We've added a second major cruise line order to the one we mentioned back in December, and we continue to succeed in the ocean freight liner market, where we continue to add new ships whose operators are utilizing a managed service offering following the retrofit, boosting a monthly recurring revenue. Another bright spot during the quarter was the increased demand for our cloud-based service from companies wanting to outsource these critical needs to our value tested platform. Overall, service revenue grew 17% during the quarter and drove our gross margins up 200 basis points.\n\nWe continue to introduce AZT PROTECT into the Operational Technology, OT, markets where the need for enhanced solutions have never been higher. We signed up several new customers during the first quarter and are in the process to increase both the referenceable industries we are addressing, as well as customers for whom we are providing critical cybersecurity solutions. We should also note that the large pharmaceutical company that purchased AZT PROTECT a year ago has renewed their annual 6-figure post-contract support agreement, and we are glad to report they are completely satisfied with the product and related services.\n\nAn example of how we are building presence for AZT PROTECT and target operational technology, cybersecurity markets, is a partnership we announced with Unified (sic) United Flow Technologies just before the end of the calendar year. UFT provides products and system integration services to water and waste treatment facilities located in 40 states. Water treatment facilities have hard hit by zero-day malware and ransomware that today's cybersecurity solutions struggle to prevent. In addition, these facilities are often targeted by nation state-sponsored attacks that bypass today's leading protection measures.\n\nWe are now working with UFT to implement AZT PROTECT into water treatment operations to better protect them against cyber attacks and our first deployment included protecting one of UFT's own operational technology facilities. AZT PROTECT uses AI-based countermeasures to stop categories of attacks as they land on the water treatment facilities most vulnerable critical production and control systems. These countermeasures lock down critical applications from adulteration while stopping code-based attacks such as malware and ransomware from executing. Further, they disrupt any nation state effort to take control of the facility.\n\nUFT has more than 16,000 customers to sell a built-in solution for effective cyber protection, and we are quite excited about the potential for our partnership as the referenceable installations are developed. AZT PROTECT also has the ability to drive our high-performance product business, and we expect to see increasing levels of revenue from our partnership with the likes of UFT and Rockwell Automation as the fiscal year unfolds. As we reported back in December, we had a very successful participation in the Rockwell Automation Fair back in late November 2024. With Gary Southwell, our Vice President and General Manager of a high-performance presenting an in-depth review of the latest attack techniques in their financial impact.\n\nGary's presentation as well as our participation in the American Petroleum Institute show for oil and natural gas resulted in generating approximately a 100 leads. We've been following up on these leads with several already transitioning into active proposals. We are hoping to convert a growing number of these proposals to orders during the next couple of quarters with the help of our Rockwell distribution partners. Along those lines, we have targeted the top U.S. Rockwell distributors having signed up 3 and hoping to have 2 more signed by the end of this month.\n\nOur strategy with the Rockwell distribution channel is to focus on the middle market OT customers, which tend to have a shorter sales cycle than the larger OT organizations and successfully executing on this strategy will be a major factor behind our performance for the remainder of fiscal 2025. With the large OT customers, our internal sales team continues to address the market, which have sales cycles up to 18 months. Our typical point of entry is through a project for one operation. And then as the installation proves its worth, we are introducing to other opportunities within the corporate entity.\n\nWe are actively working that expansion opportunity as many - as the results from AZT PROTECT are certainly worthy of broader system rollout at these big customers. All of our sales and marketing efforts is supported by the 9 major industry awards AZT PROTECT has received since its launch, including the winner of the application security category at the 2024 Fortress Cyber Security Award presented by Business Intelligence Group. We continue to benefit from the CrowdStrike update failure of last July, with the risk that continuous cloud updates can have on an OT applications, including industrial automation, industries control systems.\n\nThere is a growing recognition from the industrial automation vendors that their distribution channels that the traditional IT-focused endpoint protection methodologies are not meeting their requirements. In summary, we are off to a solid start for fiscal 2025, and we are working to continue this momentum as the year progresses. With that, I will now ask Gary to provide a brief overview of the fiscal first quarter financial performance.\n\nGary Levine:Thanks, Victor. For the first quarter ended December 31, 2024, we reported revenue of $15.7 million as compared to $15.4 million for the prior year's first quarter and $13 million for the fiscal fourth quarter ended September 30, 2024. Service revenue represented $4.7 million of overall sales, compared to $4 million of overall sales during the year ago period and $4 million of overall sales during the fiscal 2024 fourth quarter. Gross profit for the 3 months ended December 31, 2024, was $4.6 million or 29.1% of sales, compared to gross profit of $4.1 million or 26.6% of sales for the quarter ended December 31, 2024, reflecting the continued execution of the company's strategy to focus on higher-margin offerings.\n\nDriven by the improved gross margin, interest income and foreign currency exchange, the company reported net income of $472,000 or $0.05 per diluted common share for the fiscal first quarter, compared to a net loss of $73,000 or $0.01 per diluted common share for the prior fiscal year's first quarter. For the fiscal first quarter, our engineering and development expenses were $786,000 compared to $700,000. The increase was for outside consulting services and stock compensation. For SG&A, was at $4.1 million, compared to $3.7 million in the year ago fiscal quarter.\n\nThe increase was marketing expenses for the trade show and travel expenses as we scaled up our conferences and participation for the AZT PROTECT and for higher commission on sales in the TS group. The company had a tax benefit from a reversal of the valuation allowance related to expiring state and R&D credit and investment credits and benefits from our federal R&D credit. The company continues to maintain a robust balance sheet as of December 31, 2024, and had cash and cash equivalents of $30.7 million. The higher cash balance relative to liabilities enhances the company's resources to pay a quarterly cash dividend while executing growth, which includes the continued rollout and market awareness of the AZT PROTECT offering.\n\nWith that, I will turn it over to the operator for questions.\n\nOperator:Thank you.[Operator Instructions]And the first question today is coming from Joseph Nerges from Segren Investments. Joseph, your line is live.\n\nJoseph Nerges:Good morning, guys. How are you today?\n\nVictor Dellovo:Good morning, Joe.\n\nGary Levine:Good morning, Joe.\n\nJoseph Nerges:First, I want to thank you guys for the time that you gave all two of these investors that were at the annual meeting last week. And I want to start with one question that, this is from off your LinkedIn webpage. And it was sort of a summation of AZT PROTECT, which had said no updates, no upgrades, no daily maintenance, saves time, reduce expenses. This is a sort of a summation of what AZT PROTECT in managing that in the – any security can have in managing it, except for one exception there, and you mentioned it at the annual meeting, I think it's important.\n\nWe are – you are doing – you are currently doing a slight – well, an additional feature upgrade to AZT PROTECT. You haven't announced it yet, but there is some work on an upgrade and I just wanted to get that on the record.\n\nVictor Dellovo:You're correct. We will announce it soon.\n\nJoseph Nerges:Okay. Very good. Thank you. And one other point, I know we've discussed this in the past. You have a number of patents that were already been assigned or awarded to you on the ARIA platform. And I'm assuming you have some pending patents to, do you have a summation of that at all, of the total we have on that?\n\nVictor Dellovo:Yes. Three have been completed. Two more have gone through all office actions by the patent office and are expected to issue by year-end. And then two more recent submissions that should be done sometimes in 2026. So, three issued - in the middle stages.\n\nJoseph Nerges:All right. Thanks a lot. Appreciate it. I will leave it open to somebody else ask the questions.\n\nVictor Dellovo:Thanks Joe.\n\nOperator:Thank you.[Operator Instructions]The next question is coming from Brett Davidson from [Investletter] (Ph). Brett, your line is live.\n\nUnidentified Analyst:Good morning gentlemen. I have questions regarding the AZT sales. I was wondering if you guys could shed some light on what sales channels those sales have been coming through? And I know Victor, you indicated that the Rockwell is going to be important in the rest of the year. Have any of those sales come through the Rockwell sales channel?\n\nVictor Dellovo:No. Those have all been the stuff that we've been working on. The Rockwell channels, we literally have just been setting up contracts with these large distributors. I announced one. I think you guys saw CED back a month ago or so. And there will be another announcement here soon of another one. And then the other ones are, we're pretty close to signing. So, I'll announce all of those as they come along, but these channels are really, really new. So, some of the sales we've had have been the ones we've been working on for months or years.\n\nUnidentified Analyst:So, you're anticipating that some of these Rockwell partners are going to generate sales through the course of the year?\n\nVictor Dellovo:Yes, absolutely. Absolutely. We're hoping that next quarter, if everything goes well because the way we're going to work it is, we're going to push all the – even sales come directly to us, we're going to stop pushing it through the Rockwell channels of some sort. So, that's our game plan long-term is to fulfill all through the Rockwell channels.\n\nUnidentified Analyst:And one other quick question. Is there anything that prevents AZT from being sold into overseas markets?\n\nVictor Dellovo:No.\n\nUnidentified Analyst:Perfect. All right. Thank you very much.\n\nVictor Dellovo:Thank you, Brett.\n\nOperator:Thank you. The next question will be from Mike Price, Mike is a Private Investor. Mike, your line is live.\n\nMike Price:Good morning. Thanks for taking my question. It was July of 2023 that you first issued the press release, calling AZT game-changing technology. And a month later, you said that CSPi lacks name recognition. And at that time, I asked if you have game-changing technology without the name recognition, you're better off trying to find a partner that can get this into a market more quickly and in a big way. And here it is, and you said at that time, it's only been 30 days. So, here we are 19 months later, and you won 9 awards, which has, I assume, given you visibility and credibility. You've got several resellers and the Rockwell relationship.\n\nAnd the AZT revenues are not material in an OT market that you have estimated at about $50 billion. And the last conference call, the year-end conference call you said that this is pretty much like a start-up and you're building infrastructure. So, the question is, have you gone to somebody with name recognition or has somebody come to you saying, you have game-changing technology? We have infrastructure, you don't. We have name recognition, you don't, where this could get into the market more quickly in a bigger way. And this isn't seemingly just important to the CSPi's shareholders, but it seems to be important for national security.\n\nVictor Dellovo:The quick answer to that is no one's approached us and working with these large distributors is our first step into trying to build a name recognition and get into more feet on the street.\n\nMike Price:Okay. But with the larger customers where you say it's harder to get in the door, you haven't gone to anybody looking for any kind of partnership to get this done in a big way. Because when you put out some of these blogs about 2024 in review and 2025, what's in front of first cybersecurity measures, these things all take time, and every day that passes, there's higher risk to infrastructure as they're not. So, it seems like the sooner that AZT gets in the market, the better and the safer it is for everybody.\n\nVictor Dellovo:Absolutely. We're evangelizing that through our partners directly to the customers, we’re at our trade shows. We have Gary Southwell, we’re speaking to him. We're trying to get the blogs. We're trying to – it's education. With the Rockwell Partners, it's all about training them right now, getting in front of them, getting the message out to them on how to position it, where it falls in place, why it's different than the other products that are out there, how we complement in case you come up with some issues of, oh, we already have this product, the messaging and how we – while there’s still falls in those products. As you can see, there are people getting hacked constantly.\n\nThis is how we would protect that infrastructure along with whatever product they may be using already. So, unfortunately, things take time as impatient as probably most people are, but we are definitely working the channels, working in the messaging, developing the product and trying to evangelize in as many areas as possible to get that messaging out there. And a lot of people still have that. Even with the news as what it is, a lot of people will be like, well, I haven't been hacked yet, so, I'll be okay right now. And then we have to be like, well, it's only a matter of time when you won't be saying that.\n\nMike Price:Do you see an inflection sometime this year where we see some kind of significant ramp-up in AZT revenues? You think it takes place as soon as this year? Or is it longer [period now] [ph]?\n\nVictor Dellovo:We're counting on this year to have a significant increase in revenue Yes. We're budgeting for that.\n\nMike Price:Okay. All right. Thank you.\n\nOperator:Thank you.[Operator Instructions]We did have another question coming in from Mike Price. Mike, your line is live.\n\nMike Price:Yeah, thanks for taking another question. This comes up every quarter. Joe Nerges didn't ask it, but the question about using some of the cash to buy back shares. And if you are so optimistic about AZT and the future of CSPi, it still seems like a good use of the cash, especially at least to offset any shares that go to management and directors, such that the rest of the CSPi shareholders aren't diluted. Can you comment on using cash to buy back shares a little bit more aggressively than the past?\n\nVictor Dellovo:Well, last quarter, we were in a complete blackout period at [Indiscernible] and we're actively looking at it to support the stock this quarter and then in the future.\n\nMike Price:Right. But the quarter before, I think you bought, what, 4,200 shares, it's been nominal from one quarter to the next.\n\nGary Levine:Yes. We're taking a good close look at that, Mike. So, we will be purchasing probably more shares going forward.\n\nMike Price:Okay. And again, I know it's a pretty good size number that is going to management, but you can see if management is getting these shares, and you don't use cash to buy back shares. My position, and everybody else's position in CSPi is somewhat diluted, right? So...\n\nGary Levine:Understand.\n\nMike Price:Okay. All right. Thank you. Appreciate it.\n\nOperator:Thank you. And there were no other questions from the lines at this time. I will now hand the call back to Victor Dellovo for closing remarks.\n\nVictor Dellovo:Thank you. As always, I want to thank our shareholders for their continued interest and support. Our results in Q1 demonstrated the progress we are making and the success also highlights the ever-growing market interest of AZT PROTECT. We look forward to updating you on our Q2 progress in May. Thank you.\n\nOperator:This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:CSPI\n\nCsp\n\nImage source: The Motley Fool.\n\nDate\n\nMonday, Feb. 10, 2025 at 10 a.m. ET\n\nCall participants\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTakeaways\n\nSummary\n\nCSP(CSPI+1.22%)management outlined a business performance driven by expanding service revenue, margin gains, and recurring revenue growth in critical markets. Channel strategy for AZT PROTECT was emphasized, with initial Rockwell Automation distribution agreements newly executed and further expansion targeted before the end of the month. Patent portfolio development continues alongside new customer wins and renewal activity in the OT security space. Management reported the company is budgeting for a \"significant increase in revenue\" from AZT PROTECT in the current fiscal year.\n\nIndustry glossary\n\nFull Conference Call Transcript",
  "qa_section": "Michael Polyviou:Thank you, Paul. Hello, everyone, and thank you for joining us to review CSPi's Fiscal 2025 First Quarter Financial Results, as well as recent operating developments. The fiscal quarter ended December 31, 2024. Today, with me on the call is Victor Dellovo, CSPi's Chief Executive Officer; and Gary Levine, CSPi's Chief Financial Officer. After Victor and Gary conclude their opening remarks, we'll then open the call for questions. During the Q&A session, we ask participants to limit themselves to one question and one follow-up question and then re-queue if they have additional questions.\n\nStatements made by CSPi's management on today's call regarding the company's business that are not historical facts may be forward-looking statements as terms identified in federal securities laws. The words may, will, expect, believe, anticipate, project, plan, intend, estimate and continue, as well as similar expressions are intended to identify forward-looking statements. Forward-looking statements should not be meant as a guarantee of future performance or results. The company cautions you that these statements reflect current expectations about the company's future performance or events and are subject to several uncertainties, risks, and other influences, many of which are beyond the company's control that may influence the accuracy of the statements and the projections upon which the segment and statements are based.\n\nFactors that may affect the company's results include, but are not limited to, the risks and uncertainties discussed in the Risk Factors section of the annual report on Form 10-K and the quarterly report on Form 10-Q filed with the Securities and Exchange Commission. Forward-looking statements are based on information available at the time those statements are made and management's good faith belief as of the time with respect to future events. All forward-looking statements are qualified in entirety by this cautionary statement and CSPi undertakes no obligation to publicly revise or update any forward-looking statements, whether as a result of new information, future events or otherwise after the date thereof.\n\nWith that, I'll turn the call over to Victor Dellovo, Chief Executive Officer. Victor, please go ahead.\n\nVictor Dellovo:Thanks, Michael, and good morning, everyone. It has been less than two months since we last talked with you. And during the first quarter, our business maintained the momentum we described to you back in December. We generated an increase in total revenue, boosted by 17% in service revenue and expanded our gross margins by a healthy 200 basis points, while earning $0.05 per diluted common share. We finished the quarter with more than $30 million in cash and cash equivalent, while continuing to invest in our AZT PROTECT product line. And the Board of Directors authorized another $0.03 per share quarterly cash dividend.\n\nOur Technology Solutions business once again led the way for us during the quarter, generating approximately $15.2 million in sales. We've added a second major cruise line order to the one we mentioned back in December, and we continue to succeed in the ocean freight liner market, where we continue to add new ships whose operators are utilizing a managed service offering following the retrofit, boosting a monthly recurring revenue. Another bright spot during the quarter was the increased demand for our cloud-based service from companies wanting to outsource these critical needs to our value tested platform. Overall, service revenue grew 17% during the quarter and drove our gross margins up 200 basis points.\n\nWe continue to introduce AZT PROTECT into the Operational Technology, OT, markets where the need for enhanced solutions have never been higher. We signed up several new customers during the first quarter and are in the process to increase both the referenceable industries we are addressing, as well as customers for whom we are providing critical cybersecurity solutions. We should also note that the large pharmaceutical company that purchased AZT PROTECT a year ago has renewed their annual 6-figure post-contract support agreement, and we are glad to report they are completely satisfied with the product and related services.\n\nAn example of how we are building presence for AZT PROTECT and target operational technology, cybersecurity markets, is a partnership we announced with Unified (sic) United Flow Technologies just before the end of the calendar year. UFT provides products and system integration services to water and waste treatment facilities located in 40 states. Water treatment facilities have hard hit by zero-day malware and ransomware that today's cybersecurity solutions struggle to prevent. In addition, these facilities are often targeted by nation state-sponsored attacks that bypass today's leading protection measures.\n\nWe are now working with UFT to implement AZT PROTECT into water treatment operations to better protect them against cyber attacks and our first deployment included protecting one of UFT's own operational technology facilities. AZT PROTECT uses AI-based countermeasures to stop categories of attacks as they land on the water treatment facilities most vulnerable critical production and control systems. These countermeasures lock down critical applications from adulteration while stopping code-based attacks such as malware and ransomware from executing. Further, they disrupt any nation state effort to take control of the facility.\n\nUFT has more than 16,000 customers to sell a built-in solution for effective cyber protection, and we are quite excited about the potential for our partnership as the referenceable installations are developed. AZT PROTECT also has the ability to drive our high-performance product business, and we expect to see increasing levels of revenue from our partnership with the likes of UFT and Rockwell Automation as the fiscal year unfolds. As we reported back in December, we had a very successful participation in the Rockwell Automation Fair back in late November 2024. With Gary Southwell, our Vice President and General Manager of a high-performance presenting an in-depth review of the latest attack techniques in their financial impact.\n\nGary's presentation as well as our participation in the American Petroleum Institute show for oil and natural gas resulted in generating approximately a 100 leads. We've been following up on these leads with several already transitioning into active proposals. We are hoping to convert a growing number of these proposals to orders during the next couple of quarters with the help of our Rockwell distribution partners. Along those lines, we have targeted the top U.S. Rockwell distributors having signed up 3 and hoping to have 2 more signed by the end of this month.\n\nOur strategy with the Rockwell distribution channel is to focus on the middle market OT customers, which tend to have a shorter sales cycle than the larger OT organizations and successfully executing on this strategy will be a major factor behind our performance for the remainder of fiscal 2025. With the large OT customers, our internal sales team continues to address the market, which have sales cycles up to 18 months. Our typical point of entry is through a project for one operation. And then as the installation proves its worth, we are introducing to other opportunities within the corporate entity.\n\nWe are actively working that expansion opportunity as many - as the results from AZT PROTECT are certainly worthy of broader system rollout at these big customers. All of our sales and marketing efforts is supported by the 9 major industry awards AZT PROTECT has received since its launch, including the winner of the application security category at the 2024 Fortress Cyber Security Award presented by Business Intelligence Group. We continue to benefit from the CrowdStrike update failure of last July, with the risk that continuous cloud updates can have on an OT applications, including industrial automation, industries control systems.\n\nThere is a growing recognition from the industrial automation vendors that their distribution channels that the traditional IT-focused endpoint protection methodologies are not meeting their requirements. In summary, we are off to a solid start for fiscal 2025, and we are working to continue this momentum as the year progresses. With that, I will now ask Gary to provide a brief overview of the fiscal first quarter financial performance.\n\nGary Levine:Thanks, Victor. For the first quarter ended December 31, 2024, we reported revenue of $15.7 million as compared to $15.4 million for the prior year's first quarter and $13 million for the fiscal fourth quarter ended September 30, 2024. Service revenue represented $4.7 million of overall sales, compared to $4 million of overall sales during the year ago period and $4 million of overall sales during the fiscal 2024 fourth quarter. Gross profit for the 3 months ended December 31, 2024, was $4.6 million or 29.1% of sales, compared to gross profit of $4.1 million or 26.6% of sales for the quarter ended December 31, 2024, reflecting the continued execution of the company's strategy to focus on higher-margin offerings.\n\nDriven by the improved gross margin, interest income and foreign currency exchange, the company reported net income of $472,000 or $0.05 per diluted common share for the fiscal first quarter, compared to a net loss of $73,000 or $0.01 per diluted common share for the prior fiscal year's first quarter. For the fiscal first quarter, our engineering and development expenses were $786,000 compared to $700,000. The increase was for outside consulting services and stock compensation. For SG&A, was at $4.1 million, compared to $3.7 million in the year ago fiscal quarter.\n\nThe increase was marketing expenses for the trade show and travel expenses as we scaled up our conferences and participation for the AZT PROTECT and for higher commission on sales in the TS group. The company had a tax benefit from a reversal of the valuation allowance related to expiring state and R&D credit and investment credits and benefits from our federal R&D credit. The company continues to maintain a robust balance sheet as of December 31, 2024, and had cash and cash equivalents of $30.7 million. The higher cash balance relative to liabilities enhances the company's resources to pay a quarterly cash dividend while executing growth, which includes the continued rollout and market awareness of the AZT PROTECT offering.\n\nWith that, I will turn it over to the operator for questions.\n\nOperator:Thank you.[Operator Instructions]And the first question today is coming from Joseph Nerges from Segren Investments. Joseph, your line is live.\n\nJoseph Nerges:Good morning, guys. How are you today?\n\nVictor Dellovo:Good morning, Joe.\n\nGary Levine:Good morning, Joe.\n\nJoseph Nerges:First, I want to thank you guys for the time that you gave all two of these investors that were at the annual meeting last week. And I want to start with one question that, this is from off your LinkedIn webpage. And it was sort of a summation of AZT PROTECT, which had said no updates, no upgrades, no daily maintenance, saves time, reduce expenses. This is a sort of a summation of what AZT PROTECT in managing that in the – any security can have in managing it, except for one exception there, and you mentioned it at the annual meeting, I think it's important.\n\nWe are – you are doing – you are currently doing a slight – well, an additional feature upgrade to AZT PROTECT. You haven't announced it yet, but there is some work on an upgrade and I just wanted to get that on the record.\n\nVictor Dellovo:You're correct. We will announce it soon.\n\nJoseph Nerges:Okay. Very good. Thank you. And one other point, I know we've discussed this in the past. You have a number of patents that were already been assigned or awarded to you on the ARIA platform. And I'm assuming you have some pending patents to, do you have a summation of that at all, of the total we have on that?\n\nVictor Dellovo:Yes. Three have been completed. Two more have gone through all office actions by the patent office and are expected to issue by year-end. And then two more recent submissions that should be done sometimes in 2026. So, three issued - in the middle stages.\n\nJoseph Nerges:All right. Thanks a lot. Appreciate it. I will leave it open to somebody else ask the questions.\n\nVictor Dellovo:Thanks Joe.\n\nOperator:Thank you.[Operator Instructions]The next question is coming from Brett Davidson from [Investletter] (Ph). Brett, your line is live.\n\nUnidentified Analyst:Good morning gentlemen. I have questions regarding the AZT sales. I was wondering if you guys could shed some light on what sales channels those sales have been coming through? And I know Victor, you indicated that the Rockwell is going to be important in the rest of the year. Have any of those sales come through the Rockwell sales channel?\n\nVictor Dellovo:No. Those have all been the stuff that we've been working on. The Rockwell channels, we literally have just been setting up contracts with these large distributors. I announced one. I think you guys saw CED back a month ago or so. And there will be another announcement here soon of another one. And then the other ones are, we're pretty close to signing. So, I'll announce all of those as they come along, but these channels are really, really new. So, some of the sales we've had have been the ones we've been working on for months or years.\n\nUnidentified Analyst:So, you're anticipating that some of these Rockwell partners are going to generate sales through the course of the year?\n\nVictor Dellovo:Yes, absolutely. Absolutely. We're hoping that next quarter, if everything goes well because the way we're going to work it is, we're going to push all the – even sales come directly to us, we're going to stop pushing it through the Rockwell channels of some sort. So, that's our game plan long-term is to fulfill all through the Rockwell channels.\n\nUnidentified Analyst:And one other quick question. Is there anything that prevents AZT from being sold into overseas markets?\n\nVictor Dellovo:No.\n\nUnidentified Analyst:Perfect. All right. Thank you very much.\n\nVictor Dellovo:Thank you, Brett.\n\nOperator:Thank you. The next question will be from Mike Price, Mike is a Private Investor. Mike, your line is live.\n\nMike Price:Good morning. Thanks for taking my question. It was July of 2023 that you first issued the press release, calling AZT game-changing technology. And a month later, you said that CSPi lacks name recognition. And at that time, I asked if you have game-changing technology without the name recognition, you're better off trying to find a partner that can get this into a market more quickly and in a big way. And here it is, and you said at that time, it's only been 30 days. So, here we are 19 months later, and you won 9 awards, which has, I assume, given you visibility and credibility. You've got several resellers and the Rockwell relationship.\n\nAnd the AZT revenues are not material in an OT market that you have estimated at about $50 billion. And the last conference call, the year-end conference call you said that this is pretty much like a start-up and you're building infrastructure. So, the question is, have you gone to somebody with name recognition or has somebody come to you saying, you have game-changing technology? We have infrastructure, you don't. We have name recognition, you don't, where this could get into the market more quickly in a bigger way. And this isn't seemingly just important to the CSPi's shareholders, but it seems to be important for national security.\n\nVictor Dellovo:The quick answer to that is no one's approached us and working with these large distributors is our first step into trying to build a name recognition and get into more feet on the street.\n\nMike Price:Okay. But with the larger customers where you say it's harder to get in the door, you haven't gone to anybody looking for any kind of partnership to get this done in a big way. Because when you put out some of these blogs about 2024 in review and 2025, what's in front of first cybersecurity measures, these things all take time, and every day that passes, there's higher risk to infrastructure as they're not. So, it seems like the sooner that AZT gets in the market, the better and the safer it is for everybody.\n\nVictor Dellovo:Absolutely. We're evangelizing that through our partners directly to the customers, we’re at our trade shows. We have Gary Southwell, we’re speaking to him. We're trying to get the blogs. We're trying to – it's education. With the Rockwell Partners, it's all about training them right now, getting in front of them, getting the message out to them on how to position it, where it falls in place, why it's different than the other products that are out there, how we complement in case you come up with some issues of, oh, we already have this product, the messaging and how we – while there’s still falls in those products. As you can see, there are people getting hacked constantly.\n\nThis is how we would protect that infrastructure along with whatever product they may be using already. So, unfortunately, things take time as impatient as probably most people are, but we are definitely working the channels, working in the messaging, developing the product and trying to evangelize in as many areas as possible to get that messaging out there. And a lot of people still have that. Even with the news as what it is, a lot of people will be like, well, I haven't been hacked yet, so, I'll be okay right now. And then we have to be like, well, it's only a matter of time when you won't be saying that.\n\nMike Price:Do you see an inflection sometime this year where we see some kind of significant ramp-up in AZT revenues? You think it takes place as soon as this year? Or is it longer [period now] [ph]?\n\nVictor Dellovo:We're counting on this year to have a significant increase in revenue Yes. We're budgeting for that.\n\nMike Price:Okay. All right. Thank you.\n\nOperator:Thank you.[Operator Instructions]We did have another question coming in from Mike Price. Mike, your line is live.\n\nMike Price:Yeah, thanks for taking another question. This comes up every quarter. Joe Nerges didn't ask it, but the question about using some of the cash to buy back shares. And if you are so optimistic about AZT and the future of CSPi, it still seems like a good use of the cash, especially at least to offset any shares that go to management and directors, such that the rest of the CSPi shareholders aren't diluted. Can you comment on using cash to buy back shares a little bit more aggressively than the past?\n\nVictor Dellovo:Well, last quarter, we were in a complete blackout period at [Indiscernible] and we're actively looking at it to support the stock this quarter and then in the future.\n\nMike Price:Right. But the quarter before, I think you bought, what, 4,200 shares, it's been nominal from one quarter to the next.\n\nGary Levine:Yes. We're taking a good close look at that, Mike. So, we will be purchasing probably more shares going forward.\n\nMike Price:Okay. And again, I know it's a pretty good size number that is going to management, but you can see if management is getting these shares, and you don't use cash to buy back shares. My position, and everybody else's position in CSPi is somewhat diluted, right? So...\n\nGary Levine:Understand.\n\nMike Price:Okay. All right. Thank you. Appreciate it.\n\nOperator:Thank you. And there were no other questions from the lines at this time. I will now hand the call back to Victor Dellovo for closing remarks.\n\nVictor Dellovo:Thank you. As always, I want to thank our shareholders for their continued interest and support. Our results in Q1 demonstrated the progress we are making and the success also highlights the ever-growing market interest of AZT PROTECT. We look forward to updating you on our Q2 progress in May. Thank you.\n\nOperator:This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "source": "motley-fool",
  "word_count": 3580,
  "scraped_at": "2026-01-11T17:55:22.052810",
  "filename": "CSPI_2025_Q1_4d479c.json"
}