{
  "ticker": "MITK",
  "company": "Mitek",
  "title": "Mitek (MITK) Q4 2025 Earnings Call Transcript",
  "year": 2025,
  "quarter": 4,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/mitek-mitk-q4-2025-earnings-call-transcript/",
  "transcript": "NASDAQ:MITK\n\nMitek Systems\n\nImage source: The Motley Fool.\n\nDATE\n\nThursday, December 11, 2025 at 5 p.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTAKEAWAYS\n\nSUMMARY\n\nManagement emphasized sustained client demand for end-to-end fraud and identity solutions, spurred by AI-driven synthetic fraud risks. Leadership attributed the SaaS revenue acceleration and margin improvement to automation, consolidated product platforms, and operational discipline. A large proportion of U.S. checking accounts is now covered by consortium data sets, strengthening differentiation in fraud detection. The company has fully addressed all material internal control deficiencies, marking a compliance milestone cited as significant in the call.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nEdward West:Thank you, Ryan. Good afternoon, everyone, and thank you for joining us today. For those less familiar with Mitek, we provide the identity verification, authentication and fraud decisioning infrastructure that high assurance institutions rely on to onboard customers, authenticate users and protect what's real across digital interactions. We closed fiscal '25 with a strong fourth quarter, coming in ahead of our expectations, driven by broad-based demand across our portfolio of business. As we reflect upon fiscal '25, one constant stands out. The fraud landscape is changing at an extraordinary pace as generative AI is accelerating both the volume and sophistication of fraud and identity-based attacks. AI is lowering the cost of creating deep fakes and synthetic identities for fraudsters.\n\nThe Deloitte Center for Financial Services estimates that AI-enabled fraud in the United States could reach $40 billion by 2027, and recent industry research shows that a majority of financial institutions now view synthetic identity fraud as their most urgent emerging threat. In recent conversations with several of our largest banking partners, we have heard the same message. AI-enabled fraud attempts have risen sharply over the past year and institutions are turning to Mitek with a clear mandate to help protect their customers and their business as these attacks scale. Before returning to key takeaways, I want to highlight a brief operational update.\n\nTo deliver on our commitment to improve transparency and provide a simpler view for our investors that matches how customers buy and how we are operating, we're updating our external reporting beginning this quarter. We are now disaggregating our revenues between fraud and identity and check verification. Customers are increasingly asking us to address fraud holistically, not as an isolated identity or payments problems. This has led to tighter integration across our identity, biometrics, authentication and fraud capabilities. Those solutions are included in the fraud and identity portfolio. Check verification includes the heritage mobile deposit and check intelligence solutions.\n\nWith synthetic fraud accelerating, financial institutions are clear about what they need, fewer point solutions and a core partner who can help secure digital interactions across the entire customer journey. I would now like to discuss a few key takeaways for you as we exit fiscal '25. First, fraud and identity now accounts for over half of our total business. Growing more than 15% year over year, it is now firmly established as our growth engine for revenue and SaaS expansion. Second, SaaS revenue growth accelerated to 21% in fiscal '25, a meaningful acceleration from mid-single digits in fiscal '24, while the mix of SaaS increased to 43% of total revenue.\n\nThese trends contribute to an improvement in the quality and predictability of our revenue. And third, we strengthened the company's foundation in fiscal '25 operationally, commercially and technically, setting a stronger base for fiscal '26. Adjusted EBITDA margins were 30%, and we improved execution across go-to-market and customer delivery. We are now reinvesting in R&D, go-to-market expansion and advanced decisioning to create a more unified and insight-rich customer journey. At the start of the year, we said fiscal '25 would focus on the fundamentals, fixing the foundation and restoring operational discipline required for scalable, profitable growth. Our results this year show that we've done exactly that.\n\nWe simplified how we run the company, consolidating go-to-market and the product and R&D groups are now under unified leadership. As a result, non-GAAP operating expenses declined 2%, while revenue grew nearly 5%, driving improved efficiency and an 11% increase in revenue per employee. Our identity portfolio was again a major driver of performance. Over the past year, we consistently highlighted that increasing automation and cost efficiencies, combined with continued revenue growth was a key factor to reaching a profitability fulcrum point on a fully burdened basis. With automation now at approximately 90% and identity revenue at roughly $77 million, an increase of 12% year over year, that profitability fulcrum point has now been achieved.\n\nAt the same time, we're seeing a clear shift towards higher assurance identity journeys that require more verification steps. And despite that added complexity, our high level of automation is enabling scale while continuing to expand margins. We see this playing out in both North America and EMEA. In North America, several of our largest financial institutions expanded with us across multiple business units and moved identity earlier in the onboarding flow, combining identity verification with fraud checks in a single stack.\n\nIn EMEA, banks in the U.K. and Europe are adding new use cases and adopting authentication products such as MiPass, while digital ID initiatives in markets like Spain and Italy are beginning to drive higher verification and authentication volumes. SaaS revenue mix rose to 43% of total revenues, keeping us firmly on track toward the goal we laid out for SaaS to approach half of total revenue. We are also seeing strong leverage in our platform model with gross profit per journey materially higher than that of a single signal workflow. Check Fraud Defender continues to gain traction.\n\nACV grew 50% year over year, while data sets configured in the consortium expanded to over 1/4 of all U.S. checking accounts, and that figure is approaching 50% when including FIs in pilot phase. We believe the expansion in data set coverage of checking accounts in the U.S. is quite unique and is a leading indicator of the value for consortium members because accuracy and value scale with consortium breadth. Check Fraud Defender ACV for the year came in below our initial goal, primarily due to the timing of large enterprise deployments. Several large FIs moved through multistage validation and procurement cycles more slowly than anticipated, shifting the decisions into fiscal '26, but not changing the underlying demand.\n\nOur expanding footprint is already driving tangible customer outcomes. At our October sales kickoff, multiple large FIs shared that Mitek is preventing millions of dollars of fraud. This feedback underscores the differentiated value of our consortium and the strength of the model as we scale into full production. All of these efforts made fiscal '25 translated into higher margins and stronger free cash flow, which Dave will cover in more detail. With a more unified foundation in place, we are entering fiscal '26 from a position of strength and with a clear mandate from our customers. They want us to unify even more of what we do and help them grow safely.\n\nWhile fiscal '25 was about strengthening the foundation, fiscal '26 is about moving into our next phase, unify and grow. unifying our identity, authentication and fraud capabilities into a cohesive insights-driven platform and scaling it across our customer base. When we help institutions open more accounts digitally, move more transactions through safer channels and keep bad actors out, we then deepen our role in their core customer journeys and grow our SaaS revenue. To guide this next phase, we have organized fiscal '26 around four key pillars that we want to share with you.\n\nOur first pillar is to fortify our check verification franchise, the durable platform, including mobile deposit and check intelligence that established our long-standing relationship with many of North America's largest financial institutions and has earned us a reputation as a market leader through scale and accuracy. This franchise remains one of the strongest assets in our business, providing the reliability and trust that our customers expect. Despite periodic fluctuations from license renewal timing, check verification has remained remarkably stable over the last several years. That stability reflects the scale and mission-critical nature of a portfolio that supports approximately 1.2 billion mobile check deposit transactions every year with high margins and high levels of reliability.\n\nOur second pillar is to unify our fraud and identity capabilities and expand that portfolio. Fiscal '26 is about showing up as one Mitek across that full journey, increasing our fraud and identity SaaS footprint by enabling customers to grow digital adoption and transaction volume without corresponding increases in fraud losses or manual costs. Fraud and identity now represents just over half of our business and remains our fastest-growing portfolio. The continued shift towards SaaS, high automation and multisignal journeys is improving margins across the broader portfolio.\n\nIn fiscal '26, we plan to grow the fraud and identity portfolio through deeper signal-rich identity journeys, broaden engagement with customers across additional lines of business and geographies, expand the Check Fraud Defender consortium and continue to drive commercial expansion across our customer and geographic base and growing network of channel partners. Customers are increasingly deploying multisignal workflows that combine documents, biometrics, liveness, behavioral analytics and third-party data, which materially improves their economics by reducing fraud losses, lowering manual review and improving conversion. At the same time, as more institutions contribute data to the CFD consortium, detection accuracy improves and loss rates decline, strengthening the value of the network for every participant, including Mitek.\n\nOur third pillar for fiscal '26 is to invest in the areas that we believe we have a clear advantage and where we can lead. As I mentioned earlier, our customers do not just want us to deliver signals, they want a partner who can lead them through this shift by returning data-driven insights for a simple risk-adjusted decision they can act on in real time. This is why our fiscal '26 investments are focused on AI-supported insights and decisioning, biometrics, data and intelligence and targeted go-to-market and delivery capacity. Given our history and expertise, we have a strong basis of differentiation with financial institutions and high assurance use cases.\n\nThis is where incremental investment dollars will have the greatest impact. You'll see this focus reflected in our financials. We expanded adjusted EBITDA margin to 30% in fiscal '25, and we are deliberately reinvesting to fund these initiatives in fiscal '26 while still delivering attractive margins. We expect improvements in gross profit dollars and unit economics as richer decisioning increases value per workflow. You'll see more of our OpEx shift towards R&D and go-to-market as we fund these higher ROI initiatives. Fiscal '25 proved we can grow margin through operating leverage and scale. Fiscal '26 is about investing behind the capabilities where we can lead and evolving our solution set, all with the goal to accelerate growth.\n\nOur fourth pillar is maximizing value through disciplined capital allocation. To lead in the areas where we hold an advantage, every dollar of capital must be deployed deliberately to earn a high return, either reinvested into the capabilities that strengthen our long-term leadership and growth or return to shareholders. We will measure our impact via improving revenue quality and growth, margin durability and strengthen free cash flow conversion, all with a clear capital allocation framework to ensure that we maintain a strong balance sheet while balancing investments with returning capital to shareholders. Our Unify and Grow framework reflects where the market is moving and how our customers are asking us to partner with them.\n\nBy unifying our capabilities and reinvesting in the technology, data and decisioning layers where we have a structural advantage, we are positioning Mitek for durable recurring high-quality organic growth. We expect to expand our SaaS base. increase fraud and identity revenue and extend the reach and value of our consortium. Now before I turn it over to Dave, I also want to recognize our nearly 600 teammates around the world and our trusted partners. Fiscal '25 was a year of meaningful change across the entire company, operationally, commercially and technically. And the team delivered with focus, discipline and a deep commitment to our strong purpose-driven mission of protecting our customers and their users.\n\nThe progress we made this year, including simplifying how we operate, elevating customer support, strengthening the core technology behind our platform and returning to growth reflects the commitment and execution of our people. Their work is the foundation for the results you're hearing today and gives us confidence as we enter fiscal '26. With that, I'll hand it over to Dave.\n\nDavid Lyle:Thanks, Ed. As you just heard, we are exiting fiscal 2025 with a clear framework for fiscal 2026. This afternoon, I will focus my commentary on three areas. First, I'll review our fourth quarter results and will discuss revenue using the historical deposits and identity categories. Then I will review our full year performance using the new fraud and identity and check verification reporting structure. And then finally, I'll walk through our fiscal 2026 outlook and how it supports the pillars Ed laid out. Starting with fourth quarter results. Total Q4 revenue was $44.8 million, up 4% year over year, with SaaS revenue growth of 19% being a highlight.\n\nRevenue results exceeded the midpoint of our guidance range by roughly $4 million as several large deposit deals closed sooner than forecast from higher transactional volumes, and we saw stronger-than-expected identity transaction volumes. Identity revenue was $21 million, up 7% year over year, driven by 14% SaaS growth from continued transactional volume overages and deposits revenue was $23.8 million, up 1% year over year, driven by growth in CFD SaaS revenue. Q4 non-GAAP gross margin was 84%, down approximately 200 basis points year over year, driven by higher investment in SaaS services delivery. Q4 non-GAAP operating expense was just under $25 million, improving 5% sequentially from Q3, driven by lower external services spending and the timing of marketing events.\n\nOn a year-over-year basis, Q4 non-GAAP operating expense increased by approximately $3 million, normalizing for a reduction in bonus accruals and a reversal of doubtful accounts in the prior year, underlying operating expense was essentially flat. Tying this all together, adjusted EBITDA was $12.9 million in the quarter or a 28.7% margin. After other income, interest and tax, non-GAAP net income came in at $11.1 million or $0.24 per diluted share on 47.3 million shares. As Ed mentioned earlier, we have updated our external reporting. Under the new structure, deposits maps to check verification, Identity maps to fraud and identity and Check Fraud Defender has moved from deposits to fraud and identity. We are also simplifying our revenue categories.\n\nGoing forward, the primary change will be the combination of license and maintenance into a single line to better reflect how customers contract and pay for those items. The 10-K provides results in both the prior disaggregated format and the new reporting format, allowing investors to compare historical performance across the two presentations. With that framing, I will now walk through full year 2025 performance. Starting with Fraud and Identity for fiscal year 2025, Fraud and Identity revenue was $90 million, up 15% year over year with growth led by our SaaS offerings, primarily driven by continued volume expansion in our core customer base. What stands out this year is how consistent customer behavior has become across regions and customer tiers.\n\nLarge banks and enterprise customers are converging on the same pattern, shifting identity earlier in the onboarding flow, consolidating fraud and identity workflows and standardizing on bundled stacks rather than fragmented point solutions. Taken together, fraud and identity is now operating at increased scale and more durable economics, positioning us well for continued growth in fiscal 2026. Turning to check verification, comprised of our Mobile Deposit and Check Intelligence products. This portfolio remains an important cash flow generator for the company. Check verification revenue for fiscal 2025 was $90 million compared with $94 million in fiscal 2024, a variance mostly related to deal timing year over year.\n\nThis year's performance reflects the resiliency of a portfolio that has operated in a relatively defined annual revenue range for several years despite overall check volume declines in the U.S. and the digestion effects of an unusually large revenue recognition event in fiscal 2023 from a single large channel partner when we recognized roughly four years' worth of revenue in a single quarter. On a consolidated basis, total revenue for fiscal 2025 was about $180 million, split evenly between fraud and identity and check verification. Our 4% consolidated revenue growth breaks down cleanly as follows: SaaS, which grew 21% year over year, contributed roughly 8 points of growth.\n\nLicensed software and support reduced growth by roughly 4 points as expected, reflecting the ongoing overall mix shift from software term licenses to recurring SaaS. For the full year, non-GAAP gross margin was about 85% compared with about 86% in fiscal 2024. The modest step down is consistent with our transition to a heavier SaaS and services mix. SaaS and services carry blended margins in the mid-70s percent range versus nearly 100% for licensed software. As is typical with a mix shift towards SaaS, the margin rate compresses slightly, but absolute gross profit dollars continue to grow.\n\nImportantly, automation and richer identity fraud journeys are lifting gross profit per journey, which offsets some of the mix impact and supports long-term scale. Non-GAAP operating expense for fiscal 2025 was $100.9 million, improving 2% from last year and an improvement in operating expense intensity from 60% to 56% of revenue. Breaking that down in G&A, vendor consolidation and tighter procurement reduced external spending, bringing G&A intensity down from 20% of revenue to 18%. We also streamlined finance and accounting processes, which lowered our reliance on external advisers.\n\nSales and marketing intensity improved from almost 22% to under 21%, driven by stronger alignment between marketing programs and pipeline generation and a shift away from higher cost event-driven activity toward digital and partner-led demand generation. R&D intensity improved from 18% to 17% of revenue as we completed several platform consolidation initiatives, reduced reliance on higher cost contractors and increased engineering productivity through automation and broader adoption of AI-assisted development tools. Adjusted EBITDA for fiscal 2025 grew by 15% to $54 million, representing a margin of 30%, up from 27% a year ago. Non-GAAP net income for fiscal 2025 was $45 million and roughly flat with fiscal 2024, even though adjusted EBITDA increased by 15%.\n\nThis result was driven primarily by a higher non-GAAP tax rate, 21% in fiscal 2025 compared to 9% in fiscal 2024. The increase reflects higher pretax income across jurisdictions and lower tax deductions from stock-based compensation and other payroll-related items. Free cash flow for the full year was $54 million, which equates to 100% conversion of adjusted EBITDA compared with just under 65% last year. While operational discipline and lower non-GAAP cash adjustments contributed, this conversion level is above what we consider a longer-term steady state, and it's important to highlight a couple of nonstructural tailwinds that will dissipate over time.\n\nFirst, following the expected payoff of our 75 basis points convertible debt on February 1, 2026, we will no longer receive the interest arbitrage benefit. Second, there is an initial working capital step change benefit as revenue mix changes, which should be followed by an ongoing but smaller growth linked benefit as SaaS base expands. And third, by 2028, we will have exhausted the benefits associated with the catch-up provisions within the recent tax legislation, which will lower the cash tax rate during fiscal year 2026 and fiscal year 2027. Taking these items into consideration, over the longer term, we believe a more realistic steady state is around 75% conversion, which we believe is consistent with recurring revenue software peers.\n\nOur approach to capital allocation remains consistent and disciplined. We first fund high-return initiatives in the business while ensuring the balance sheet remains resilient, balanced with returning excess capital to shareholders. We ended the year with about $196 million of cash and investments and approximately $157 million of total debt, resulting in $40 million net cash position. Combined with our committed term loan and revolving credit facilities, this provides full flexibility to retire the $155 million of convertible debt maturing in early calendar 2026 while preserving ample liquidity to fund product development and enable additional share repurchases. Regarding share repurchases, in fiscal 2025, we repurchased approximately $5 million of shares.\n\nAnd since fiscal year-end through December 10, we have repurchased an additional $7.7 million, leaving $13.6 million remaining in the current authorization to execute through May 2026. Let me now turn to our fiscal 2026 outlook. We expect fiscal 2026 revenue of $185 million to $195 million, implying roughly 6% at the midpoint. This range reflects the balance of stable check verification and accelerating fraud and identity demand. With the first quarter nearly complete, Q1 revenue is tracking to between $41 million and $44 million. We expect fiscal 2026 to be slightly more back half weighted, reflecting a gradual ramp in fraud and identity SaaS.\n\nWe expect fraud and identity product portfolio revenue of $101 million to $105 million in fiscal 2026, which would represent approximately 15% growth at the midpoint and would maintain the same growth rate we delivered in fiscal 2025. We expect modest gross margin pressure in fiscal 2026, largely due to mix shift towards SaaS and services as we invest ahead of expected demand growth. We still expect gross profit dollars to continue to rise despite this compression, assuming the midpoint of the revenue guidance range. On operating expenses, we expect to increase R&D intensity as we accelerate development.\n\nThis investment will be funded by continued leverage in G&A and by lower sales and marketing intensity as we unify our go-to-market teams, automate more of the cycle and improve sales operations and analytics. Taken together, these offsets allow us to maintain or improve overall operating expense intensity versus fiscal 2025, even as we invest behind our product road map. We expect fiscal 2026 adjusted EBITDA margins in the 27% to 30% range. At the midpoint, this implies adjusted EBITDA dollars remaining roughly flat year over year, reflecting deliberate reinvestment rather than a step back in earnings power.\n\nWe believe that rising demand for fraud and identity solutions and strong unit economics makes this a good place -- a good balance between delivering profitability and deploying capital into high-return R&D and go-to-market initiatives. We also expect adjusted EBITDA to continue converting to free cash flow at attractive rates during fiscal 2026 with normalization towards our long-term target over time. Regarding taxes, we expect fiscal 2026 non-GAAP tax expense, which reflects cash taxes to decline meaningfully from fiscal 2025. This change is driven by changes in U.S. tax legislation, particularly the revised treatment of capitalized R&D. As a result, we expect a fiscal 2026 non-GAAP tax rate of roughly 10% of non-GAAP pretax income.\n\nBefore we turn to Q&A, I want to highlight an important milestone. Over the last several quarters, we've said we would finish the cleanup of material weaknesses in our internal controls. As disclosed in our filings today, we have now fully remediated all previously reported material weaknesses. This outcome reflects multiyear investment in people, systems and technology to strengthen our processes and control environment. This is a significant accomplishment and a meaningful step forward for the company. We want to thank our teams across the organization and particularly our accounting team for their discipline, commitment and very hard work throughout the process.\n\nFinally, our updated investor presentation and the Q4 and full year supplemental financial package are available on our Investor Relations website, including trended historical data for our new product categories and revenue classification. With that, operator, we are ready to take questions.\n\nOperator:Ladies and gentlemen, we will now begin the question-and-answer session.[Operator Instructions]And your first question comes from the line of Mike Grondahl from Northland.\n\nMike Grondahl:Dave, if your SaaS business is doing really well, if you had to sort of distill one or two drivers behind that growth, how would you describe those?\n\nEdward West:Mike, as you point out, we did see an acceleration of SaaS growth throughout the year and feel really good about where the year is ending up. Underlying demand, frankly, what's the big driver of this is what's happening in the market. And we feel like Mitek is really well positioned based on what all is happening with the growth in synthetic fraud because of generative AI, and the growth we're seeing there, the rising fraud, frankly, essentially fraud being democratized. That's been a driver of the needs because of our partnerships and credibility of working with some of the largest financial institutions around the world.\n\nSo we're seeing growth in the overall relationships in terms of new products, new solutions with those institutions. We're seeing growth in transactions, as I mentioned, bringing up our verification process and also fraud checks earlier up as new customers are coming on board. We're seeing more in authentication because of this. And frankly, just the -- with that market continuing to expand, we feel very good about the growth there going forward. So that's the key driver of this. And frankly, the -- what we capture in terms of the outlook this year has been -- is capturing that increasing demand.\n\nMike Grondahl:Got it. And then any more details you can share on Check Fraud Defender number of banks or revenue or just kind of progress momentum you're seeing there?\n\nEdward West:Well, as I mentioned on the call, we saw 50% growth in overall ACV. And probably the biggest metric there, Mike, to be really very encouraging is the amount of data sets that we now have compiled and configured within the consortium. So, today, we're over 25% of all checking accounts in the U.S. -- in the United States, we have visibility into and built those data sets. And when you include the institutions who are currently in pilot phase, that actually approaches 50%, nearly 50% of all U.S. checking accounts. That is, we believe, a significant asset for the consortium and ultimately, this franchise.\n\nAnd it goes back to what I mentioned a minute ago about more signals that we can provide customers around potential fraud and insight, the more valuable the franchise is. So the progress there, the data sets that are being built, the momentum, the engagement with financial institutions and some of the largest institutions in this country are seeing the benefits and it goes back to your previous question, hey, what's driving all this? And it's just the accelerating growth of fraud and synthetic fraud around the world.\n\nOperator:And your next question comes from the line of Jake Roberts from William Blair.\n\nJacob Roberge:Great to see the strong results, good quarter there. Ed, when you initially joined, you talked about getting organic growth back above 10%. Obviously, still building some things out on the fraud side. But now that you've been here for over a year, do you feel like you're starting to get more visibility into that path with SaaS really starting to accelerate this year?\n\nEdward West:Yes. Great question, and thanks for the comment on the results. Again, a lot of work by everybody across this company. Having seen the accelerating growth in SaaS, as we were just talking about, over 21% growth and the growing in demand. But what's most important about getting to that -- our goals, where we want to is that longer-term double-digit growth rate and organic growth -- the good news is the market is moving in the right direction. We feel like Mitek is really well positioned to capitalize on that. And it's going back to that credibility that we have some of the largest financial institutions in the world, the growing need for fraud and identity detection.\n\nAll of that compiles, I think, and leads to decent confidence in going to our longer-term growth objectives there.\n\nJacob Roberge:Okay. That's helpful. And then now that you've done a lot of the heavy lifting on consolidating the platforms and also kind of your go-to-market motion into One Mitek over the past year, what inning do you feel like we're in with those changes on both the go-to-market and product into the One Mitek story? And then how do you feel like the visibility into the business has changed over the past year now that you're not operating several different sales forces and systems?\n\nEdward West:Well, obviously, that improves every day and gets better and better. And last year was a year about fixing the foundation and integrating these various businesses, getting people to working together as one solution and having that strong purpose-driven mission. But frankly, we've moved from that phase and now into the unify and grow where we've got to bring together that integrated platform approach and driving more data and insight and signals, richer signals to provide insights to our core customers. We're early on in there because that's -- we're bringing these pieces together.\n\nWe have a lot of capability and credibility and insights, but that's why building out these various forms, whether that's building up the consortium, bringing more value to those enterprise. We're early on in that. That's still not a mature business as we've talked about. Then also fighting the fraud that evolves and change every day. I think we've got a good grasp on having the discipline on how we're operating across the platform. Now I think we're just now beginning to get into the groove of really seeing that come together in terms of value creation for our customers and ultimately for Mitek.\n\nJacob Roberge:Very helpful. And then, Dave, if I could just sneak one more in. I know you're still sunsetting some of the legacy hardware assets. Can you help us understand what that headwind will be on revenue growth this year? And will those hardware products be fully sunsetted this year?\n\nDavid Lyle:Sure. Yes, we've actually expected a more rapid falloff, as you know, in revenue from those -- that hardware product. It just survived for longer than we thought, which actually is a good thing from a revenue perspective. But we're down into the immateriality level of revenue dollars. So it will have a little bit of an impact, but nothing like it's had historically in the last couple of years.\n\nEdward West:Next question, operator.\n\nOperator:And your next question comes from the line of Surinder Thind from Jefferies.\n\nSurinder Thind:Ed, can you maybe talk about the level of investment that you're making at this point? Is that kind of a normalized pace? Or are we early in an investment cycle where maybe there's a lot of ideas to pursue given how things are changing? Just any color on that as you think about the year ahead and obviously, the next couple of years?\n\nEdward West:Sure. Well, I think Dave outlined in his remarks just in terms of the -- what that investment looks like this year. And that's really driven. As you know, we've been very disciplined about the operations, driving margin, the performance, integrating the business. This is really driven by the confidence that we see where we're positioned with customers, what's happening in the market and how do we accelerate growth because of what's happening and making sure we're capitalizing on that as a business for everyone involved. Longer term, we continue to -- we're very margin focused. We want to continue to grow free cash flow and margins.\n\nSo -- but I think we've outlined the amount of investment here and continuing to drive performance from there.\n\nSurinder Thind:So, Ed, maybe a clarification on my part. I guess what I was trying to ask is more about like are we in a period where you could -- if you wanted to invest even more at this point? Or are you pursuing all of the ideas that you want to pursue in relationship to obviously, I understand you have to balance margins and stuff. But just that's what I was trying to get a better handle on the longer term...\n\nEdward West:Sure. Yes. I would say we want to be prudent and balanced with the business. anybody can say they always can invest more. There are clearly continue to be things, but we just want to be prudent. We want to deliver the results and be a balance in it, just like we've talked about in capital allocation and maintaining that flexibility. But right now, we feel good about where we are, the position and what we have.\n\nDavid Lyle:Yes. We think, Surinder, we have the kind of right balance like Ed was talking about. The big focus, as Ed also stated on R&D, more specifically on AI decisioning, biometrics and fraud intelligence. And then on the go-to-market side of the equation, it's time to strike a little harder there and put a little more investment there. Most of the investment is going to be in R&D. And I think this is a good pace to do it looking into 2026.\n\nSurinder Thind:Got it. And then when we kind of think about -- you talked a little bit about Check Fraud Defender and all the good stuff that's going on. You also highlighted the idea that some of the larger financial institutions are taking their time. Is that something that might potentially change as we go ahead? Or is that just as you've now kind of worked through this process, that's just how it is, meaning that if you layer on a number of these FIs taking time, ultimately, the growth rate would accelerate, right?\n\nBut I'm just trying to understand the dynamic there of how we think about the decision-making at the large FIIs and what that really means for the FD's growth rate.\n\nEdward West:Yes. I think the more data that you have, the incremental value creation just increases. And so the more value everybody sees that should accelerate over time. And we've continued to build out the business, the insights and the value there. But these are very large institutions. They take their time. They've got built-in processes that they go through. The good news is it's coming along. It's been happening and will continue. We think that, that would accelerate over time. But our focus is getting the data and the insight that then we can share with the customers and create more value for them and Mitek.\n\nOperator:And your next question comes from the line of George Sutton from Craig-Hallum.\n\nGeorge Sutton:Nice results. So when we're talking about synthetic fraud, I wondered if we can get a little more granular in terms of how the discussions with the customers are going. You've been trying to migrate folks from point solutions into the MiVIP platform and the full stack. Is synthetic fraud helping drive those discussions? Or are you seeing new interest from new parties specific around synthetic fraud?\n\nEdward West:Well, going to the former -- thank you, George, is synthetic fraud, obviously, whether they're injection attacks, presentation attacks, template attacks that are happening, deepfakes, all this, and that's accelerating. And the reason we take a highly layered approach to detection, which is why having that orchestration and VIP is very important. And the more insight and signals we can bring to that, the more detection we can deliver. That's why, again, we have unique assets with the biometric and liveness capabilities combined with other signals, we can bring in other third-party signals and all these different pieces come together in a platform approach to provide more data.\n\nAnd as that synthetic fraud is increasing, is helping out on that detection. But it's changing. It's changing daily. Some of the fraud vectors change rapidly, and that's why staying in front of that and having that core partner is very important. I think as this continues to grow, as your second point of that, it logically would start impacting other organizations as well and seeing other use cases where it's important to bring these biometric liveness and other fraud detection and synthetic fraud detection capabilities to bear on applications that we may not have been thinking about a year or so ago that we're now seeing today.\n\nGeorge Sutton:Got you. So I wondered if we could walk through the pilot process for the banks, these large banks. Obviously, the network effect is starting to occur here. I'm just curious, how are they viewing their pilot process? Are they're obviously looking for incremental value of being part of the consortium versus something they would have identified themselves. Can you just walk through kind of the touch points there?\n\nEdward West:You just outlined it, being a part of the consortium start seeing the value of, okay, now I'm seeing data, have access to data that I didn't have on my own, for example, where we can talk about the amount of the coverage. A lot of times, we'll go into and meet with an institution, we'll already have insights and data sets on their customers that they didn't give to us, but because we see it in many other financial institutions so frequently that we've been able to build up that profile to then have that conversation. That gets folks attention.\n\nNow they start seeing the benefit of being a part of a consortium versus just having an on-premise software solution themselves that is now maybe not seeing all of the signal-rich capabilities about being a part of a broader consortium. So now just going through that just takes time. You walk through, you get the data, you do the test, do the pilot, and it just evolves over time and getting people more broad. You're talking about very large institutions who have done it in certain ways. And the more data they have, they see, now they see the benefits and then participate in the consortium.\n\nWe have multiple top 10 institutions, some of the largest in the country in working with us. And so we're encouraged about the progress at what we see ahead.\n\nGeorge Sutton:Got you. Just one other thing. We're 80% or so through the fiscal first quarter. And we also line up with the fiscal year-ends of most of your customers. I'm just curious if you can -- are there any sort of things you would point to that might be a focus for this quarter versus what you were seeing in Q3 or any meaningful deltas?\n\nEdward West:No meaningful deltas other than just continued -- directionally, I think, has informed the guidance that we've outlined for the year, and Dave walked through both the year. And frankly, we gave you some more color on the quarter based on where we are.\n\nOperator:And your next question comes from the line of Allen Klee from Maxim Group.\n\nAllen Klee:Could you comment a little on the mobile deposit business on -- in terms of -- it looks like if you back in, you're implying a decline. Are you thinking that this business is kind of going to be in secular decline or some stability at some point? Or how are you thinking about it?\n\nEdward West:Well, I'll tell you, let me just turn it over to Dave to walk through in terms of what your point there, Allen, is kind of backing into what that means from a guidance.\n\nDavid Lyle:Yes. The way we kind of look at it is looking historically at the stability in the overall transactional volume that we see for Mobile Deposit, it's been a $1.2 billion plus for years, right? And so we've managed pretty well just through adoption, I think, to keep those volumes where they -- in a pretty stable position. What we've seen over the past couple of years is more about deal timing from a revenue perspective. If you remember, Allen, there was a very large channel partner deal that allowed us to -- or required us to recognize four years of revenue in a single quarter in 2023, essentially taking out sequential years ahead of additional revenue from that customer.\n\nThat circles back, by the way, next year in 2027, where we'll have a renewal there. But that creates -- the digestion of that deal created some pretty big declines over the years. And we also have -- depending on when larger customers run out of transactions and have to renew, that timing matters in a pretty significant way. You even saw some of that at the end of Q4, where we had some expected upsides. When you have expected upsides in that time period, it's usually because they run out of transactions earlier, which is a good thing. So we know that overall checks are coming down over time.\n\nAnd eventually, they will start to see a more secular decline from our transaction volume. But right now, we're seeing stability in that -- in the volumes.\n\nEdward West:Yes. So just kind of long-term takeaway or to summarize that is just separating out the underlying transaction volumes, which is right, has been around $1.2 billion versus the rev rec based on those ongoing purchases of the volumes.\n\nAllen Klee:Okay. And then just from a capital structure perspective, is it reasonable to assume that you will pay off the entire amount of the convert when it comes due or that you might use some of your facilities to keep more cash around?\n\nDavid Lyle:Yes. The decision -- so first of all, yes, we're going to pay the debt off completely when it's due February 1, 2026. We haven't yet communicated how we're going to do that. We have that $100 million facility, the $75 million term and the $25 million revolver to give us flexibility. We'll make that decision closer to the time we actually pay it off. It could be a combination of both borrowings as well as cash from our cash balance.\n\nEdward West:And as Dave pointed out, we have close to end of the year, roughly $196 million in cash plus those facilities.\n\nOperator:There are no further questions at this time. I will now hand the call back to Mr. Ed West for any closing remarks.\n\nEdward West:Great. Well, thank you. Thank you very much for your interest and time. You've got a highly enthusiastic team and company based on the position where we see things evolving in the market and very energized about what's happening. So thank you for your interest, and we look forward to visiting with you all over this next quarter. Have a great day.\n\nOperator:And this concludes today's call. Thank you for participating. You may all disconnect.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has positions in and recommends Mitek Systems. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:MITK\n\nMitek Systems\n\nImage source: The Motley Fool.\n\nDATE\n\nThursday, December 11, 2025 at 5 p.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTAKEAWAYS\n\nSUMMARY\n\nManagement emphasized sustained client demand for end-to-end fraud and identity solutions, spurred by AI-driven synthetic fraud risks. Leadership attributed the SaaS revenue acceleration and margin improvement to automation, consolidated product platforms, and operational discipline. A large proportion of U.S. checking accounts is now covered by consortium data sets, strengthening differentiation in fraud detection. The company has fully addressed all material internal control deficiencies, marking a compliance milestone cited as significant in the call.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nEdward West:Thank you, Ryan. Good afternoon, everyone, and thank you for joining us today. For those less familiar with Mitek, we provide the identity verification, authentication and fraud decisioning infrastructure that high assurance institutions rely on to onboard customers, authenticate users and protect what's real across digital interactions. We closed fiscal '25 with a strong fourth quarter, coming in ahead of our expectations, driven by broad-based demand across our portfolio of business. As we reflect upon fiscal '25, one constant stands out. The fraud landscape is changing at an extraordinary pace as generative AI is accelerating both the volume and sophistication of fraud and identity-based attacks. AI is lowering the cost of creating deep fakes and synthetic identities for fraudsters.\n\nThe Deloitte Center for Financial Services estimates that AI-enabled fraud in the United States could reach $40 billion by 2027, and recent industry research shows that a majority of financial institutions now view synthetic identity fraud as their most urgent emerging threat. In recent conversations with several of our largest banking partners, we have heard the same message. AI-enabled fraud attempts have risen sharply over the past year and institutions are turning to Mitek with a clear mandate to help protect their customers and their business as these attacks scale. Before returning to key takeaways, I want to highlight a brief operational update.\n\nTo deliver on our commitment to improve transparency and provide a simpler view for our investors that matches how customers buy and how we are operating, we're updating our external reporting beginning this quarter. We are now disaggregating our revenues between fraud and identity and check verification. Customers are increasingly asking us to address fraud holistically, not as an isolated identity or payments problems. This has led to tighter integration across our identity, biometrics, authentication and fraud capabilities. Those solutions are included in the fraud and identity portfolio. Check verification includes the heritage mobile deposit and check intelligence solutions.\n\nWith synthetic fraud accelerating, financial institutions are clear about what they need, fewer point solutions and a core partner who can help secure digital interactions across the entire customer journey. I would now like to discuss a few key takeaways for you as we exit fiscal '25. First, fraud and identity now accounts for over half of our total business. Growing more than 15% year over year, it is now firmly established as our growth engine for revenue and SaaS expansion. Second, SaaS revenue growth accelerated to 21% in fiscal '25, a meaningful acceleration from mid-single digits in fiscal '24, while the mix of SaaS increased to 43% of total revenue.\n\nThese trends contribute to an improvement in the quality and predictability of our revenue. And third, we strengthened the company's foundation in fiscal '25 operationally, commercially and technically, setting a stronger base for fiscal '26. Adjusted EBITDA margins were 30%, and we improved execution across go-to-market and customer delivery. We are now reinvesting in R&D, go-to-market expansion and advanced decisioning to create a more unified and insight-rich customer journey. At the start of the year, we said fiscal '25 would focus on the fundamentals, fixing the foundation and restoring operational discipline required for scalable, profitable growth. Our results this year show that we've done exactly that.\n\nWe simplified how we run the company, consolidating go-to-market and the product and R&D groups are now under unified leadership. As a result, non-GAAP operating expenses declined 2%, while revenue grew nearly 5%, driving improved efficiency and an 11% increase in revenue per employee. Our identity portfolio was again a major driver of performance. Over the past year, we consistently highlighted that increasing automation and cost efficiencies, combined with continued revenue growth was a key factor to reaching a profitability fulcrum point on a fully burdened basis. With automation now at approximately 90% and identity revenue at roughly $77 million, an increase of 12% year over year, that profitability fulcrum point has now been achieved.\n\nAt the same time, we're seeing a clear shift towards higher assurance identity journeys that require more verification steps. And despite that added complexity, our high level of automation is enabling scale while continuing to expand margins. We see this playing out in both North America and EMEA. In North America, several of our largest financial institutions expanded with us across multiple business units and moved identity earlier in the onboarding flow, combining identity verification with fraud checks in a single stack.\n\nIn EMEA, banks in the U.K. and Europe are adding new use cases and adopting authentication products such as MiPass, while digital ID initiatives in markets like Spain and Italy are beginning to drive higher verification and authentication volumes. SaaS revenue mix rose to 43% of total revenues, keeping us firmly on track toward the goal we laid out for SaaS to approach half of total revenue. We are also seeing strong leverage in our platform model with gross profit per journey materially higher than that of a single signal workflow. Check Fraud Defender continues to gain traction.\n\nACV grew 50% year over year, while data sets configured in the consortium expanded to over 1/4 of all U.S. checking accounts, and that figure is approaching 50% when including FIs in pilot phase. We believe the expansion in data set coverage of checking accounts in the U.S. is quite unique and is a leading indicator of the value for consortium members because accuracy and value scale with consortium breadth. Check Fraud Defender ACV for the year came in below our initial goal, primarily due to the timing of large enterprise deployments. Several large FIs moved through multistage validation and procurement cycles more slowly than anticipated, shifting the decisions into fiscal '26, but not changing the underlying demand.\n\nOur expanding footprint is already driving tangible customer outcomes. At our October sales kickoff, multiple large FIs shared that Mitek is preventing millions of dollars of fraud. This feedback underscores the differentiated value of our consortium and the strength of the model as we scale into full production. All of these efforts made fiscal '25 translated into higher margins and stronger free cash flow, which Dave will cover in more detail. With a more unified foundation in place, we are entering fiscal '26 from a position of strength and with a clear mandate from our customers. They want us to unify even more of what we do and help them grow safely.\n\nWhile fiscal '25 was about strengthening the foundation, fiscal '26 is about moving into our next phase, unify and grow. unifying our identity, authentication and fraud capabilities into a cohesive insights-driven platform and scaling it across our customer base. When we help institutions open more accounts digitally, move more transactions through safer channels and keep bad actors out, we then deepen our role in their core customer journeys and grow our SaaS revenue. To guide this next phase, we have organized fiscal '26 around four key pillars that we want to share with you.\n\nOur first pillar is to fortify our check verification franchise, the durable platform, including mobile deposit and check intelligence that established our long-standing relationship with many of North America's largest financial institutions and has earned us a reputation as a market leader through scale and accuracy. This franchise remains one of the strongest assets in our business, providing the reliability and trust that our customers expect. Despite periodic fluctuations from license renewal timing, check verification has remained remarkably stable over the last several years. That stability reflects the scale and mission-critical nature of a portfolio that supports approximately 1.2 billion mobile check deposit transactions every year with high margins and high levels of reliability.\n\nOur second pillar is to unify our fraud and identity capabilities and expand that portfolio. Fiscal '26 is about showing up as one Mitek across that full journey, increasing our fraud and identity SaaS footprint by enabling customers to grow digital adoption and transaction volume without corresponding increases in fraud losses or manual costs. Fraud and identity now represents just over half of our business and remains our fastest-growing portfolio. The continued shift towards SaaS, high automation and multisignal journeys is improving margins across the broader portfolio.\n\nIn fiscal '26, we plan to grow the fraud and identity portfolio through deeper signal-rich identity journeys, broaden engagement with customers across additional lines of business and geographies, expand the Check Fraud Defender consortium and continue to drive commercial expansion across our customer and geographic base and growing network of channel partners. Customers are increasingly deploying multisignal workflows that combine documents, biometrics, liveness, behavioral analytics and third-party data, which materially improves their economics by reducing fraud losses, lowering manual review and improving conversion. At the same time, as more institutions contribute data to the CFD consortium, detection accuracy improves and loss rates decline, strengthening the value of the network for every participant, including Mitek.\n\nOur third pillar for fiscal '26 is to invest in the areas that we believe we have a clear advantage and where we can lead. As I mentioned earlier, our customers do not just want us to deliver signals, they want a partner who can lead them through this shift by returning data-driven insights for a simple risk-adjusted decision they can act on in real time. This is why our fiscal '26 investments are focused on AI-supported insights and decisioning, biometrics, data and intelligence and targeted go-to-market and delivery capacity. Given our history and expertise, we have a strong basis of differentiation with financial institutions and high assurance use cases.\n\nThis is where incremental investment dollars will have the greatest impact. You'll see this focus reflected in our financials. We expanded adjusted EBITDA margin to 30% in fiscal '25, and we are deliberately reinvesting to fund these initiatives in fiscal '26 while still delivering attractive margins. We expect improvements in gross profit dollars and unit economics as richer decisioning increases value per workflow. You'll see more of our OpEx shift towards R&D and go-to-market as we fund these higher ROI initiatives. Fiscal '25 proved we can grow margin through operating leverage and scale. Fiscal '26 is about investing behind the capabilities where we can lead and evolving our solution set, all with the goal to accelerate growth.\n\nOur fourth pillar is maximizing value through disciplined capital allocation. To lead in the areas where we hold an advantage, every dollar of capital must be deployed deliberately to earn a high return, either reinvested into the capabilities that strengthen our long-term leadership and growth or return to shareholders. We will measure our impact via improving revenue quality and growth, margin durability and strengthen free cash flow conversion, all with a clear capital allocation framework to ensure that we maintain a strong balance sheet while balancing investments with returning capital to shareholders. Our Unify and Grow framework reflects where the market is moving and how our customers are asking us to partner with them.\n\nBy unifying our capabilities and reinvesting in the technology, data and decisioning layers where we have a structural advantage, we are positioning Mitek for durable recurring high-quality organic growth. We expect to expand our SaaS base. increase fraud and identity revenue and extend the reach and value of our consortium. Now before I turn it over to Dave, I also want to recognize our nearly 600 teammates around the world and our trusted partners. Fiscal '25 was a year of meaningful change across the entire company, operationally, commercially and technically. And the team delivered with focus, discipline and a deep commitment to our strong purpose-driven mission of protecting our customers and their users.\n\nThe progress we made this year, including simplifying how we operate, elevating customer support, strengthening the core technology behind our platform and returning to growth reflects the commitment and execution of our people. Their work is the foundation for the results you're hearing today and gives us confidence as we enter fiscal '26. With that, I'll hand it over to Dave.\n\nDavid Lyle:Thanks, Ed. As you just heard, we are exiting fiscal 2025 with a clear framework for fiscal 2026. This afternoon, I will focus my commentary on three areas. First, I'll review our fourth quarter results and will discuss revenue using the historical deposits and identity categories. Then I will review our full year performance using the new fraud and identity and check verification reporting structure. And then finally, I'll walk through our fiscal 2026 outlook and how it supports the pillars Ed laid out. Starting with fourth quarter results. Total Q4 revenue was $44.8 million, up 4% year over year, with SaaS revenue growth of 19% being a highlight.\n\nRevenue results exceeded the midpoint of our guidance range by roughly $4 million as several large deposit deals closed sooner than forecast from higher transactional volumes, and we saw stronger-than-expected identity transaction volumes. Identity revenue was $21 million, up 7% year over year, driven by 14% SaaS growth from continued transactional volume overages and deposits revenue was $23.8 million, up 1% year over year, driven by growth in CFD SaaS revenue. Q4 non-GAAP gross margin was 84%, down approximately 200 basis points year over year, driven by higher investment in SaaS services delivery. Q4 non-GAAP operating expense was just under $25 million, improving 5% sequentially from Q3, driven by lower external services spending and the timing of marketing events.\n\nOn a year-over-year basis, Q4 non-GAAP operating expense increased by approximately $3 million, normalizing for a reduction in bonus accruals and a reversal of doubtful accounts in the prior year, underlying operating expense was essentially flat. Tying this all together, adjusted EBITDA was $12.9 million in the quarter or a 28.7% margin. After other income, interest and tax, non-GAAP net income came in at $11.1 million or $0.24 per diluted share on 47.3 million shares. As Ed mentioned earlier, we have updated our external reporting. Under the new structure, deposits maps to check verification, Identity maps to fraud and identity and Check Fraud Defender has moved from deposits to fraud and identity. We are also simplifying our revenue categories.\n\nGoing forward, the primary change will be the combination of license and maintenance into a single line to better reflect how customers contract and pay for those items. The 10-K provides results in both the prior disaggregated format and the new reporting format, allowing investors to compare historical performance across the two presentations. With that framing, I will now walk through full year 2025 performance. Starting with Fraud and Identity for fiscal year 2025, Fraud and Identity revenue was $90 million, up 15% year over year with growth led by our SaaS offerings, primarily driven by continued volume expansion in our core customer base. What stands out this year is how consistent customer behavior has become across regions and customer tiers.\n\nLarge banks and enterprise customers are converging on the same pattern, shifting identity earlier in the onboarding flow, consolidating fraud and identity workflows and standardizing on bundled stacks rather than fragmented point solutions. Taken together, fraud and identity is now operating at increased scale and more durable economics, positioning us well for continued growth in fiscal 2026. Turning to check verification, comprised of our Mobile Deposit and Check Intelligence products. This portfolio remains an important cash flow generator for the company. Check verification revenue for fiscal 2025 was $90 million compared with $94 million in fiscal 2024, a variance mostly related to deal timing year over year.\n\nThis year's performance reflects the resiliency of a portfolio that has operated in a relatively defined annual revenue range for several years despite overall check volume declines in the U.S. and the digestion effects of an unusually large revenue recognition event in fiscal 2023 from a single large channel partner when we recognized roughly four years' worth of revenue in a single quarter. On a consolidated basis, total revenue for fiscal 2025 was about $180 million, split evenly between fraud and identity and check verification. Our 4% consolidated revenue growth breaks down cleanly as follows: SaaS, which grew 21% year over year, contributed roughly 8 points of growth.\n\nLicensed software and support reduced growth by roughly 4 points as expected, reflecting the ongoing overall mix shift from software term licenses to recurring SaaS. For the full year, non-GAAP gross margin was about 85% compared with about 86% in fiscal 2024. The modest step down is consistent with our transition to a heavier SaaS and services mix. SaaS and services carry blended margins in the mid-70s percent range versus nearly 100% for licensed software. As is typical with a mix shift towards SaaS, the margin rate compresses slightly, but absolute gross profit dollars continue to grow.\n\nImportantly, automation and richer identity fraud journeys are lifting gross profit per journey, which offsets some of the mix impact and supports long-term scale. Non-GAAP operating expense for fiscal 2025 was $100.9 million, improving 2% from last year and an improvement in operating expense intensity from 60% to 56% of revenue. Breaking that down in G&A, vendor consolidation and tighter procurement reduced external spending, bringing G&A intensity down from 20% of revenue to 18%. We also streamlined finance and accounting processes, which lowered our reliance on external advisers.\n\nSales and marketing intensity improved from almost 22% to under 21%, driven by stronger alignment between marketing programs and pipeline generation and a shift away from higher cost event-driven activity toward digital and partner-led demand generation. R&D intensity improved from 18% to 17% of revenue as we completed several platform consolidation initiatives, reduced reliance on higher cost contractors and increased engineering productivity through automation and broader adoption of AI-assisted development tools. Adjusted EBITDA for fiscal 2025 grew by 15% to $54 million, representing a margin of 30%, up from 27% a year ago. Non-GAAP net income for fiscal 2025 was $45 million and roughly flat with fiscal 2024, even though adjusted EBITDA increased by 15%.\n\nThis result was driven primarily by a higher non-GAAP tax rate, 21% in fiscal 2025 compared to 9% in fiscal 2024. The increase reflects higher pretax income across jurisdictions and lower tax deductions from stock-based compensation and other payroll-related items. Free cash flow for the full year was $54 million, which equates to 100% conversion of adjusted EBITDA compared with just under 65% last year. While operational discipline and lower non-GAAP cash adjustments contributed, this conversion level is above what we consider a longer-term steady state, and it's important to highlight a couple of nonstructural tailwinds that will dissipate over time.\n\nFirst, following the expected payoff of our 75 basis points convertible debt on February 1, 2026, we will no longer receive the interest arbitrage benefit. Second, there is an initial working capital step change benefit as revenue mix changes, which should be followed by an ongoing but smaller growth linked benefit as SaaS base expands. And third, by 2028, we will have exhausted the benefits associated with the catch-up provisions within the recent tax legislation, which will lower the cash tax rate during fiscal year 2026 and fiscal year 2027. Taking these items into consideration, over the longer term, we believe a more realistic steady state is around 75% conversion, which we believe is consistent with recurring revenue software peers.\n\nOur approach to capital allocation remains consistent and disciplined. We first fund high-return initiatives in the business while ensuring the balance sheet remains resilient, balanced with returning excess capital to shareholders. We ended the year with about $196 million of cash and investments and approximately $157 million of total debt, resulting in $40 million net cash position. Combined with our committed term loan and revolving credit facilities, this provides full flexibility to retire the $155 million of convertible debt maturing in early calendar 2026 while preserving ample liquidity to fund product development and enable additional share repurchases. Regarding share repurchases, in fiscal 2025, we repurchased approximately $5 million of shares.\n\nAnd since fiscal year-end through December 10, we have repurchased an additional $7.7 million, leaving $13.6 million remaining in the current authorization to execute through May 2026. Let me now turn to our fiscal 2026 outlook. We expect fiscal 2026 revenue of $185 million to $195 million, implying roughly 6% at the midpoint. This range reflects the balance of stable check verification and accelerating fraud and identity demand. With the first quarter nearly complete, Q1 revenue is tracking to between $41 million and $44 million. We expect fiscal 2026 to be slightly more back half weighted, reflecting a gradual ramp in fraud and identity SaaS.\n\nWe expect fraud and identity product portfolio revenue of $101 million to $105 million in fiscal 2026, which would represent approximately 15% growth at the midpoint and would maintain the same growth rate we delivered in fiscal 2025. We expect modest gross margin pressure in fiscal 2026, largely due to mix shift towards SaaS and services as we invest ahead of expected demand growth. We still expect gross profit dollars to continue to rise despite this compression, assuming the midpoint of the revenue guidance range. On operating expenses, we expect to increase R&D intensity as we accelerate development.\n\nThis investment will be funded by continued leverage in G&A and by lower sales and marketing intensity as we unify our go-to-market teams, automate more of the cycle and improve sales operations and analytics. Taken together, these offsets allow us to maintain or improve overall operating expense intensity versus fiscal 2025, even as we invest behind our product road map. We expect fiscal 2026 adjusted EBITDA margins in the 27% to 30% range. At the midpoint, this implies adjusted EBITDA dollars remaining roughly flat year over year, reflecting deliberate reinvestment rather than a step back in earnings power.\n\nWe believe that rising demand for fraud and identity solutions and strong unit economics makes this a good place -- a good balance between delivering profitability and deploying capital into high-return R&D and go-to-market initiatives. We also expect adjusted EBITDA to continue converting to free cash flow at attractive rates during fiscal 2026 with normalization towards our long-term target over time. Regarding taxes, we expect fiscal 2026 non-GAAP tax expense, which reflects cash taxes to decline meaningfully from fiscal 2025. This change is driven by changes in U.S. tax legislation, particularly the revised treatment of capitalized R&D. As a result, we expect a fiscal 2026 non-GAAP tax rate of roughly 10% of non-GAAP pretax income.",
  "qa_section": "Before we turn to Q&A, I want to highlight an important milestone. Over the last several quarters, we've said we would finish the cleanup of material weaknesses in our internal controls. As disclosed in our filings today, we have now fully remediated all previously reported material weaknesses. This outcome reflects multiyear investment in people, systems and technology to strengthen our processes and control environment. This is a significant accomplishment and a meaningful step forward for the company. We want to thank our teams across the organization and particularly our accounting team for their discipline, commitment and very hard work throughout the process.\n\nFinally, our updated investor presentation and the Q4 and full year supplemental financial package are available on our Investor Relations website, including trended historical data for our new product categories and revenue classification. With that, operator, we are ready to take questions.\n\nOperator:Ladies and gentlemen, we will now begin the question-and-answer session.[Operator Instructions]And your first question comes from the line of Mike Grondahl from Northland.\n\nMike Grondahl:Dave, if your SaaS business is doing really well, if you had to sort of distill one or two drivers behind that growth, how would you describe those?\n\nEdward West:Mike, as you point out, we did see an acceleration of SaaS growth throughout the year and feel really good about where the year is ending up. Underlying demand, frankly, what's the big driver of this is what's happening in the market. And we feel like Mitek is really well positioned based on what all is happening with the growth in synthetic fraud because of generative AI, and the growth we're seeing there, the rising fraud, frankly, essentially fraud being democratized. That's been a driver of the needs because of our partnerships and credibility of working with some of the largest financial institutions around the world.\n\nSo we're seeing growth in the overall relationships in terms of new products, new solutions with those institutions. We're seeing growth in transactions, as I mentioned, bringing up our verification process and also fraud checks earlier up as new customers are coming on board. We're seeing more in authentication because of this. And frankly, just the -- with that market continuing to expand, we feel very good about the growth there going forward. So that's the key driver of this. And frankly, the -- what we capture in terms of the outlook this year has been -- is capturing that increasing demand.\n\nMike Grondahl:Got it. And then any more details you can share on Check Fraud Defender number of banks or revenue or just kind of progress momentum you're seeing there?\n\nEdward West:Well, as I mentioned on the call, we saw 50% growth in overall ACV. And probably the biggest metric there, Mike, to be really very encouraging is the amount of data sets that we now have compiled and configured within the consortium. So, today, we're over 25% of all checking accounts in the U.S. -- in the United States, we have visibility into and built those data sets. And when you include the institutions who are currently in pilot phase, that actually approaches 50%, nearly 50% of all U.S. checking accounts. That is, we believe, a significant asset for the consortium and ultimately, this franchise.\n\nAnd it goes back to what I mentioned a minute ago about more signals that we can provide customers around potential fraud and insight, the more valuable the franchise is. So the progress there, the data sets that are being built, the momentum, the engagement with financial institutions and some of the largest institutions in this country are seeing the benefits and it goes back to your previous question, hey, what's driving all this? And it's just the accelerating growth of fraud and synthetic fraud around the world.\n\nOperator:And your next question comes from the line of Jake Roberts from William Blair.\n\nJacob Roberge:Great to see the strong results, good quarter there. Ed, when you initially joined, you talked about getting organic growth back above 10%. Obviously, still building some things out on the fraud side. But now that you've been here for over a year, do you feel like you're starting to get more visibility into that path with SaaS really starting to accelerate this year?\n\nEdward West:Yes. Great question, and thanks for the comment on the results. Again, a lot of work by everybody across this company. Having seen the accelerating growth in SaaS, as we were just talking about, over 21% growth and the growing in demand. But what's most important about getting to that -- our goals, where we want to is that longer-term double-digit growth rate and organic growth -- the good news is the market is moving in the right direction. We feel like Mitek is really well positioned to capitalize on that. And it's going back to that credibility that we have some of the largest financial institutions in the world, the growing need for fraud and identity detection.\n\nAll of that compiles, I think, and leads to decent confidence in going to our longer-term growth objectives there.\n\nJacob Roberge:Okay. That's helpful. And then now that you've done a lot of the heavy lifting on consolidating the platforms and also kind of your go-to-market motion into One Mitek over the past year, what inning do you feel like we're in with those changes on both the go-to-market and product into the One Mitek story? And then how do you feel like the visibility into the business has changed over the past year now that you're not operating several different sales forces and systems?\n\nEdward West:Well, obviously, that improves every day and gets better and better. And last year was a year about fixing the foundation and integrating these various businesses, getting people to working together as one solution and having that strong purpose-driven mission. But frankly, we've moved from that phase and now into the unify and grow where we've got to bring together that integrated platform approach and driving more data and insight and signals, richer signals to provide insights to our core customers. We're early on in there because that's -- we're bringing these pieces together.\n\nWe have a lot of capability and credibility and insights, but that's why building out these various forms, whether that's building up the consortium, bringing more value to those enterprise. We're early on in that. That's still not a mature business as we've talked about. Then also fighting the fraud that evolves and change every day. I think we've got a good grasp on having the discipline on how we're operating across the platform. Now I think we're just now beginning to get into the groove of really seeing that come together in terms of value creation for our customers and ultimately for Mitek.\n\nJacob Roberge:Very helpful. And then, Dave, if I could just sneak one more in. I know you're still sunsetting some of the legacy hardware assets. Can you help us understand what that headwind will be on revenue growth this year? And will those hardware products be fully sunsetted this year?\n\nDavid Lyle:Sure. Yes, we've actually expected a more rapid falloff, as you know, in revenue from those -- that hardware product. It just survived for longer than we thought, which actually is a good thing from a revenue perspective. But we're down into the immateriality level of revenue dollars. So it will have a little bit of an impact, but nothing like it's had historically in the last couple of years.\n\nEdward West:Next question, operator.\n\nOperator:And your next question comes from the line of Surinder Thind from Jefferies.\n\nSurinder Thind:Ed, can you maybe talk about the level of investment that you're making at this point? Is that kind of a normalized pace? Or are we early in an investment cycle where maybe there's a lot of ideas to pursue given how things are changing? Just any color on that as you think about the year ahead and obviously, the next couple of years?\n\nEdward West:Sure. Well, I think Dave outlined in his remarks just in terms of the -- what that investment looks like this year. And that's really driven. As you know, we've been very disciplined about the operations, driving margin, the performance, integrating the business. This is really driven by the confidence that we see where we're positioned with customers, what's happening in the market and how do we accelerate growth because of what's happening and making sure we're capitalizing on that as a business for everyone involved. Longer term, we continue to -- we're very margin focused. We want to continue to grow free cash flow and margins.\n\nSo -- but I think we've outlined the amount of investment here and continuing to drive performance from there.\n\nSurinder Thind:So, Ed, maybe a clarification on my part. I guess what I was trying to ask is more about like are we in a period where you could -- if you wanted to invest even more at this point? Or are you pursuing all of the ideas that you want to pursue in relationship to obviously, I understand you have to balance margins and stuff. But just that's what I was trying to get a better handle on the longer term...\n\nEdward West:Sure. Yes. I would say we want to be prudent and balanced with the business. anybody can say they always can invest more. There are clearly continue to be things, but we just want to be prudent. We want to deliver the results and be a balance in it, just like we've talked about in capital allocation and maintaining that flexibility. But right now, we feel good about where we are, the position and what we have.\n\nDavid Lyle:Yes. We think, Surinder, we have the kind of right balance like Ed was talking about. The big focus, as Ed also stated on R&D, more specifically on AI decisioning, biometrics and fraud intelligence. And then on the go-to-market side of the equation, it's time to strike a little harder there and put a little more investment there. Most of the investment is going to be in R&D. And I think this is a good pace to do it looking into 2026.\n\nSurinder Thind:Got it. And then when we kind of think about -- you talked a little bit about Check Fraud Defender and all the good stuff that's going on. You also highlighted the idea that some of the larger financial institutions are taking their time. Is that something that might potentially change as we go ahead? Or is that just as you've now kind of worked through this process, that's just how it is, meaning that if you layer on a number of these FIs taking time, ultimately, the growth rate would accelerate, right?\n\nBut I'm just trying to understand the dynamic there of how we think about the decision-making at the large FIIs and what that really means for the FD's growth rate.\n\nEdward West:Yes. I think the more data that you have, the incremental value creation just increases. And so the more value everybody sees that should accelerate over time. And we've continued to build out the business, the insights and the value there. But these are very large institutions. They take their time. They've got built-in processes that they go through. The good news is it's coming along. It's been happening and will continue. We think that, that would accelerate over time. But our focus is getting the data and the insight that then we can share with the customers and create more value for them and Mitek.\n\nOperator:And your next question comes from the line of George Sutton from Craig-Hallum.\n\nGeorge Sutton:Nice results. So when we're talking about synthetic fraud, I wondered if we can get a little more granular in terms of how the discussions with the customers are going. You've been trying to migrate folks from point solutions into the MiVIP platform and the full stack. Is synthetic fraud helping drive those discussions? Or are you seeing new interest from new parties specific around synthetic fraud?\n\nEdward West:Well, going to the former -- thank you, George, is synthetic fraud, obviously, whether they're injection attacks, presentation attacks, template attacks that are happening, deepfakes, all this, and that's accelerating. And the reason we take a highly layered approach to detection, which is why having that orchestration and VIP is very important. And the more insight and signals we can bring to that, the more detection we can deliver. That's why, again, we have unique assets with the biometric and liveness capabilities combined with other signals, we can bring in other third-party signals and all these different pieces come together in a platform approach to provide more data.\n\nAnd as that synthetic fraud is increasing, is helping out on that detection. But it's changing. It's changing daily. Some of the fraud vectors change rapidly, and that's why staying in front of that and having that core partner is very important. I think as this continues to grow, as your second point of that, it logically would start impacting other organizations as well and seeing other use cases where it's important to bring these biometric liveness and other fraud detection and synthetic fraud detection capabilities to bear on applications that we may not have been thinking about a year or so ago that we're now seeing today.\n\nGeorge Sutton:Got you. So I wondered if we could walk through the pilot process for the banks, these large banks. Obviously, the network effect is starting to occur here. I'm just curious, how are they viewing their pilot process? Are they're obviously looking for incremental value of being part of the consortium versus something they would have identified themselves. Can you just walk through kind of the touch points there?\n\nEdward West:You just outlined it, being a part of the consortium start seeing the value of, okay, now I'm seeing data, have access to data that I didn't have on my own, for example, where we can talk about the amount of the coverage. A lot of times, we'll go into and meet with an institution, we'll already have insights and data sets on their customers that they didn't give to us, but because we see it in many other financial institutions so frequently that we've been able to build up that profile to then have that conversation. That gets folks attention.\n\nNow they start seeing the benefit of being a part of a consortium versus just having an on-premise software solution themselves that is now maybe not seeing all of the signal-rich capabilities about being a part of a broader consortium. So now just going through that just takes time. You walk through, you get the data, you do the test, do the pilot, and it just evolves over time and getting people more broad. You're talking about very large institutions who have done it in certain ways. And the more data they have, they see, now they see the benefits and then participate in the consortium.\n\nWe have multiple top 10 institutions, some of the largest in the country in working with us. And so we're encouraged about the progress at what we see ahead.\n\nGeorge Sutton:Got you. Just one other thing. We're 80% or so through the fiscal first quarter. And we also line up with the fiscal year-ends of most of your customers. I'm just curious if you can -- are there any sort of things you would point to that might be a focus for this quarter versus what you were seeing in Q3 or any meaningful deltas?\n\nEdward West:No meaningful deltas other than just continued -- directionally, I think, has informed the guidance that we've outlined for the year, and Dave walked through both the year. And frankly, we gave you some more color on the quarter based on where we are.\n\nOperator:And your next question comes from the line of Allen Klee from Maxim Group.\n\nAllen Klee:Could you comment a little on the mobile deposit business on -- in terms of -- it looks like if you back in, you're implying a decline. Are you thinking that this business is kind of going to be in secular decline or some stability at some point? Or how are you thinking about it?\n\nEdward West:Well, I'll tell you, let me just turn it over to Dave to walk through in terms of what your point there, Allen, is kind of backing into what that means from a guidance.\n\nDavid Lyle:Yes. The way we kind of look at it is looking historically at the stability in the overall transactional volume that we see for Mobile Deposit, it's been a $1.2 billion plus for years, right? And so we've managed pretty well just through adoption, I think, to keep those volumes where they -- in a pretty stable position. What we've seen over the past couple of years is more about deal timing from a revenue perspective. If you remember, Allen, there was a very large channel partner deal that allowed us to -- or required us to recognize four years of revenue in a single quarter in 2023, essentially taking out sequential years ahead of additional revenue from that customer.\n\nThat circles back, by the way, next year in 2027, where we'll have a renewal there. But that creates -- the digestion of that deal created some pretty big declines over the years. And we also have -- depending on when larger customers run out of transactions and have to renew, that timing matters in a pretty significant way. You even saw some of that at the end of Q4, where we had some expected upsides. When you have expected upsides in that time period, it's usually because they run out of transactions earlier, which is a good thing. So we know that overall checks are coming down over time.\n\nAnd eventually, they will start to see a more secular decline from our transaction volume. But right now, we're seeing stability in that -- in the volumes.\n\nEdward West:Yes. So just kind of long-term takeaway or to summarize that is just separating out the underlying transaction volumes, which is right, has been around $1.2 billion versus the rev rec based on those ongoing purchases of the volumes.\n\nAllen Klee:Okay. And then just from a capital structure perspective, is it reasonable to assume that you will pay off the entire amount of the convert when it comes due or that you might use some of your facilities to keep more cash around?\n\nDavid Lyle:Yes. The decision -- so first of all, yes, we're going to pay the debt off completely when it's due February 1, 2026. We haven't yet communicated how we're going to do that. We have that $100 million facility, the $75 million term and the $25 million revolver to give us flexibility. We'll make that decision closer to the time we actually pay it off. It could be a combination of both borrowings as well as cash from our cash balance.\n\nEdward West:And as Dave pointed out, we have close to end of the year, roughly $196 million in cash plus those facilities.\n\nOperator:There are no further questions at this time. I will now hand the call back to Mr. Ed West for any closing remarks.\n\nEdward West:Great. Well, thank you. Thank you very much for your interest and time. You've got a highly enthusiastic team and company based on the position where we see things evolving in the market and very energized about what's happening. So thank you for your interest, and we look forward to visiting with you all over this next quarter. Have a great day.\n\nOperator:And this concludes today's call. Thank you for participating. You may all disconnect.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has positions in and recommends Mitek Systems. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "source": "motley-fool",
  "word_count": 7293,
  "scraped_at": "2026-01-11T17:55:07.497639",
  "filename": "MITK_2025_Q4_ac999a.json"
}