{
  "ticker": "NCPL",
  "company": "Netcapital",
  "title": "Netcapital (NCPL) Q1 2025 Earnings Call Transcript",
  "year": 2025,
  "quarter": 1,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/netcapital-ncpl-q1-2025-earnings-call-transcript/",
  "transcript": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nMonday, September 16, 2024 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nManagement emphasized a significant strategic shift away from equity-based revenue contracts while advancing new revenue diversification initiatives, including a FINRA broker-dealer application and the development of a secondary trading platform in partnership with Templum ATS. The team highlighted achievement of renewed Nasdaq listing compliance through a new ATM agreement, which allows continued access to public capital markets. Executives clarified that usage of the ATM will only be reported through SEC filings and not via interim press releases or 8-Ks.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nWith that said, I'd like to now turn to our financial results for the first quarter of fiscal 2025. Revenues for the first quarter of fiscal 2025 for the period ending July 31, 2024, decreased by almost $1.4 million or approximately 91% to $142,227 compared to approximately $1.5 million in the first quarter of 2024. The decline in revenue was primarily attributed to a decrease in revenues for the services that we provide in exchange for equity securities during the quarter. We had no revenues from equity-based contracts as compared to over $1.1 million in such revenues in the 3 months ended July 31, 2023.\n\nWe are focusing on establishing a broker-dealer subsidiary so that the company may have additional sources of revenue, and we have not been pursuing equity-based revenue contracts. Total funding portal revenues declined by $233,800 or approximately 62% to $242,056 during the first quarter of fiscal 2025. Total funding portal revenue consists of portal fees, listing fees and a 1% equity fee. Revenue from portal fees decreased by $132,427 or approximately 60% in the 3 months ended July 31, 2024, to $89,429 from $221,856 in the 3 months ended July 31, 2023.\n\nRevenues from portal fees consist of a 4.9% fixed fee of the total capital raised by the issuer plus fixed miscellaneous charges for administrative fees, such as the rolling close or the filing of an amended offering statement. The decline in portal fees is a result of a decrease in the amount of capital that we raised on our funding portal during the period. Total funds raised in offerings decreased by almost $1.8 million or approximately 60% in the 3-month period ending July 31, 2024, to approximately $1.2 million as compared to approximately $2.96 million in the same period of 2023.\n\nRevenue from listing fees decreased by $111,500 or approximately 72% to $42,500 in the 3 months ended July 31, 2024, as compared to $154,000 in the 3 months ended July 31, 2023. Listing fees are typically $5,000 per issuer and they are the first form of revenue earned by our funding portal when an issuer signs a contract with us to sell securities on the portal. The drop in listing fees can be attributed to our loss of an experienced salesperson [Technical Difficulty].\n\nOperator:Coreen, I do apologize. This is the operator. Your line is breaking up. I'm going to attempt to dial up to your line, so I can get a clear connection.\n\nCoreen Kraysler:Okay.\n\nOperator:Coreen, your line is live.\n\nCoreen Kraysler:Thank you. We had an operating loss of approximately $2.5 million for the first quarter of fiscal 2025 as compared to an operating loss of $749,020 for the first quarter of fiscal 2024. Our net loss for the first quarter of fiscal 2025 was $2,527,170 as compared to $491,665 for the same period prior. We reported a loss per share of $5.10 for the first quarter ended July 31, 2024, compared to a loss per share of $4.61 for the same period in the prior year. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. I'd like to thank everyone for showing their interest and being on this call today. We did see some challenges during the quarter, especially in regard to our operational and financial metrics. The climate for fundraising does slow down during the summertime, and there is, of course, some cyclicality and some unpredictability in our business. With that said, we've taken some important steps this quarter. First, the beta version launch of our secondary trading platform through the Templum ATS, which may offer investors another way to trade through the Netcapital funding portal. Templum ATS is now approved in over 50 U.S. states and territories, and this partnership may provide our investors with better liquidity for secondary trading.\n\nThe second thing is -- another key initiative is our application for broker-dealer registration with FINRA, which Coreen mentioned. We intend to use this to offer Reg A+ and Reg D deals and form broker-dealer partnerships. This may help grow our revenues through hosting and fees and enhance our distribution capabilities which may expand our current ecosystem and our addressable market. During the quarter, we also put in place an ATM agreement and regained compliance with NASDAQ's Listing Rule 5550(a)(2) known as the bid price rule, which will allow us to continue trading on NASDAQ. It's important for us to maintain our NASDAQ listing to further support shareholder value and confidence.\n\nSo despite the challenges we face, we very much remain committed to our vision of empowering entrepreneurs and investors by providing a streamlined platform for capital raising and investing in early-stage and growth-stage companies. Our portal facilitates access to capital through equity crowd funding and other investment opportunities, democratizing the investment process and fostering innovation and growth. By focusing on transparency, efficiency and user engagement, Netcapital seeks to create a more inclusive financial ecosystem that benefits both issuers and investors. Again, and as always, thank you for your interest and support of Netcapital. Operator, we are ready for questions.\n\nOperator:[Operator Instructions]Your first question is coming from John Gilliam from Point Clear.\n\nJohn Gilliam:Yes, Martin. Could you give us an idea of the launch date of the secondary trading portal where it will be fully available to retail investors?\n\nMartin Kay:I'm sorry, I didn't quite catch the question there. My phone bleeped. You were asking about the secondary?\n\nJohn Gilliam:Asking about the launch date of the trading platform, the secondary trading platform. Yes. When will it be available for retail investors?\n\nMartin Kay:Got it. Great question. And that's not something that we have specifically stated to the market at this point. We're still working through some issues with usability and so on, and we want to make sure that when we go live with it to a broader group outside of our closed beta that we get the most impact from that launch. So we're holding off for now on launching that more broadly.\n\nJohn Gilliam:At the Wainwright conference, you mentioned it would launch soon. I guess what I'm looking for is ballpark idea. Are we talking Q4? Are we talking 2025, calendar year 2025? Just a ballpark idea.\n\nMartin Kay:I can't give you anything too specific. But we're moving as quickly as we can with both the regulators and our customers, our issuers and investors to make sure that we get that -- we launch that to have its maximum effect in the marketplace.\n\nJohn Gilliam:That's not a very good answer. Really looking for, I mean, is it going to be in the next year? Is it going to be 2 years?\n\nMartin Kay:It's certainly not going to be...\n\nJohn Gilliam:It's been 18 months since it was announced, 18 months ago, thereabouts is when it was announced. So just trying to get an idea. I mean, what are we looking at?\n\nMartin Kay:it's a very fair question. And again, it's -- we have had -- as we've announced, we've had the end-to-end platform in partnership with the ATS Templum. We've had that technology and that platform built out for some months now. We've been doing some testing with a closed group of beta users. I think our -- I would like to be able to -- we hope to be able to launch before the end of this calendar year. But again, there are factors as we've stated in the -- all of the filings we've made on this topic, there are factors that are somewhat beyond our control with respect to regulations.\n\nAnd so I can't really be much more specific than that, unfortunately.\n\nJohn Gilliam:All right. With regard to the companies that are listed on our balance sheet as -- at the price that they've had offerings recently, will all of those securities be available to trade on the secondary trading platform when it opens?\n\nMartin Kay:That is the intention, yes. That's what we have stated in our filings.\n\nOperator:Your next question is coming from Patrick Rooney from Crosby Capital.\n\nUnknown Analyst:On your ATM, do you intend to do a press release as you partially complete that or only when it's totally complete? That's one. Second question, what is your monthly burn rate?\n\nMartin Kay:And I think you meant the ATM, right, Pat, you were asking about that or...?\n\nUnknown Analyst:Yes, the ATM. In other words, if it gets partially done, you do not $2.1 million, but you do $300,000. Will you make a press release or no?\n\nCoreen Kraysler:We do not announce usage of the ATM. You will see it in our quarterly filings.\n\nUnknown Analyst:You will not make an announcement if you're successfully...\n\nCoreen Kraysler:We don't put out -- we're not required to put out a press release or an 8-K when we use the ATM, but we do disclose the ATM usage in our quarterly filings.\n\nUnknown Analyst:Okay. And the burn rate, I assume that -- no, go ahead, monthly burn rate...\n\nCoreen Kraysler:We've said in the past that our burn rate is $300,000 plus a month.\n\nOperator:Your next question is coming from Robert Topping from Topping Capital.\n\nRob Topping:Sorry for the background noise here. I'm on the street. But I'll probably just kind of extend to the 2 earlier questions in another manner. But on the operating burn, given all the investments in the ATS system, do you see that curtailing? I mean when you effectively do a full launch, does the burn on that slow down pretty dramatically? I mean how much of that $300,000 a month is dedicated towards that? And then the other question I had, and I may circle back with 2 more. But the other question I had is on the ATS launch, is some of the friction regulatory? Or is it just the beta group and the technology and working through that?\n\nMartin Kay:I'll start us off and Coreen can jump in for sure. With respect to the secondary and the burn, yes, there is some relationship. I would say, one of the things that we're doing is, we're spending a lot of time and resources and energy of our own and with third parties educating regulators on what we're doing, why we're doing it, why we're allowed to do it, why it's part of the regulatory framework that we operate within. So yes, I think, Rob, and thanks for the questions. I think there's a relationship there, but maybe not the one you suspected around building out the platform.\n\nA lot of the -- all of the technology is -- I mean, as you guys know, it's never done, a product is never done. There's always improvements. There's always enhancements. But we have a launch-ready beta. We announced it to a closed group. So there's always work to be done to enhance the product as we go forward and there always will be. But a lot of what we're spending time and money on right now is making sure that from a regulatory perspective, various regulators we deal with understand what we're doing, why we're doing it. Does that answer part of your question? I'm sorry, if...\n\nRob Topping:Yes, it does. I was on mute. Sorry about that. And I'll circle back with my other questions here, give somebody else a chance.\n\nMartin Kay:And with respect to the burn, just I think you had a question about that, Rob, as well. Again, as we've talked about, in May, we announced our broker-dealer application process that's -- in an attempt to move upscale into bigger transactions. And so obviously, our burn is a function of revenue minus cost, and so we'll -- we expect and hope that, that will allow us to generate incremental revenue streams beyond where we are today.\n\nRob Topping:But it seems like from what Coreen has said, I think, is I mean $1 million a quarter burn is kind of a fair or a conservative amount. Is that correct? Because there's operating and then a lot of other numbers that show up. But I think I just heard $300,000 a month. So if I was just mindset of $1 million a quarter, that would be good number on the operating burn?\n\nMartin Kay:I think that's right. I think the -- I'm not going to say wildcards, but the things that can change that for us on the revenue side are there are -- it is a little unpredictable. We have whales that come through our model and raise big amounts of capital in certain quarters. So that can make a difference. And then, yes, we have responses to regulatory inquiries as everyone does in both financial services in general and in our industry, specifically that tap resources. But your general rule of thumb, yes, that's what we've said in the past and that's still true.\n\nOperator:[Operator Instructions]Your next question is coming from Jon Wheeler from Resurgent Realty.\n\nJon Wheeler:Martin, this question is for you. So I have a couple of questions. And I think the first question would be at the current stock price, why is management and the Board of Directors not really stepping up to buy the shares to support the company at this time? So I'm not going to give you 2 or 3 questions at one time, but if you could answer that question, that's my first question. Hello?\n\nCoreen Kraysler:I'll answer that. Jon, are you there?\n\nJon Wheeler:Yes. I think you all -- we've had a bad connection all morning. So can you hear me now?\n\nCoreen Kraysler:I can hear you. So my answer to your question would be both. We're severely restricted in what we can do in terms of management purchasing shares themselves due to the nature of the fundraising that we have been doing. So we've been very severely restricted in doing that so far. What's your next question, please?\n\nJon Wheeler:So the next question is, you're publicly traded, and it seems to be at some point in time dealing with reality and the associated public costs to be publicly traded, your $300,000 per month burn rate, when I looked at your last filing, it says you have a little over $800,000 cash on hand, what point in time do you all face reality from the standpoint maybe it's not best to be in a public platform and more so private, maybe more so associated with some of your peer groups because I feel like every 6 months, there's another warrant to conversion, $2 million extreme dilution. And now you've put up an ATM with Wainwright, which will be another dilution.\n\nAt what point in time does the treadmill stop from potentially moving from public to private? That's question two.\n\nMartin Kay:Again, Jon, sorry, I lost you for a little bit there on your last question, but I heard that one. Look, for us, we -- as I have said in the past, we are 100% committed to our vision in this business. We believe in the business, and we believe in the value that we can create and can be created in the business. So we're in this for the long term. We succeed when our issuers succeed. Every quarter, there are more examples of our issuers coming out of the -- I like to say, the back end of our process and having success in progressing to the next level.\n\nWe had a company Avadain that raised, I think, $4.5 million on our platform in the fall and just announced a couple of weeks ago -- they're in the graphene business that supplies electric vehicle companies, and they just added Henry Ford III to their Board who's -- as the Chairman of their Board, and he's obviously on the Board of the Ford Motor Company. So that, along with the others that we always talk about and the others that are getting added is examples from our perspective of growing market awareness, more success stories, this becoming more of a mainstream market and something, again, where we really believe in the long-term value here.\n\nAnd we appreciate the investors, the shareholders who have stuck with us along this process. To your question of when does it change? Yes, there's a gradual -- there's a momentum, a swelling momentum that I just talked about in the industry and in the marketplace. There are also obviously -- we have a portfolio of minority positions. We've also started, as of FY '24, taking 1% of equity issued from every issuer on our platform. So I believe I'm right in saying I think we have 37 of those small equity positions alongside the 22 portfolio -- what we call portfolio companies.\n\nSo obviously, there's optionality in all of that portfolio, especially as we broaden it now to include everyone who comes through our platform. So any one of those minority positions becoming liquid or getting to the next level is obviously a way that sort of proves out our model to those that don't believe it and generates liquidity for us. In the same way, in the core business, we're talking to some marquee -- what I call, marquee issuers, so folks who would be newsworthy and noteworthy as participants on our platform. So there are sort of -- there are quantum steps that we can take as we progress down this path.\n\nAnd obviously, I can't necessarily predict any of those. But what I can say is that the groundswell of activity in our space is maturing. And as it matures, these are early-stage private companies, it takes a while, but they do get there and some subset of them will be successful, and that's what will drive the value that we're creating.\n\nOperator:Thank you. That concludes our Q&A session. I will now hand the conference back to our host for closing remarks. Please go ahead.\n\nCoreen Kraysler:Thank you for joining, everyone. We really appreciate all your support, and we look forward to speaking with you again soon. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you, everyone. This concludes today's event. You may disconnect at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nMonday, September 16, 2024 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nManagement emphasized a significant strategic shift away from equity-based revenue contracts while advancing new revenue diversification initiatives, including a FINRA broker-dealer application and the development of a secondary trading platform in partnership with Templum ATS. The team highlighted achievement of renewed Nasdaq listing compliance through a new ATM agreement, which allows continued access to public capital markets. Executives clarified that usage of the ATM will only be reported through SEC filings and not via interim press releases or 8-Ks.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nWith that said, I'd like to now turn to our financial results for the first quarter of fiscal 2025. Revenues for the first quarter of fiscal 2025 for the period ending July 31, 2024, decreased by almost $1.4 million or approximately 91% to $142,227 compared to approximately $1.5 million in the first quarter of 2024. The decline in revenue was primarily attributed to a decrease in revenues for the services that we provide in exchange for equity securities during the quarter. We had no revenues from equity-based contracts as compared to over $1.1 million in such revenues in the 3 months ended July 31, 2023.\n\nWe are focusing on establishing a broker-dealer subsidiary so that the company may have additional sources of revenue, and we have not been pursuing equity-based revenue contracts. Total funding portal revenues declined by $233,800 or approximately 62% to $242,056 during the first quarter of fiscal 2025. Total funding portal revenue consists of portal fees, listing fees and a 1% equity fee. Revenue from portal fees decreased by $132,427 or approximately 60% in the 3 months ended July 31, 2024, to $89,429 from $221,856 in the 3 months ended July 31, 2023.\n\nRevenues from portal fees consist of a 4.9% fixed fee of the total capital raised by the issuer plus fixed miscellaneous charges for administrative fees, such as the rolling close or the filing of an amended offering statement. The decline in portal fees is a result of a decrease in the amount of capital that we raised on our funding portal during the period. Total funds raised in offerings decreased by almost $1.8 million or approximately 60% in the 3-month period ending July 31, 2024, to approximately $1.2 million as compared to approximately $2.96 million in the same period of 2023.\n\nRevenue from listing fees decreased by $111,500 or approximately 72% to $42,500 in the 3 months ended July 31, 2024, as compared to $154,000 in the 3 months ended July 31, 2023. Listing fees are typically $5,000 per issuer and they are the first form of revenue earned by our funding portal when an issuer signs a contract with us to sell securities on the portal. The drop in listing fees can be attributed to our loss of an experienced salesperson [Technical Difficulty].\n\nOperator:Coreen, I do apologize. This is the operator. Your line is breaking up. I'm going to attempt to dial up to your line, so I can get a clear connection.\n\nCoreen Kraysler:Okay.\n\nOperator:Coreen, your line is live.\n\nCoreen Kraysler:Thank you. We had an operating loss of approximately $2.5 million for the first quarter of fiscal 2025 as compared to an operating loss of $749,020 for the first quarter of fiscal 2024. Our net loss for the first quarter of fiscal 2025 was $2,527,170 as compared to $491,665 for the same period prior. We reported a loss per share of $5.10 for the first quarter ended July 31, 2024, compared to a loss per share of $4.61 for the same period in the prior year. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. I'd like to thank everyone for showing their interest and being on this call today. We did see some challenges during the quarter, especially in regard to our operational and financial metrics. The climate for fundraising does slow down during the summertime, and there is, of course, some cyclicality and some unpredictability in our business. With that said, we've taken some important steps this quarter. First, the beta version launch of our secondary trading platform through the Templum ATS, which may offer investors another way to trade through the Netcapital funding portal. Templum ATS is now approved in over 50 U.S. states and territories, and this partnership may provide our investors with better liquidity for secondary trading.\n\nThe second thing is -- another key initiative is our application for broker-dealer registration with FINRA, which Coreen mentioned. We intend to use this to offer Reg A+ and Reg D deals and form broker-dealer partnerships. This may help grow our revenues through hosting and fees and enhance our distribution capabilities which may expand our current ecosystem and our addressable market. During the quarter, we also put in place an ATM agreement and regained compliance with NASDAQ's Listing Rule 5550(a)(2) known as the bid price rule, which will allow us to continue trading on NASDAQ. It's important for us to maintain our NASDAQ listing to further support shareholder value and confidence.\n\nSo despite the challenges we face, we very much remain committed to our vision of empowering entrepreneurs and investors by providing a streamlined platform for capital raising and investing in early-stage and growth-stage companies. Our portal facilitates access to capital through equity crowd funding and other investment opportunities, democratizing the investment process and fostering innovation and growth. By focusing on transparency, efficiency and user engagement, Netcapital seeks to create a more inclusive financial ecosystem that benefits both issuers and investors. Again, and as always, thank you for your interest and support of Netcapital. Operator, we are ready for questions.\n\nOperator:[Operator Instructions]Your first question is coming from John Gilliam from Point Clear.\n\nJohn Gilliam:Yes, Martin. Could you give us an idea of the launch date of the secondary trading portal where it will be fully available to retail investors?\n\nMartin Kay:I'm sorry, I didn't quite catch the question there. My phone bleeped. You were asking about the secondary?\n\nJohn Gilliam:Asking about the launch date of the trading platform, the secondary trading platform. Yes. When will it be available for retail investors?\n\nMartin Kay:Got it. Great question. And that's not something that we have specifically stated to the market at this point. We're still working through some issues with usability and so on, and we want to make sure that when we go live with it to a broader group outside of our closed beta that we get the most impact from that launch. So we're holding off for now on launching that more broadly.\n\nJohn Gilliam:At the Wainwright conference, you mentioned it would launch soon. I guess what I'm looking for is ballpark idea. Are we talking Q4? Are we talking 2025, calendar year 2025? Just a ballpark idea.\n\nMartin Kay:I can't give you anything too specific. But we're moving as quickly as we can with both the regulators and our customers, our issuers and investors to make sure that we get that -- we launch that to have its maximum effect in the marketplace.\n\nJohn Gilliam:That's not a very good answer. Really looking for, I mean, is it going to be in the next year? Is it going to be 2 years?\n\nMartin Kay:It's certainly not going to be...\n\nJohn Gilliam:It's been 18 months since it was announced, 18 months ago, thereabouts is when it was announced. So just trying to get an idea. I mean, what are we looking at?\n\nMartin Kay:it's a very fair question. And again, it's -- we have had -- as we've announced, we've had the end-to-end platform in partnership with the ATS Templum. We've had that technology and that platform built out for some months now. We've been doing some testing with a closed group of beta users. I think our -- I would like to be able to -- we hope to be able to launch before the end of this calendar year. But again, there are factors as we've stated in the -- all of the filings we've made on this topic, there are factors that are somewhat beyond our control with respect to regulations.\n\nAnd so I can't really be much more specific than that, unfortunately.\n\nJohn Gilliam:All right. With regard to the companies that are listed on our balance sheet as -- at the price that they've had offerings recently, will all of those securities be available to trade on the secondary trading platform when it opens?\n\nMartin Kay:That is the intention, yes. That's what we have stated in our filings.\n\nOperator:Your next question is coming from Patrick Rooney from Crosby Capital.\n\nUnknown Analyst:On your ATM, do you intend to do a press release as you partially complete that or only when it's totally complete? That's one. Second question, what is your monthly burn rate?\n\nMartin Kay:And I think you meant the ATM, right, Pat, you were asking about that or...?\n\nUnknown Analyst:Yes, the ATM. In other words, if it gets partially done, you do not $2.1 million, but you do $300,000. Will you make a press release or no?\n\nCoreen Kraysler:We do not announce usage of the ATM. You will see it in our quarterly filings.\n\nUnknown Analyst:You will not make an announcement if you're successfully...\n\nCoreen Kraysler:We don't put out -- we're not required to put out a press release or an 8-K when we use the ATM, but we do disclose the ATM usage in our quarterly filings.\n\nUnknown Analyst:Okay. And the burn rate, I assume that -- no, go ahead, monthly burn rate...\n\nCoreen Kraysler:We've said in the past that our burn rate is $300,000 plus a month.\n\nOperator:Your next question is coming from Robert Topping from Topping Capital.\n\nRob Topping:Sorry for the background noise here. I'm on the street. But I'll probably just kind of extend to the 2 earlier questions in another manner. But on the operating burn, given all the investments in the ATS system, do you see that curtailing? I mean when you effectively do a full launch, does the burn on that slow down pretty dramatically? I mean how much of that $300,000 a month is dedicated towards that? And then the other question I had, and I may circle back with 2 more. But the other question I had is on the ATS launch, is some of the friction regulatory? Or is it just the beta group and the technology and working through that?\n\nMartin Kay:I'll start us off and Coreen can jump in for sure. With respect to the secondary and the burn, yes, there is some relationship. I would say, one of the things that we're doing is, we're spending a lot of time and resources and energy of our own and with third parties educating regulators on what we're doing, why we're doing it, why we're allowed to do it, why it's part of the regulatory framework that we operate within. So yes, I think, Rob, and thanks for the questions. I think there's a relationship there, but maybe not the one you suspected around building out the platform.\n\nA lot of the -- all of the technology is -- I mean, as you guys know, it's never done, a product is never done. There's always improvements. There's always enhancements. But we have a launch-ready beta. We announced it to a closed group. So there's always work to be done to enhance the product as we go forward and there always will be. But a lot of what we're spending time and money on right now is making sure that from a regulatory perspective, various regulators we deal with understand what we're doing, why we're doing it. Does that answer part of your question? I'm sorry, if...\n\nRob Topping:Yes, it does. I was on mute. Sorry about that. And I'll circle back with my other questions here, give somebody else a chance.\n\nMartin Kay:And with respect to the burn, just I think you had a question about that, Rob, as well. Again, as we've talked about, in May, we announced our broker-dealer application process that's -- in an attempt to move upscale into bigger transactions. And so obviously, our burn is a function of revenue minus cost, and so we'll -- we expect and hope that, that will allow us to generate incremental revenue streams beyond where we are today.\n\nRob Topping:But it seems like from what Coreen has said, I think, is I mean $1 million a quarter burn is kind of a fair or a conservative amount. Is that correct? Because there's operating and then a lot of other numbers that show up. But I think I just heard $300,000 a month. So if I was just mindset of $1 million a quarter, that would be good number on the operating burn?\n\nMartin Kay:I think that's right. I think the -- I'm not going to say wildcards, but the things that can change that for us on the revenue side are there are -- it is a little unpredictable. We have whales that come through our model and raise big amounts of capital in certain quarters. So that can make a difference. And then, yes, we have responses to regulatory inquiries as everyone does in both financial services in general and in our industry, specifically that tap resources. But your general rule of thumb, yes, that's what we've said in the past and that's still true.\n\nOperator:[Operator Instructions]Your next question is coming from Jon Wheeler from Resurgent Realty.\n\nJon Wheeler:Martin, this question is for you. So I have a couple of questions. And I think the first question would be at the current stock price, why is management and the Board of Directors not really stepping up to buy the shares to support the company at this time? So I'm not going to give you 2 or 3 questions at one time, but if you could answer that question, that's my first question. Hello?\n\nCoreen Kraysler:I'll answer that. Jon, are you there?\n\nJon Wheeler:Yes. I think you all -- we've had a bad connection all morning. So can you hear me now?\n\nCoreen Kraysler:I can hear you. So my answer to your question would be both. We're severely restricted in what we can do in terms of management purchasing shares themselves due to the nature of the fundraising that we have been doing. So we've been very severely restricted in doing that so far. What's your next question, please?\n\nJon Wheeler:So the next question is, you're publicly traded, and it seems to be at some point in time dealing with reality and the associated public costs to be publicly traded, your $300,000 per month burn rate, when I looked at your last filing, it says you have a little over $800,000 cash on hand, what point in time do you all face reality from the standpoint maybe it's not best to be in a public platform and more so private, maybe more so associated with some of your peer groups because I feel like every 6 months, there's another warrant to conversion, $2 million extreme dilution. And now you've put up an ATM with Wainwright, which will be another dilution.\n\nAt what point in time does the treadmill stop from potentially moving from public to private? That's question two.\n\nMartin Kay:Again, Jon, sorry, I lost you for a little bit there on your last question, but I heard that one. Look, for us, we -- as I have said in the past, we are 100% committed to our vision in this business. We believe in the business, and we believe in the value that we can create and can be created in the business. So we're in this for the long term. We succeed when our issuers succeed. Every quarter, there are more examples of our issuers coming out of the -- I like to say, the back end of our process and having success in progressing to the next level.\n\nWe had a company Avadain that raised, I think, $4.5 million on our platform in the fall and just announced a couple of weeks ago -- they're in the graphene business that supplies electric vehicle companies, and they just added Henry Ford III to their Board who's -- as the Chairman of their Board, and he's obviously on the Board of the Ford Motor Company. So that, along with the others that we always talk about and the others that are getting added is examples from our perspective of growing market awareness, more success stories, this becoming more of a mainstream market and something, again, where we really believe in the long-term value here.\n\nAnd we appreciate the investors, the shareholders who have stuck with us along this process. To your question of when does it change? Yes, there's a gradual -- there's a momentum, a swelling momentum that I just talked about in the industry and in the marketplace. There are also obviously -- we have a portfolio of minority positions. We've also started, as of FY '24, taking 1% of equity issued from every issuer on our platform. So I believe I'm right in saying I think we have 37 of those small equity positions alongside the 22 portfolio -- what we call portfolio companies.\n\nSo obviously, there's optionality in all of that portfolio, especially as we broaden it now to include everyone who comes through our platform. So any one of those minority positions becoming liquid or getting to the next level is obviously a way that sort of proves out our model to those that don't believe it and generates liquidity for us. In the same way, in the core business, we're talking to some marquee -- what I call, marquee issuers, so folks who would be newsworthy and noteworthy as participants on our platform. So there are sort of -- there are quantum steps that we can take as we progress down this path.\n\nAnd obviously, I can't necessarily predict any of those. But what I can say is that the groundswell of activity in our space is maturing. And as it matures, these are early-stage private companies, it takes a while, but they do get there and some subset of them will be successful, and that's what will drive the value that we're creating.",
  "qa_section": "Operator:Thank you. That concludes our Q&A session. I will now hand the conference back to our host for closing remarks. Please go ahead.\n\nCoreen Kraysler:Thank you for joining, everyone. We really appreciate all your support, and we look forward to speaking with you again soon. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you, everyone. This concludes today's event. You may disconnect at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "source": "motley-fool",
  "word_count": 3310,
  "scraped_at": "2026-01-11T17:55:12.273491",
  "filename": "NCPL_2025_Q1_25e80c.json"
}