{
  "ticker": "NCPL",
  "company": "Netcapital",
  "title": "Netcapital (NCPL) Q4 2024 Earnings Call Transcript",
  "year": 2024,
  "quarter": 4,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/netcapital-ncpl-q4-2024-earnings-call-transcript/",
  "transcript": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nMonday, July 29, 2024 at 10:00 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nThe earnings call highlightedNetcapital(NCPL+6.08%)'s significant year-over-year revenue decline and the shift from operating income to a substantial operating loss, with management directly citing the loss of major consulting contracts and markdowns in equity holdings as core factors. Strategic developments included the rollout of a beta secondary trading platform and a broker-dealer license application to target broader investment offerings through Reg A+ and Reg D, signaling management's focus on platform and fee-based growth despite current challenges. The company emphasized strong growth in funding portal fees, an expanded user base, and deal volume, notably through successful large-scale offerings from clients like Avadain and EarthGrid PBC.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nWith that said, I’d like to now turn to our financial results for the full-year fiscal 2024. Revenues for fiscal 2024 decreased by $3,542,550 or 42% to $4,951,435, compared to $8,493,985 in fiscal 2023. This decline in revenues was mainly due to a decrease in consulting services for equity securities which dropped by $3,665,000 or 52% to $3.44 million in fiscal 2024, as compared to $7.1 million in the previous year. The aggregate decrease of approximately $3.7 million in consulting services for equity securities in fiscal 2024 occurred because we provided consulting services to only three companies in fiscal 2024, as compared to six companies in fiscal 2023.\n\nWe strive to provide more than $1 million worth of consulting services to this type of client. And the average fee that we earned per client in fiscal 2024 and 2023 amounted to $1,146,667 and $1,184,167 respectively. These services are provided by our consulting subsidiary, Netcapital Advisors, and Advisors did not [discern] (ph) any equity securities from consulting work in the fourth quarter of fiscal 2024. Our subsidiary, Netcapital Funding Portal Inc. introduced a 1% fee on the equity raised by issuers using the funding portal. In fiscal 2024, the funding portal earned equity securities from 30 clients with a total value of $97,700, as compared to $0.00 in the previous fiscal year.\n\nOur cost of revenues increased by $23,000 or 27% to approximately $108,000 in fiscal 2024, from approximately $85,000 in fiscal 2023. The increase is attributable to the funding portal which saw a rise in revenue from portal fees to $874,368 in fiscal 2024. We recognized an unrealized loss in the value of our equity securities of approximately $2.7 million in fiscal 2024, as compared to unrealized gains of approximately $1.9 million in the value of our equity securities in fiscal 2023. The loss in fiscal 2024 was attributable to a decrease in value of our 3.2 million shares of KingsCrowd common stock from $1.00 per share to $0.16 per share. We recorded an impairment loss of $1,048,430 in fiscal 2024.\n\nThe loss in fiscal 2024 consists of a reduction in value from $647,264 to $0 for the intangible assets we acquired in the purchase of MSG and a reduction in value from $401,167 to $0 for the intangible assets we own that are associated with the website one-on-one stands. The person who operated MSG retired due to health reasons during fiscal 2024, and we were unsuccessful in transitioning the valuation consulting work performed by MSG to another person. We may continue providing business valuation services in the future, but at this point in time, we cannot attribute any value to the assets we purchased.\n\nSimilarly, the person who was designated to operate our one-on-one fans website left the company in May 2024, and without his expertise and connections with professional hockey players, we determined the value to be $0. Revenues from portal fees increased by $455,855 or 109% year-over-year, to $874,368 from $418,513 in fiscal 2023. The increase in portal fees is attributable to the increase in the amount of capital raised on the Netcapital Funding Portal and the increase in the number of issuers that completed an offering in fiscal 2024 and 2023. The average amount raised in an offering on the Netcapital Funding Portal was $280,978 and $128,170 respectively.\n\nWe had an operating loss of $3,442,388 for the full fiscal 2024 as compared to operating income of $2,271,876 for fiscal 2023 and the net loss for fiscal 2024 of $4,986,317 as compared to $2,954,972 for fiscal 2023. We reported a loss per share of $0.41 in the full-year ended April 30, 2024, which was down compared to earnings per share of $0.63 for the same period in the prior year. As of April 30, 2024, the company had cash and cash equivalents of $863,182. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. And thank you to all shareholders who are taking the time to be on this call today. We saw a challenging economic environment over the year as reflected in the press release filing and the numbers that Coreen recapped, showing decreases in both our top and bottom line. However, there are several important metrics, positive metrics to highlight. Coreen mentioned these, but just to emphasize, the average amount raised in an offering on our platform went up from $128,000 to $280,000 year-over-year. The total number of successful offerings increased from 50 to 53. And in addition, we saw total revenue for portal fees increase by 109%, so more than double.\n\nAnd so, these numbers tell the story that despite the tough environment, we completed more deals on our platform. Our issuers on average raised more capital. And as a result, we saw strong growth in our portal fee revenue compared to 2023. Along those lines, I'd like to highlight two significant deals that were closed by issuers during the year. Avadain, a graphene technology company, successfully sold out their $4.5 million offering after upsizing the offering several times due to strong demand. And the second deal, EarthGrid PBC, a plasma boring technology company, closed a $3.3 million offering. These two deals alone totaled almost $8 million, demonstrating the opportunity for both companies and investors that use our funding portal.\n\nAs of today, we own minority positions in 22 portfolio companies that have utilized the funding portal to facilitate their offerings for which equity was received as a payment for services. And as Coreen mentioned, we added a 1% fee on equity raised by issuers this year and the funding portal earned securities from 30 clients as a result of that move. Looking forward and highlighting some of the strategic priorities for us as a company, we recently announced the launch of the beta version for a secondary trading platform to a closed group of users in collaboration with Templum Markets.\n\nIn September, we began internal testing of this secondary trading platform, which provides access to a registered Alternative Trading System, or an ATS. The Templum ATS is approved in 53 U.S. states and territories and will have the ability to facilitate the trading of unregistered or private equity securities. So, this partnership will provide investors who purchase stock through the Netcapital Funding Portal with the potential for secondary trading and allow for improved liquidity. It will provide issuers with a potential path to a broader pool of retail investors, a way to engage their communities and share in the value they're creating, and also a potential stepping stone on journey to a more traditional public market.\n\nSecond, we also announced that Netcapital has applied for a broker-dealer license for its wholly owned subsidiary, Netcapital Securities. We believe that by having a registered broker-dealer, we may create opportunities to expand our revenue base by hosting and generating additional fees from what are called Reg A+ and Reg D offerings on the Netcapital platform. Under Reg A+ plus, companies can raise up to $75 million from accredited and non-accredited investors every 12 months versus 5 million that permitted under our current Reg CF environment. Additionally, under Reg D 506(c), companies can raise unlimited amounts of capital from accredited investors using general solicitation.\n\nSo, Netcapital remains a competitive scalable platform offering a cost-effective online capital raising solution for a growing network of companies and investors. We continue to strive as innovative leaders in producing what we believe and our customers frequently tell us is the best platform. More than a hundred thousand users and growing, over 50 companies currently in the fundraising process, a healthy but very competitive 4.9% portal fee for capital raised at closing and higher outcomes in money raised per offering all speak to the value we provide in the marketplace. Finally, I'd say that, we are focused on the long-term and not optimizing for short-term results.\n\nOur success depends on our client's success and that usually takes time and patience. As always, thank you for your interest and support of Netcapital. Operator, we are ready for questions.\n\nOperator:Thank you very much. We are now opening the floor for questions.[Operator Instructions]Your first question is coming from Chris Sakai of Singular Research. Chris, your line is live.\n\nChris Sakai:Hi, good morning. Just a question on portal fees and the growth there, what sort of initiatives are you doing to maintain and/or increase that growth?\n\nMartin Kay:Well, as we mentioned, it’s a function of the number of issuers on the platform and the success of those issuers. So, we’re continuing to do the things we always do, which is innovate in the ways in which we connect with new companies that would be a good fit for our platform. And in terms of individual raises, we’re learning from history at this point as to what it takes to be successful on our platforms, and ways in which you can engage in digital marketing activities and engage your community to become investors and owners and ambassadors for those companies.\n\nSo, we expect to continue focusing on those efforts, so targeting newer and potentially bigger issuers, particularly as we move into the Reg A+ business and leveraging the learnings to date as to how to make any given issuer as successful as possible on the platform.\n\nChris Sakai:Okay, thanks. And then you mentioned the ATS platform. Do you have any sort of timeline as far as the progression there?\n\nMartin Kay:Yes, well, as I mentioned we announced the launch of the production -- in a production environment to a closed group of users. We expect to, as I think we said in that press release, to open that up to a broader group of users before the end of this year. But we obviously -- we’re doing something that no one else has done. We’re doing it in partnership with a great company, and that we just want to be careful and make sure that when we do open to everyone, that we provide the experience that folks will expect.\n\nChris Sakai:Okay, great. Thanks for the answers.\n\nOperator:Thank you very much.[Operator Instructions]I am not seeing anyone else coming into queue. No, we don’t have anyone else in the queue at the moment. I will now hand back over to Coreen.\n\nCoreen Kraysler:All right, thank you everyone for joining our call. We really appreciate your support. And we look forward to speaking with you all soon. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you very much. This does conclude today’s conference call. You may disconnect your phone lines at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nMonday, July 29, 2024 at 10:00 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nThe earnings call highlightedNetcapital(NCPL+6.08%)'s significant year-over-year revenue decline and the shift from operating income to a substantial operating loss, with management directly citing the loss of major consulting contracts and markdowns in equity holdings as core factors. Strategic developments included the rollout of a beta secondary trading platform and a broker-dealer license application to target broader investment offerings through Reg A+ and Reg D, signaling management's focus on platform and fee-based growth despite current challenges. The company emphasized strong growth in funding portal fees, an expanded user base, and deal volume, notably through successful large-scale offerings from clients like Avadain and EarthGrid PBC.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nWith that said, I’d like to now turn to our financial results for the full-year fiscal 2024. Revenues for fiscal 2024 decreased by $3,542,550 or 42% to $4,951,435, compared to $8,493,985 in fiscal 2023. This decline in revenues was mainly due to a decrease in consulting services for equity securities which dropped by $3,665,000 or 52% to $3.44 million in fiscal 2024, as compared to $7.1 million in the previous year. The aggregate decrease of approximately $3.7 million in consulting services for equity securities in fiscal 2024 occurred because we provided consulting services to only three companies in fiscal 2024, as compared to six companies in fiscal 2023.\n\nWe strive to provide more than $1 million worth of consulting services to this type of client. And the average fee that we earned per client in fiscal 2024 and 2023 amounted to $1,146,667 and $1,184,167 respectively. These services are provided by our consulting subsidiary, Netcapital Advisors, and Advisors did not [discern] (ph) any equity securities from consulting work in the fourth quarter of fiscal 2024. Our subsidiary, Netcapital Funding Portal Inc. introduced a 1% fee on the equity raised by issuers using the funding portal. In fiscal 2024, the funding portal earned equity securities from 30 clients with a total value of $97,700, as compared to $0.00 in the previous fiscal year.\n\nOur cost of revenues increased by $23,000 or 27% to approximately $108,000 in fiscal 2024, from approximately $85,000 in fiscal 2023. The increase is attributable to the funding portal which saw a rise in revenue from portal fees to $874,368 in fiscal 2024. We recognized an unrealized loss in the value of our equity securities of approximately $2.7 million in fiscal 2024, as compared to unrealized gains of approximately $1.9 million in the value of our equity securities in fiscal 2023. The loss in fiscal 2024 was attributable to a decrease in value of our 3.2 million shares of KingsCrowd common stock from $1.00 per share to $0.16 per share. We recorded an impairment loss of $1,048,430 in fiscal 2024.\n\nThe loss in fiscal 2024 consists of a reduction in value from $647,264 to $0 for the intangible assets we acquired in the purchase of MSG and a reduction in value from $401,167 to $0 for the intangible assets we own that are associated with the website one-on-one stands. The person who operated MSG retired due to health reasons during fiscal 2024, and we were unsuccessful in transitioning the valuation consulting work performed by MSG to another person. We may continue providing business valuation services in the future, but at this point in time, we cannot attribute any value to the assets we purchased.\n\nSimilarly, the person who was designated to operate our one-on-one fans website left the company in May 2024, and without his expertise and connections with professional hockey players, we determined the value to be $0. Revenues from portal fees increased by $455,855 or 109% year-over-year, to $874,368 from $418,513 in fiscal 2023. The increase in portal fees is attributable to the increase in the amount of capital raised on the Netcapital Funding Portal and the increase in the number of issuers that completed an offering in fiscal 2024 and 2023. The average amount raised in an offering on the Netcapital Funding Portal was $280,978 and $128,170 respectively.\n\nWe had an operating loss of $3,442,388 for the full fiscal 2024 as compared to operating income of $2,271,876 for fiscal 2023 and the net loss for fiscal 2024 of $4,986,317 as compared to $2,954,972 for fiscal 2023. We reported a loss per share of $0.41 in the full-year ended April 30, 2024, which was down compared to earnings per share of $0.63 for the same period in the prior year. As of April 30, 2024, the company had cash and cash equivalents of $863,182. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. And thank you to all shareholders who are taking the time to be on this call today. We saw a challenging economic environment over the year as reflected in the press release filing and the numbers that Coreen recapped, showing decreases in both our top and bottom line. However, there are several important metrics, positive metrics to highlight. Coreen mentioned these, but just to emphasize, the average amount raised in an offering on our platform went up from $128,000 to $280,000 year-over-year. The total number of successful offerings increased from 50 to 53. And in addition, we saw total revenue for portal fees increase by 109%, so more than double.\n\nAnd so, these numbers tell the story that despite the tough environment, we completed more deals on our platform. Our issuers on average raised more capital. And as a result, we saw strong growth in our portal fee revenue compared to 2023. Along those lines, I'd like to highlight two significant deals that were closed by issuers during the year. Avadain, a graphene technology company, successfully sold out their $4.5 million offering after upsizing the offering several times due to strong demand. And the second deal, EarthGrid PBC, a plasma boring technology company, closed a $3.3 million offering. These two deals alone totaled almost $8 million, demonstrating the opportunity for both companies and investors that use our funding portal.\n\nAs of today, we own minority positions in 22 portfolio companies that have utilized the funding portal to facilitate their offerings for which equity was received as a payment for services. And as Coreen mentioned, we added a 1% fee on equity raised by issuers this year and the funding portal earned securities from 30 clients as a result of that move. Looking forward and highlighting some of the strategic priorities for us as a company, we recently announced the launch of the beta version for a secondary trading platform to a closed group of users in collaboration with Templum Markets.\n\nIn September, we began internal testing of this secondary trading platform, which provides access to a registered Alternative Trading System, or an ATS. The Templum ATS is approved in 53 U.S. states and territories and will have the ability to facilitate the trading of unregistered or private equity securities. So, this partnership will provide investors who purchase stock through the Netcapital Funding Portal with the potential for secondary trading and allow for improved liquidity. It will provide issuers with a potential path to a broader pool of retail investors, a way to engage their communities and share in the value they're creating, and also a potential stepping stone on journey to a more traditional public market.\n\nSecond, we also announced that Netcapital has applied for a broker-dealer license for its wholly owned subsidiary, Netcapital Securities. We believe that by having a registered broker-dealer, we may create opportunities to expand our revenue base by hosting and generating additional fees from what are called Reg A+ and Reg D offerings on the Netcapital platform. Under Reg A+ plus, companies can raise up to $75 million from accredited and non-accredited investors every 12 months versus 5 million that permitted under our current Reg CF environment. Additionally, under Reg D 506(c), companies can raise unlimited amounts of capital from accredited investors using general solicitation.\n\nSo, Netcapital remains a competitive scalable platform offering a cost-effective online capital raising solution for a growing network of companies and investors. We continue to strive as innovative leaders in producing what we believe and our customers frequently tell us is the best platform. More than a hundred thousand users and growing, over 50 companies currently in the fundraising process, a healthy but very competitive 4.9% portal fee for capital raised at closing and higher outcomes in money raised per offering all speak to the value we provide in the marketplace. Finally, I'd say that, we are focused on the long-term and not optimizing for short-term results.\n\nOur success depends on our client's success and that usually takes time and patience. As always, thank you for your interest and support of Netcapital. Operator, we are ready for questions.\n\nOperator:Thank you very much. We are now opening the floor for questions.[Operator Instructions]Your first question is coming from Chris Sakai of Singular Research. Chris, your line is live.\n\nChris Sakai:Hi, good morning. Just a question on portal fees and the growth there, what sort of initiatives are you doing to maintain and/or increase that growth?\n\nMartin Kay:Well, as we mentioned, it’s a function of the number of issuers on the platform and the success of those issuers. So, we’re continuing to do the things we always do, which is innovate in the ways in which we connect with new companies that would be a good fit for our platform. And in terms of individual raises, we’re learning from history at this point as to what it takes to be successful on our platforms, and ways in which you can engage in digital marketing activities and engage your community to become investors and owners and ambassadors for those companies.\n\nSo, we expect to continue focusing on those efforts, so targeting newer and potentially bigger issuers, particularly as we move into the Reg A+ business and leveraging the learnings to date as to how to make any given issuer as successful as possible on the platform.\n\nChris Sakai:Okay, thanks. And then you mentioned the ATS platform. Do you have any sort of timeline as far as the progression there?\n\nMartin Kay:Yes, well, as I mentioned we announced the launch of the production -- in a production environment to a closed group of users. We expect to, as I think we said in that press release, to open that up to a broader group of users before the end of this year. But we obviously -- we’re doing something that no one else has done. We’re doing it in partnership with a great company, and that we just want to be careful and make sure that when we do open to everyone, that we provide the experience that folks will expect.\n\nChris Sakai:Okay, great. Thanks for the answers.\n\nOperator:Thank you very much.[Operator Instructions]I am not seeing anyone else coming into queue. No, we don’t have anyone else in the queue at the moment. I will now hand back over to Coreen.\n\nCoreen Kraysler:All right, thank you everyone for joining our call. We really appreciate your support. And we look forward to speaking with you all soon. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you very much. This does conclude today’s conference call. You may disconnect your phone lines at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "qa_section": "",
  "source": "motley-fool",
  "word_count": 2075,
  "scraped_at": "2026-01-11T17:55:09.971853",
  "filename": "NCPL_2024_Q4_67abe1.json"
}