{
  "ticker": "NCPL",
  "company": "Netcapital",
  "title": "Netcapital (NCPL) Q2 2026 Earnings Call Transcript",
  "year": 2026,
  "quarter": 2,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/netcapital-ncpl-q2-2026-earnings-call-transcript/",
  "transcript": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nTuesday, December 16, 2025 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTAKEAWAYS\n\nSUMMARY\n\nThe call centered onNetcapital(NCPL+6.08%)'s strategic overhaul, where management articulated plans to grow the business through scalable fintech offerings and entry into the tokenized asset market. Executives addressed shareholder dilution concerns, emphasizing technology acquisitions as essential for executing the new digital asset-focused business model. No revenue has yet been booked from broker-dealer activities, though management signaled this may change imminently. Core operations remained cost-intensive relative to reported revenues, but leadership prioritized investment and infrastructure for future growth instead of workforce reduction.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nCoreen Kraysler:Thank you, Holly. Good morning, everyone, and thank you for joining Netcapital's Second Quarter Fiscal 2026 Financial Results Conference Call. I'm Coreen Kraysler, CFO of Netcapital Inc. I will begin by reviewing our financial results and then our Chief Executive Officer, Rich Wheeless, will share his prepared remarks before we open the Q&A portion of our call. Before we begin, I'd like to remind everyone of the safe harbor disclosure regarding forward-looking information. Management's discussion may include forward-looking statements.\n\nThese statements relate to future events or future financial performance and involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any future results levels of activity, performance or achievements expressed or implied by these forward-looking statements. Any forward-looking statements reflect management's current views with respect to operations, results of operations, growth strategies, liquidity and future events. Netcapital assumes no obligation to publicly update or revise these forward-looking statements for any reason or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future.\n\nWith that said, I'd like to now turn to our financial results for the second quarter fiscal 2026. We reported revenues of approximately $51,000 for the 3 months ended October 31, 2025, and as compared to approximately $170,000 during the 3 months ended October 31, 2024. The decrease in revenues was primarily attributed to a decrease in portal fees during the quarter. I'll add that our revenues can be lumpy quarter-over-quarter, as the timing of large client funding events can have an outsized impact on results. We reported an operating loss of approximately $2.1 million compared to an operating loss of approximately $2.2 million for the second quarter of fiscal year 2025.\n\nWe reported a loss per share of $0.44 compared to a loss per share of $2.34 for the second quarter of fiscal year 2025. As of October 31, 2025, the company had cash and cash equivalents of approximately $1.7 million. I'll now turn the call over to our CEO, Rich Wheeless.\n\nRich Wheeless:Thank you very much, Coreen, and thank you, everybody, for joining the call today. This marks my first call with investors, and I want to start by emphasizing how excited I am to join Netcapital at this pivotal moment in our evolution. Throughout my career, I've been drawing to businesses that use technology to open doors that were previously closed and Netcapital's mission to democratize access to private investments fits up perfectly. I've been involved in the blockchain and crypto industry for numerous years and have had success going back to one of my prior companies, Taal, which we made the ASIC chips for cryptominers.\n\nFor example, in 2018, we were able to raise $33 million in executed on our strategy, which led to a 120% increase in our share price in a 4-month time frame. So given the market size, anticipated growth in the tokenized asset market as well as experience of our team, I do believe that we are very well positioned to be able to be successful with our new strategy and drive value for all shareholders. Quite simply, Netcapital has significant opportunity for revenue enhancement by helping overall small businesses integrate crypto and blockchain into their financing and capital market strategy. The company already has a proven regulated platform that connects entrepreneurs with investors in a simple, transparent way.\n\nAnd I see this as a tremendous opportunity for us to build upon that foundation as we expand into new asset classes and blockchain enablement solutions. I'm really looking forward to working alongside this team and with our issuer and investor communities to make net capital a leading digital ecosystem for founders seeking growth capital and investors looking to participate in the next generation of innovative companies. So I want to spend a few minutes putting our recent results in the context walking through how our strategy has evolved and then talking about where we're focused going forward in emerging market drivers that may be the wind at our backs.\n\nWe are in a transition period, and our second quarter fiscal 2026 revenues continue to be impacted by the fact that we've exited a consorting for equity model that while it's generated revenue just was not scalable in cash terms, it made it harder for investors to see the underlying economics of our business. Against that backdrop, we made the strategic decision to reset of the company around our core fintech platform and our recently licensed broker dealer. Our funding portal is fundamentally a technology business. We have a generally fixed cost platform and a relatively small employee base.\n\nSo when we add more offerings to more volume, those incremental values -- I'm sorry, incremental revenues will follow with attractive incremental margins. That is the kind of operating leverage that we want to see in a fintech model. In parallel, our wholly owned subsidiary Netcapital securities allows us to participate in Reg A capital raises, which are typically larger than Reg CF offerings and a potentially expands the base of issuers and investors we can serve.\n\nSo as we look ahead, the strategy is straightforward: grow volume on a platform that is now structurally more scalable, fully leverage our broker dealer to unlock larger transactions and a broader product set and position the company for emerging opportunities from digital assets and tokenization, which we view as a logical extension of our listing business. We plan to focus on where blockchain generally adds value, which can encompass how security is recorded, how they traded or how liquidity mechanisms are structured. And we always evaluate each opportunity with a long-term lens. How does it create durable value for the company and for shareholders?\n\nAnd can it be executed in a way that is consistent within the requisite regulatory framework? Lastly, I'll touch on the macro environment and why I'm very excited about the timeliness of our push in our position for success. There is an emerging new category for U.S.-compliant utility token sales that we believe is decentralizing token ownership and seeding long-term network growth. For example, Coinbase MONA token sale last month in November demonstrated strong pent-up demand for U.S. retail tech patient and utility to open offerings. $269 million was raised from 86,000 buyers and less than 24 hours. This was not just a speculation, but it was rather it was a clear market signal.\n\nWith our position as a broker-dealer and deep regulatory expertise, we have a compliant bridge between global token to systems and U.S. retail investors. This new category has a potential for high-margin revenue streams on top of our current business. And a single successful token sale may generate revenue discount to dozens of our regular traditional Reg CF offerings with a similar compliance lift but higher margins. In addition, with 100,000 U.S. investors in our network and over 300 companies that we successfully funded. We have the foundation and a track record to succeed in this market. And with all that being said, we'll open the call up for Q&A.\n\nOperator:[Operator Instructions]. Your first question for today is from Todd Oberle with Insight Investments.\n\nTodd Oberle:Hello. Can you hear me, Rich?\n\nRich Wheeless:Yes.\n\nTodd Oberle:So regarding this past quarter, I know you're newly hired CEO, but there was $51,000 in revenues across what I believe is 20-something employees. I've seen that 20-something reference in the past. And -- so maybe give me your outlook on what's the right employee count considering there's almost 0 revenues in this company and not understand how they justified so many employees for so long when there's the revenue being generated. So a question on -- and the second question is similar to that, and there's been a issued a broker-dealer license for, I think, around a year for the company? And has there been any revenue at all from Reg A offerings to this point?\n\nRich Wheeless:Yes, I can -- yes. So in terms of the first one, we're focused on the pivot we have. The regulatory market is very positive right now, and we will look to execute on this new strategy that we've laid out. I'm not too worried about what's really happened in the past, the companies now in a great position and very excited for where we can be. So I'm not so focused. I'm not worried about where we were prior is as well because we've made a bit of a pivot in when you make pivots -- in the short term, revenue will kind of struggle in we'll do that.\n\nCoreen Kraysler:I'm going to jump in here. This is Coreen Kraysler, I'm the CFO. Regarding your question about the broker-dealer I would point to -- I think you should look at the quarter that we will report next and it wouldn't surprise me if you saw revenues from the broker-dealer in that quarter.\n\nTodd Oberle:Okay. So there's been no revenues to this point? Is that how I can take it from a broker dealer?\n\nCoreen Kraysler:I'm going to reiterate the answer that I just gave you.\n\nTodd Oberle:And then I guess in terms of the employee count, so I guess the takeaway is employee kind of is going to stay the same? I know that past is in the past, but going forward, what is the right number considering the size of the company, the cash balance, the cash burn?\n\nCoreen Kraysler:So I'm currently -- reiterate what Rich said, which is we're very much focused on our new strategy in generating revenues. You can't cost cut your way to growth. So our focus -- we're very excited about the new model. And as Rich mentioned, the regulatory environment for tokenized assets is appears to be favorable right now. So we are excited about that. We'd also ask people in the queue for questions. So please limit your question to one question plus one follow-up. Operator, can we move to the next person in queue, please?\n\nOperator:Certainly. Your next question is from Emily McAllen, a private investor.\n\nUnknown Attendee:I would like this question to the new CEO, Rich. And I am just curious how it is justified to give away 20% of the outstanding share count for a defunct software business. I'm just a little puzzled here. I'd like Rich to answer that.\n\nRich Wheeless:In short, look, it helps. I appreciate the question. This helps along with our new strategy with the tokenized asset model to help us to be able to execute on that strategy. We would not have done this if it did not make sense for our overall plan. So I would ask -- give us a little bit of time and appreciate everyone's patience on this and there is a plan and path forward that we plan on executing, and I look forward to executing.\n\nUnknown Attendee:What is the plan? Please elaborate. That was pretty vague.\n\nRich Wheeless:Yes, we're going to get more in the coming days, but there is a strategy laid out that we are doubling down on the tokenized asset market, which I had mentioned and alluded to earlier in the call and utilizing our existing platform that we do have the crowd funding platform in our broker-dealer as well. And we continue to look for existing technologies and pieces that fit in place to execute on that strategy.\n\nUnknown Attendee:So giving away 100% of the shares is for -- a justified for a defunct business?\n\nCoreen Kraysler:Excuse me, Emily, I'm going to answer your question for you and follow on to what Rich said. So I'm assuming that you're referring to Rivetz and what Rivetz brings to the table...\n\nUnknown Attendee:Correct.\n\nCoreen Kraysler:Yes. Okay. So what Rivetz brings to the table is both expertise and code plus the system platform and technology stack to produce tokenized assets in a safe and secure manner in a safe and secure manner. So that is why we bought Rivetz. We feel that it's very key to our ability to execute our strategy shift to tokenizes assets moving forward.\n\nUnknown Attendee:So what was Horizon purchase for the? Because I thought that was similar.\n\nCoreen Kraysler:I'm sorry, I couldn't hear your question.\n\nUnknown Attendee:I said, so what was the Horizon software purchase for them because I thought that was the purpose of Horizon and you guys gave away 20% of the outstanding shares at that time back in June.\n\nCoreen Kraysler:Jason, do you have a response to that?\n\nJason Frishman:Yes. My understanding is that both Horizon and Rivetz will work together as part of this pivot, but I would defer to Rich on that. And I would also point out that I understand that roughly 20% of the stock is a large number but also when you understand the market cap of the company and the company has identified acquisitions that the company believes is critical to the future. The market cap of the company is -- makes it difficult to do those transactions without a larger percent of the company.\n\nOperator:There are no further questions in queue. We do have a question from John Davis.\n\nUnknown Attendee:Just curious how -- going back to, I think, what the previous person asked is the auditors have to justify this acquisition and also NASDAQ flags is, which is probable. You also have to justify that and the others will have to justify that. Can you walk us through how you justify the defunct 2021 company in acquiring this because it should have -- since it's been defunct since 2021, they should have been incredibly inexpensive. Because there was clearly no bidders on it. So how did the auditors justify this from a GAAP accounting and that you can present to NASDAQ to prove that it was worth its value.\n\nRich Wheeless:So let me just add in there, it fits some with our overall strategy with what we're looking to do. I'm looking forward to where we're going to go with this company going forward, and I love the technology personally. I'm briefed -- I understand how this fits in with our overall plan. And sometimes you got to pay a little bit for a very good technology, and there's -- and it fits in with what we're looking to do. That's the best I can answer that in terms of -- I know it doesn't exactly address what you're saying in terms of the auditors now that pieces related to that.\n\nCoreen Kraysler:I would just add that this technology is quite critical to our strategy moving forward. And in terms of total dollars paid, it was not that much money.\n\nOperator:There are no further questions in queue.\n\nCoreen Kraysler:Rich, do you want to sum up, please?\n\nRich Wheeless:Yes, sure. Yes. So thank you -- that concludes our -- sorry about that -- thank you, operator. To sum it up, based that our mission has not changed. We're here to democratize access to private capital markets for issues on net growth capital and for investors who want access to opportunities that have historically been hard to reach. everything that we're doing from product innovation to selective blockchain integration to the pursuit of larger rig at transactions is aimed at building a more opening, efficient and scalable private market ecosystem. We have made investments in the vital infrastructure and team to execute a strong growth plan in calendar year 2026 and beyond.\n\nWe have already repositioned that capital around a more scalable combination of a funding portal and a broker-dealer, we are laser-focused on leveraging these advantages towards profitability. I look forward to work with investors, clients, employees and government to create value, and drive the company's future direction and updating you on our progress in the coming months and on our next call in March. And once again, thank you to everyone who's joined today. We appreciate your continued interest and support of Netcapital. Have an amazing day.\n\nOperator:Thank you. This concludes today's conference call. You may disconnect your phone lines at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nTuesday, December 16, 2025 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nTAKEAWAYS\n\nSUMMARY\n\nThe call centered onNetcapital(NCPL+6.08%)'s strategic overhaul, where management articulated plans to grow the business through scalable fintech offerings and entry into the tokenized asset market. Executives addressed shareholder dilution concerns, emphasizing technology acquisitions as essential for executing the new digital asset-focused business model. No revenue has yet been booked from broker-dealer activities, though management signaled this may change imminently. Core operations remained cost-intensive relative to reported revenues, but leadership prioritized investment and infrastructure for future growth instead of workforce reduction.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript",
  "qa_section": "Coreen Kraysler:Thank you, Holly. Good morning, everyone, and thank you for joining Netcapital's Second Quarter Fiscal 2026 Financial Results Conference Call. I'm Coreen Kraysler, CFO of Netcapital Inc. I will begin by reviewing our financial results and then our Chief Executive Officer, Rich Wheeless, will share his prepared remarks before we open the Q&A portion of our call. Before we begin, I'd like to remind everyone of the safe harbor disclosure regarding forward-looking information. Management's discussion may include forward-looking statements.\n\nThese statements relate to future events or future financial performance and involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any future results levels of activity, performance or achievements expressed or implied by these forward-looking statements. Any forward-looking statements reflect management's current views with respect to operations, results of operations, growth strategies, liquidity and future events. Netcapital assumes no obligation to publicly update or revise these forward-looking statements for any reason or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future.\n\nWith that said, I'd like to now turn to our financial results for the second quarter fiscal 2026. We reported revenues of approximately $51,000 for the 3 months ended October 31, 2025, and as compared to approximately $170,000 during the 3 months ended October 31, 2024. The decrease in revenues was primarily attributed to a decrease in portal fees during the quarter. I'll add that our revenues can be lumpy quarter-over-quarter, as the timing of large client funding events can have an outsized impact on results. We reported an operating loss of approximately $2.1 million compared to an operating loss of approximately $2.2 million for the second quarter of fiscal year 2025.\n\nWe reported a loss per share of $0.44 compared to a loss per share of $2.34 for the second quarter of fiscal year 2025. As of October 31, 2025, the company had cash and cash equivalents of approximately $1.7 million. I'll now turn the call over to our CEO, Rich Wheeless.\n\nRich Wheeless:Thank you very much, Coreen, and thank you, everybody, for joining the call today. This marks my first call with investors, and I want to start by emphasizing how excited I am to join Netcapital at this pivotal moment in our evolution. Throughout my career, I've been drawing to businesses that use technology to open doors that were previously closed and Netcapital's mission to democratize access to private investments fits up perfectly. I've been involved in the blockchain and crypto industry for numerous years and have had success going back to one of my prior companies, Taal, which we made the ASIC chips for cryptominers.\n\nFor example, in 2018, we were able to raise $33 million in executed on our strategy, which led to a 120% increase in our share price in a 4-month time frame. So given the market size, anticipated growth in the tokenized asset market as well as experience of our team, I do believe that we are very well positioned to be able to be successful with our new strategy and drive value for all shareholders. Quite simply, Netcapital has significant opportunity for revenue enhancement by helping overall small businesses integrate crypto and blockchain into their financing and capital market strategy. The company already has a proven regulated platform that connects entrepreneurs with investors in a simple, transparent way.\n\nAnd I see this as a tremendous opportunity for us to build upon that foundation as we expand into new asset classes and blockchain enablement solutions. I'm really looking forward to working alongside this team and with our issuer and investor communities to make net capital a leading digital ecosystem for founders seeking growth capital and investors looking to participate in the next generation of innovative companies. So I want to spend a few minutes putting our recent results in the context walking through how our strategy has evolved and then talking about where we're focused going forward in emerging market drivers that may be the wind at our backs.\n\nWe are in a transition period, and our second quarter fiscal 2026 revenues continue to be impacted by the fact that we've exited a consorting for equity model that while it's generated revenue just was not scalable in cash terms, it made it harder for investors to see the underlying economics of our business. Against that backdrop, we made the strategic decision to reset of the company around our core fintech platform and our recently licensed broker dealer. Our funding portal is fundamentally a technology business. We have a generally fixed cost platform and a relatively small employee base.\n\nSo when we add more offerings to more volume, those incremental values -- I'm sorry, incremental revenues will follow with attractive incremental margins. That is the kind of operating leverage that we want to see in a fintech model. In parallel, our wholly owned subsidiary Netcapital securities allows us to participate in Reg A capital raises, which are typically larger than Reg CF offerings and a potentially expands the base of issuers and investors we can serve.\n\nSo as we look ahead, the strategy is straightforward: grow volume on a platform that is now structurally more scalable, fully leverage our broker dealer to unlock larger transactions and a broader product set and position the company for emerging opportunities from digital assets and tokenization, which we view as a logical extension of our listing business. We plan to focus on where blockchain generally adds value, which can encompass how security is recorded, how they traded or how liquidity mechanisms are structured. And we always evaluate each opportunity with a long-term lens. How does it create durable value for the company and for shareholders?\n\nAnd can it be executed in a way that is consistent within the requisite regulatory framework? Lastly, I'll touch on the macro environment and why I'm very excited about the timeliness of our push in our position for success. There is an emerging new category for U.S.-compliant utility token sales that we believe is decentralizing token ownership and seeding long-term network growth. For example, Coinbase MONA token sale last month in November demonstrated strong pent-up demand for U.S. retail tech patient and utility to open offerings. $269 million was raised from 86,000 buyers and less than 24 hours. This was not just a speculation, but it was rather it was a clear market signal.\n\nWith our position as a broker-dealer and deep regulatory expertise, we have a compliant bridge between global token to systems and U.S. retail investors. This new category has a potential for high-margin revenue streams on top of our current business. And a single successful token sale may generate revenue discount to dozens of our regular traditional Reg CF offerings with a similar compliance lift but higher margins. In addition, with 100,000 U.S. investors in our network and over 300 companies that we successfully funded. We have the foundation and a track record to succeed in this market. And with all that being said, we'll open the call up for Q&A.\n\nOperator:[Operator Instructions]. Your first question for today is from Todd Oberle with Insight Investments.\n\nTodd Oberle:Hello. Can you hear me, Rich?\n\nRich Wheeless:Yes.\n\nTodd Oberle:So regarding this past quarter, I know you're newly hired CEO, but there was $51,000 in revenues across what I believe is 20-something employees. I've seen that 20-something reference in the past. And -- so maybe give me your outlook on what's the right employee count considering there's almost 0 revenues in this company and not understand how they justified so many employees for so long when there's the revenue being generated. So a question on -- and the second question is similar to that, and there's been a issued a broker-dealer license for, I think, around a year for the company? And has there been any revenue at all from Reg A offerings to this point?\n\nRich Wheeless:Yes, I can -- yes. So in terms of the first one, we're focused on the pivot we have. The regulatory market is very positive right now, and we will look to execute on this new strategy that we've laid out. I'm not too worried about what's really happened in the past, the companies now in a great position and very excited for where we can be. So I'm not so focused. I'm not worried about where we were prior is as well because we've made a bit of a pivot in when you make pivots -- in the short term, revenue will kind of struggle in we'll do that.\n\nCoreen Kraysler:I'm going to jump in here. This is Coreen Kraysler, I'm the CFO. Regarding your question about the broker-dealer I would point to -- I think you should look at the quarter that we will report next and it wouldn't surprise me if you saw revenues from the broker-dealer in that quarter.\n\nTodd Oberle:Okay. So there's been no revenues to this point? Is that how I can take it from a broker dealer?\n\nCoreen Kraysler:I'm going to reiterate the answer that I just gave you.\n\nTodd Oberle:And then I guess in terms of the employee count, so I guess the takeaway is employee kind of is going to stay the same? I know that past is in the past, but going forward, what is the right number considering the size of the company, the cash balance, the cash burn?\n\nCoreen Kraysler:So I'm currently -- reiterate what Rich said, which is we're very much focused on our new strategy in generating revenues. You can't cost cut your way to growth. So our focus -- we're very excited about the new model. And as Rich mentioned, the regulatory environment for tokenized assets is appears to be favorable right now. So we are excited about that. We'd also ask people in the queue for questions. So please limit your question to one question plus one follow-up. Operator, can we move to the next person in queue, please?\n\nOperator:Certainly. Your next question is from Emily McAllen, a private investor.\n\nUnknown Attendee:I would like this question to the new CEO, Rich. And I am just curious how it is justified to give away 20% of the outstanding share count for a defunct software business. I'm just a little puzzled here. I'd like Rich to answer that.\n\nRich Wheeless:In short, look, it helps. I appreciate the question. This helps along with our new strategy with the tokenized asset model to help us to be able to execute on that strategy. We would not have done this if it did not make sense for our overall plan. So I would ask -- give us a little bit of time and appreciate everyone's patience on this and there is a plan and path forward that we plan on executing, and I look forward to executing.\n\nUnknown Attendee:What is the plan? Please elaborate. That was pretty vague.\n\nRich Wheeless:Yes, we're going to get more in the coming days, but there is a strategy laid out that we are doubling down on the tokenized asset market, which I had mentioned and alluded to earlier in the call and utilizing our existing platform that we do have the crowd funding platform in our broker-dealer as well. And we continue to look for existing technologies and pieces that fit in place to execute on that strategy.\n\nUnknown Attendee:So giving away 100% of the shares is for -- a justified for a defunct business?\n\nCoreen Kraysler:Excuse me, Emily, I'm going to answer your question for you and follow on to what Rich said. So I'm assuming that you're referring to Rivetz and what Rivetz brings to the table...\n\nUnknown Attendee:Correct.\n\nCoreen Kraysler:Yes. Okay. So what Rivetz brings to the table is both expertise and code plus the system platform and technology stack to produce tokenized assets in a safe and secure manner in a safe and secure manner. So that is why we bought Rivetz. We feel that it's very key to our ability to execute our strategy shift to tokenizes assets moving forward.\n\nUnknown Attendee:So what was Horizon purchase for the? Because I thought that was similar.\n\nCoreen Kraysler:I'm sorry, I couldn't hear your question.\n\nUnknown Attendee:I said, so what was the Horizon software purchase for them because I thought that was the purpose of Horizon and you guys gave away 20% of the outstanding shares at that time back in June.\n\nCoreen Kraysler:Jason, do you have a response to that?\n\nJason Frishman:Yes. My understanding is that both Horizon and Rivetz will work together as part of this pivot, but I would defer to Rich on that. And I would also point out that I understand that roughly 20% of the stock is a large number but also when you understand the market cap of the company and the company has identified acquisitions that the company believes is critical to the future. The market cap of the company is -- makes it difficult to do those transactions without a larger percent of the company.\n\nOperator:There are no further questions in queue. We do have a question from John Davis.\n\nUnknown Attendee:Just curious how -- going back to, I think, what the previous person asked is the auditors have to justify this acquisition and also NASDAQ flags is, which is probable. You also have to justify that and the others will have to justify that. Can you walk us through how you justify the defunct 2021 company in acquiring this because it should have -- since it's been defunct since 2021, they should have been incredibly inexpensive. Because there was clearly no bidders on it. So how did the auditors justify this from a GAAP accounting and that you can present to NASDAQ to prove that it was worth its value.\n\nRich Wheeless:So let me just add in there, it fits some with our overall strategy with what we're looking to do. I'm looking forward to where we're going to go with this company going forward, and I love the technology personally. I'm briefed -- I understand how this fits in with our overall plan. And sometimes you got to pay a little bit for a very good technology, and there's -- and it fits in with what we're looking to do. That's the best I can answer that in terms of -- I know it doesn't exactly address what you're saying in terms of the auditors now that pieces related to that.\n\nCoreen Kraysler:I would just add that this technology is quite critical to our strategy moving forward. And in terms of total dollars paid, it was not that much money.\n\nOperator:There are no further questions in queue.\n\nCoreen Kraysler:Rich, do you want to sum up, please?\n\nRich Wheeless:Yes, sure. Yes. So thank you -- that concludes our -- sorry about that -- thank you, operator. To sum it up, based that our mission has not changed. We're here to democratize access to private capital markets for issues on net growth capital and for investors who want access to opportunities that have historically been hard to reach. everything that we're doing from product innovation to selective blockchain integration to the pursuit of larger rig at transactions is aimed at building a more opening, efficient and scalable private market ecosystem. We have made investments in the vital infrastructure and team to execute a strong growth plan in calendar year 2026 and beyond.\n\nWe have already repositioned that capital around a more scalable combination of a funding portal and a broker-dealer, we are laser-focused on leveraging these advantages towards profitability. I look forward to work with investors, clients, employees and government to create value, and drive the company's future direction and updating you on our progress in the coming months and on our next call in March. And once again, thank you to everyone who's joined today. We appreciate your continued interest and support of Netcapital. Have an amazing day.\n\nOperator:Thank you. This concludes today's conference call. You may disconnect your phone lines at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "source": "motley-fool",
  "word_count": 2977,
  "scraped_at": "2026-01-11T17:55:17.428389",
  "filename": "NCPL_2026_Q2_fda0b3.json"
}