{
  "ticker": "NCPL",
  "company": "Netcapital",
  "title": "Netcapital (NCPL) Q2 2025 Earnings Call Transcript",
  "year": 2025,
  "quarter": 2,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/netcapital-ncpl-q2-2025-earnings-call-transcript/",
  "transcript": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nTuesday, December 17, 2024 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nTAKEAWAYS\n\nSUMMARY\n\nNetcapital(NCPL+6.08%)reported a sharp revenue contraction and reversal into operating losses, driven by the cessation of equity-based consulting revenue, and did not provide explicit guidance or granular revenue visibility for new initiatives. The company secured regulatory approval for its broker-dealer subsidiary, positioning itself to pursue expanded private placement and syndication activities, but management withheld specific financial targets or timelines tied to these opportunities. Meanwhile, the company indicated that the anticipated launch of secondary trading functionality on the Templum ATS platform remains delayed due to ongoing regulatory issues, with no formal launch guidance given.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nCoreen Kraysler:Thank you, Matthew. Good morning, everyone, and thank you for joining Netcapital's Second Quarter Fiscal 2025 Financial Results Conference Call. I'm Coreen Kraysler, CFO of Netcapital Inc. I will begin by reviewing our financial results and then our Chief Executive Officer, Martin Kay, will share his prepared remarks before we open up the Q&A portion of our call. Before we begin, I'd like to remind everyone of the safe harbor disclosure regarding forward-looking information. Management's discussion may include forward-looking statements.\n\nThese statements relate to future events or future financial performance and involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements. Any forward-looking statements reflect management's current views with respect to operations, results of operations, growth strategy, liquidity and future events. Netcapital assumes no obligation to publicly update or revise these forward-looking statements for any reason or to update the reasons. Actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future.\n\nWith that said, I'd like to now turn to our financial results for the second quarter fiscal 2025. Revenues for Q2 fiscal 2025 for the period ended October 31, 2024, decreased by approximately $1.9 million or approximately 92% to $170,528 as compared to approximately $2.04 million in Q2 fiscal 2024. The decline in revenues was driven -- was attributed to the lack of consulting service revenue in Q2 2025 as compared to revenue of approximately of $1.5 million for consulting services for equity securities and $62,000 for consulting revenue in Q2 2024.\n\nI'm pleased to report that as of November 22, 2024, we received approval from FINRA for our broker-dealer subsidiary, which will be a focus for the company moving forward. We reported an operating loss of $2.2 million approximately for the second quarter fiscal 2025 as compared to an operating profit of $52,220 for the second quarter fiscal 2024. Our net loss for the second quarter fiscal 2025 was approximately $2,220,501 as compared to a net profit of approximately $339,616 for the same period in the prior year. We reported a loss per share of $2.34 for the second quarter ended October 31, 2024, compared to earnings per share of $2.52 for the same period in the prior year.\n\nAs of October 31, 2024, the company had cash and cash equivalents of $1,346,739. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. I'd like to also thank everyone for being on this call today and for your interest and support of Netcapital. As Coreen mentioned, during the quarter, we saw a decrease in revenue, primarily due to the shift away from what is primarily noncash consulting service revenue. So with our focus on the broker-dealer subsidiary, we believe that we will see greater potential and value added in that area. And as such, we've not been pursuing equity-based revenue contracts. Recently, as Coreen mentioned, we were pleased to announce that our wholly owned subsidiary, Netcapital Securities, Inc., had received approval from the Financial Industry Regulatory Authority, or FINRA, to become a FINRA member broker-dealer.\n\nThis marks a significant achievement for the company and it begins to open new opportunities for more revenue streams. We believe that by having Netcapital Securities, Inc. as registered broker-dealer, it could create new opportunities to expand the company's revenue base by hosting and generating additional fees from Reg A and Reg D offerings on the Netcapital platform. This positions the company to support larger fundraises and potentially expand the range of investment opportunities available to its investor base.\n\nOur broker-dealer license allows us to conduct private placements of securities and referral business, support companies raising equity capital, as I mentioned, under Regulation A and Regulation D; partner with other broker-dealers to syndicate deals; charge fees on capital raised under Reg A and Reg D as well as enter into fee sharing agreements with other broker-dealers. Thank you for your continued interest and support of Netcapital, and we look forward to keeping you informed of our progress. Operator, we're ready for questions.\n\nOperator:[Operator Instructions]Your first question is coming from Kal Malhi from BullRun Capital.\n\nKal Malhi:Hello. Who is this?\n\nMartin Kay:You have Martin Kay, the CEO; and Coreen Kraysler, our CFO.\n\nKal Malhi:Okay. Martin, I'm an investor, and I'm also -- I do a lot of start-ups, and we looked at crowd funding or what have you. But more so, I'm curious to see what is your capital structure. I know online, it says you've got a limited number of shares, but you guys trade crazy volumes based on what you have. Can you kind of provide an update on what that structure is?\n\nMartin Kay:It's all common stock. I mean there's nothing really complex about it. We're -- we trade on NASDAQ, and we have a pretty diversified shareholder base and not uncommon for that to trade large volumes periodically.\n\nKal Malhi:How many shares are outstanding now?\n\nMartin Kay:I think we -- I'll defer to Coreen, but I think it's approximately 1.8 million shares outstanding.\n\nKal Malhi:Okay. And then you have a number of warrants or what have you. What are the cheapest warrants that are out there and how many are out?\n\nMartin Kay:I don't know, Coreen, if you have that in front of you.\n\nCoreen Kraysler:I don't have that in front of me.\n\nKal Malhi:Okay. And what's your net assets right now? I know you have a number of investments in other companies. What would you say your net asset value is?\n\nMartin Kay:Well, if you're talking about the portfolio of equity securities, and we talked about the business we had been in of taking equity in return for consulting services, that portfolio of equity positions is, I believe, on the balance sheet we just disclosed is a little over $25 million worth of net asset value in those equity positions.\n\nKal Malhi:And what's your cash position and payables or liabilities?\n\nMartin Kay:Again, cash and cash equivalents at the end of the quarter, a little over $1.3 million.\n\nCoreen Kraysler:And we're going to have to move on to the next questioner after this.\n\nOperator:Your next question is coming from Chris Sakai from Singular Research.\n\nJoichi Sakai:Just really wanted to get a sense and idea of what differentiates Netcapital Securities from other broker-dealers.\n\nMartin Kay:Well, there's a number of things. Obviously, as we talked about the ability to support Reg A fundraising through the existing Netcapital platform where we've already built out an ecosystem and a marketplace that brings investors and other issuers together, obviously, creates a platform and an environment that is unique to the sort of equity crowd funding industry versus traditional broker-dealer activities. So in other words, we already -- we have -- and we've disclosed over 115,000 investor accounts, and we have robust relationships with digital marketing providers and the team internally that understands how to bring the right investors to the right deal in this way and in this model, which is relatively unique.\n\nObviously, we have competitors -- a few competitors in our space, but it's not the traditional broker-dealer business.\n\nJoichi Sakai:Okay. And also, does this new registration for broker-dealer, does that provide any revenue visibility? Can you see any revenue streams, new revenue streams from that? And what -- about how much would that be, do you think?\n\nMartin Kay:Well, we haven't disclosed specifically what that -- forecast. That's not what we do. But as we discussed in our remarks, we -- it certainly opens up the potential for new revenue streams. For example, we -- Reg A, as I'm sure you know, allows issuers to raise a greater amount up to $75 million in a 12-month period versus $5 million under Reg CF exemption. So that much larger raise. And as a broker-dealer, we are now able to structure a fee arrangement that is likely a percentage of that as opposed to some sort of flat fee. So that obviously is something that we plan to pursue.\n\nJoichi Sakai:Do you see any large deals like that coming up?\n\nMartin Kay:Well, again, we haven't disclosed specifics of deals that we're pursuing, but safe to assume that, again, we are out in the marketplace talking to issuers all the time and have been -- we've had almost 300 companies successfully raised on our platform. Many of those have gone on to raise additional rounds of capital and are obviously candidates also for Reg A. So yes, we're in active discussions and have been for some time with companies who'd like to raise more capital than they can under Reg CF exemption.\n\nOperator:Your next question is coming from John Gilliam from Point Clear Strategic Capital.\n\nJohn Gilliam:Yes, last quarter, you indicated that you expected the Templum ATS exchange to open up from the beta to a full launch in the quarter ended this month. And I want to just get an update there if it's still expected to launch in '24.\n\nMartin Kay:Well, what I can say and what we've said, I think, previously is the technical and product build-out is complete, as you mentioned, in partnership with the Templum ATS. But I think it's safe to say we're still working through some details of the regulatory framework governing secondary exchanges. And it's really important to us to make sure that we don't roll out or open up to everyone a capability that we're still wanting to get to be exactly right. So we're still working on that.\n\nAnd again, I think it's prudent for us to not do anything before we feel 100% comfortable that we have the best product experience and that we have -- that we're operating within the regulatory framework in a way that we need to. So again, we haven't really talked or disclosed official timeline for launching that secondary transfer functionality, but that's all I can say at this point.\n\nJohn Gilliam:Well, on the prior call, you did mention you thought it would be in the year -- the calendar year ended '24. Are you feeling like that's kind of pushed into in the past -- the end of Q3 into Q4?\n\nMartin Kay:I think that's right.\n\nJohn Gilliam:How far out do you think we're looking?\n\nMartin Kay:Again, I don't think I can confidently predict that at this point.\n\nOperator:That concludes our Q&A session. I'll now hand the conference back to CFO, Coreen Kraysler, for closing remarks. Please go ahead.\n\nCoreen Kraysler:Thank you, everyone, for joining our call today. We really appreciate you as shareholders and potential shareholders. We are excited about the prospects ahead for our new broker-dealer subsidiary and wish you all a wonderful holiday season. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you everyone. This concludes today's event. You may disconnect at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NASDAQ:NCPL\n\nNetcapital\n\nImage source: The Motley Fool.\n\nDATE\n\nTuesday, December 17, 2024 at 10 a.m. ET\n\nCALL PARTICIPANTS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nTAKEAWAYS\n\nSUMMARY\n\nNetcapital(NCPL+6.08%)reported a sharp revenue contraction and reversal into operating losses, driven by the cessation of equity-based consulting revenue, and did not provide explicit guidance or granular revenue visibility for new initiatives. The company secured regulatory approval for its broker-dealer subsidiary, positioning itself to pursue expanded private placement and syndication activities, but management withheld specific financial targets or timelines tied to these opportunities. Meanwhile, the company indicated that the anticipated launch of secondary trading functionality on the Templum ATS platform remains delayed due to ongoing regulatory issues, with no formal launch guidance given.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript",
  "qa_section": "Coreen Kraysler:Thank you, Matthew. Good morning, everyone, and thank you for joining Netcapital's Second Quarter Fiscal 2025 Financial Results Conference Call. I'm Coreen Kraysler, CFO of Netcapital Inc. I will begin by reviewing our financial results and then our Chief Executive Officer, Martin Kay, will share his prepared remarks before we open up the Q&A portion of our call. Before we begin, I'd like to remind everyone of the safe harbor disclosure regarding forward-looking information. Management's discussion may include forward-looking statements.\n\nThese statements relate to future events or future financial performance and involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements. Any forward-looking statements reflect management's current views with respect to operations, results of operations, growth strategy, liquidity and future events. Netcapital assumes no obligation to publicly update or revise these forward-looking statements for any reason or to update the reasons. Actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future.\n\nWith that said, I'd like to now turn to our financial results for the second quarter fiscal 2025. Revenues for Q2 fiscal 2025 for the period ended October 31, 2024, decreased by approximately $1.9 million or approximately 92% to $170,528 as compared to approximately $2.04 million in Q2 fiscal 2024. The decline in revenues was driven -- was attributed to the lack of consulting service revenue in Q2 2025 as compared to revenue of approximately of $1.5 million for consulting services for equity securities and $62,000 for consulting revenue in Q2 2024.\n\nI'm pleased to report that as of November 22, 2024, we received approval from FINRA for our broker-dealer subsidiary, which will be a focus for the company moving forward. We reported an operating loss of $2.2 million approximately for the second quarter fiscal 2025 as compared to an operating profit of $52,220 for the second quarter fiscal 2024. Our net loss for the second quarter fiscal 2025 was approximately $2,220,501 as compared to a net profit of approximately $339,616 for the same period in the prior year. We reported a loss per share of $2.34 for the second quarter ended October 31, 2024, compared to earnings per share of $2.52 for the same period in the prior year.\n\nAs of October 31, 2024, the company had cash and cash equivalents of $1,346,739. I'll now turn the call over to our CEO, Martin Kay.\n\nMartin Kay:Thank you, Coreen. I'd like to also thank everyone for being on this call today and for your interest and support of Netcapital. As Coreen mentioned, during the quarter, we saw a decrease in revenue, primarily due to the shift away from what is primarily noncash consulting service revenue. So with our focus on the broker-dealer subsidiary, we believe that we will see greater potential and value added in that area. And as such, we've not been pursuing equity-based revenue contracts. Recently, as Coreen mentioned, we were pleased to announce that our wholly owned subsidiary, Netcapital Securities, Inc., had received approval from the Financial Industry Regulatory Authority, or FINRA, to become a FINRA member broker-dealer.\n\nThis marks a significant achievement for the company and it begins to open new opportunities for more revenue streams. We believe that by having Netcapital Securities, Inc. as registered broker-dealer, it could create new opportunities to expand the company's revenue base by hosting and generating additional fees from Reg A and Reg D offerings on the Netcapital platform. This positions the company to support larger fundraises and potentially expand the range of investment opportunities available to its investor base.\n\nOur broker-dealer license allows us to conduct private placements of securities and referral business, support companies raising equity capital, as I mentioned, under Regulation A and Regulation D; partner with other broker-dealers to syndicate deals; charge fees on capital raised under Reg A and Reg D as well as enter into fee sharing agreements with other broker-dealers. Thank you for your continued interest and support of Netcapital, and we look forward to keeping you informed of our progress. Operator, we're ready for questions.\n\nOperator:[Operator Instructions]Your first question is coming from Kal Malhi from BullRun Capital.\n\nKal Malhi:Hello. Who is this?\n\nMartin Kay:You have Martin Kay, the CEO; and Coreen Kraysler, our CFO.\n\nKal Malhi:Okay. Martin, I'm an investor, and I'm also -- I do a lot of start-ups, and we looked at crowd funding or what have you. But more so, I'm curious to see what is your capital structure. I know online, it says you've got a limited number of shares, but you guys trade crazy volumes based on what you have. Can you kind of provide an update on what that structure is?\n\nMartin Kay:It's all common stock. I mean there's nothing really complex about it. We're -- we trade on NASDAQ, and we have a pretty diversified shareholder base and not uncommon for that to trade large volumes periodically.\n\nKal Malhi:How many shares are outstanding now?\n\nMartin Kay:I think we -- I'll defer to Coreen, but I think it's approximately 1.8 million shares outstanding.\n\nKal Malhi:Okay. And then you have a number of warrants or what have you. What are the cheapest warrants that are out there and how many are out?\n\nMartin Kay:I don't know, Coreen, if you have that in front of you.\n\nCoreen Kraysler:I don't have that in front of me.\n\nKal Malhi:Okay. And what's your net assets right now? I know you have a number of investments in other companies. What would you say your net asset value is?\n\nMartin Kay:Well, if you're talking about the portfolio of equity securities, and we talked about the business we had been in of taking equity in return for consulting services, that portfolio of equity positions is, I believe, on the balance sheet we just disclosed is a little over $25 million worth of net asset value in those equity positions.\n\nKal Malhi:And what's your cash position and payables or liabilities?\n\nMartin Kay:Again, cash and cash equivalents at the end of the quarter, a little over $1.3 million.\n\nCoreen Kraysler:And we're going to have to move on to the next questioner after this.\n\nOperator:Your next question is coming from Chris Sakai from Singular Research.\n\nJoichi Sakai:Just really wanted to get a sense and idea of what differentiates Netcapital Securities from other broker-dealers.\n\nMartin Kay:Well, there's a number of things. Obviously, as we talked about the ability to support Reg A fundraising through the existing Netcapital platform where we've already built out an ecosystem and a marketplace that brings investors and other issuers together, obviously, creates a platform and an environment that is unique to the sort of equity crowd funding industry versus traditional broker-dealer activities. So in other words, we already -- we have -- and we've disclosed over 115,000 investor accounts, and we have robust relationships with digital marketing providers and the team internally that understands how to bring the right investors to the right deal in this way and in this model, which is relatively unique.\n\nObviously, we have competitors -- a few competitors in our space, but it's not the traditional broker-dealer business.\n\nJoichi Sakai:Okay. And also, does this new registration for broker-dealer, does that provide any revenue visibility? Can you see any revenue streams, new revenue streams from that? And what -- about how much would that be, do you think?\n\nMartin Kay:Well, we haven't disclosed specifically what that -- forecast. That's not what we do. But as we discussed in our remarks, we -- it certainly opens up the potential for new revenue streams. For example, we -- Reg A, as I'm sure you know, allows issuers to raise a greater amount up to $75 million in a 12-month period versus $5 million under Reg CF exemption. So that much larger raise. And as a broker-dealer, we are now able to structure a fee arrangement that is likely a percentage of that as opposed to some sort of flat fee. So that obviously is something that we plan to pursue.\n\nJoichi Sakai:Do you see any large deals like that coming up?\n\nMartin Kay:Well, again, we haven't disclosed specifics of deals that we're pursuing, but safe to assume that, again, we are out in the marketplace talking to issuers all the time and have been -- we've had almost 300 companies successfully raised on our platform. Many of those have gone on to raise additional rounds of capital and are obviously candidates also for Reg A. So yes, we're in active discussions and have been for some time with companies who'd like to raise more capital than they can under Reg CF exemption.\n\nOperator:Your next question is coming from John Gilliam from Point Clear Strategic Capital.\n\nJohn Gilliam:Yes, last quarter, you indicated that you expected the Templum ATS exchange to open up from the beta to a full launch in the quarter ended this month. And I want to just get an update there if it's still expected to launch in '24.\n\nMartin Kay:Well, what I can say and what we've said, I think, previously is the technical and product build-out is complete, as you mentioned, in partnership with the Templum ATS. But I think it's safe to say we're still working through some details of the regulatory framework governing secondary exchanges. And it's really important to us to make sure that we don't roll out or open up to everyone a capability that we're still wanting to get to be exactly right. So we're still working on that.\n\nAnd again, I think it's prudent for us to not do anything before we feel 100% comfortable that we have the best product experience and that we have -- that we're operating within the regulatory framework in a way that we need to. So again, we haven't really talked or disclosed official timeline for launching that secondary transfer functionality, but that's all I can say at this point.\n\nJohn Gilliam:Well, on the prior call, you did mention you thought it would be in the year -- the calendar year ended '24. Are you feeling like that's kind of pushed into in the past -- the end of Q3 into Q4?\n\nMartin Kay:I think that's right.\n\nJohn Gilliam:How far out do you think we're looking?\n\nMartin Kay:Again, I don't think I can confidently predict that at this point.\n\nOperator:That concludes our Q&A session. I'll now hand the conference back to CFO, Coreen Kraysler, for closing remarks. Please go ahead.\n\nCoreen Kraysler:Thank you, everyone, for joining our call today. We really appreciate you as shareholders and potential shareholders. We are excited about the prospects ahead for our new broker-dealer subsidiary and wish you all a wonderful holiday season. Thank you.\n\nMartin Kay:Thank you all.\n\nOperator:Thank you everyone. This concludes today's event. You may disconnect at this time, and have a wonderful day. Thank you for your participation.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "source": "motley-fool",
  "word_count": 2126,
  "scraped_at": "2026-01-11T17:55:19.717030",
  "filename": "NCPL_2025_Q2_355a0b.json"
}