{
  "ticker": "UNF",
  "company": "UniFirst",
  "title": "UniFirst (UNF) Q1 2026 Earnings Call Transcript",
  "year": 2026,
  "quarter": 1,
  "url": "https://www.fool.com/earnings/call-transcripts/2026/01/07/unifirst-unf-q1-2026-earnings-call-transcript/",
  "transcript": "NYSE:UNF\n\nUniFirst\n\nImage source: The Motley Fool.\n\nDATE\n\nWednesday, January 7, 2026 at 9 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nThe board is formally examining an unsolicited, non-binding acquisition offer fromCintas(NASDAQ: CTAS) with advisor support, and no specific update or timetable was provided. Management reaffirmed annual guidance despite articulating positive momentum in topline results, citing caution due to macro headwinds and early-year timing as reasons for not revising projections upward. Progress on multi-year margin and growth initiatives will remain gradual, with significant margin inflection targeted for 2027 as long-term operational and technology investments reach advanced implementation phases. Strategic resource allocation includes continued capital return to shareholders and targeted acquisitions, while leadership maintains confidence in the operational improvements underway. The adoption of scalable, technology-enabled operations under “theUniFirst(UNF+0.64%)Way” is credited with producing steady account retention improvements sequentially.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nSteven Sintros:Thank you, Shane, and good morning, everyone. Our first quarter results were largely in line with our expectations and our outlook for the full year remains unchanged. Revenues increased to $621.3 million, up 2.7% from the prior year period. Consistent with our guidance, operating income and adjusted EBITDA declined year-over-year, reflecting the impact of planned investments designed to accelerate growth and improve operating leverage, as well as higher than anticipated healthcare claims and legal costs during the quarter. As we discussed in our last call, we've been making investments in our sales and services organizations to build a stronger, more sustainable platform for accelerated growth.\n\nIn addition to making targeted additions to our sales team during 2025, we invested in strengthening our service teams, expanding both capacity and stability. These enhancements position us to drive improved performance across all key aspects of our growth model and are beginning to show up in our operating metric improvements like account retention, new account sales, and additional product placements with our existing customers. In addition to driving top-line growth and the resulting benefits to our drop-through margins, we continue to invest in and execute on several initiatives that we believe will meaningfully enhance our profitability over time.\n\nAs we have previously discussed, these priorities include operational excellence driven by the continued adoption of the UniFirst Way, our enterprise-wide operating framework focused on scalable, repeatable processes to enable consistent execution, operational efficiency, and continuous improvement. Enhanced inventory management, procurement, and sourcing are driven by our ongoing ERP implementation, which is improving inventory sharing, centralizing procurement, and expanding our global sourcing base while enabling enhanced supply chain execution. G&A productivity is driven by our broader digital transformation, which is designed to enhance scalability, cost discipline, and operating leverage. Turning to our segments, our core Uniform and Facility Service Solutions business delivered solid organic growth of 2.4%, with positive performance across both sales and service operations.\n\nNew customer wins exceeded those in the same period last year, and customer retention continued its positive trajectory, logging a second year in a row of quarter-over-quarter improvement. We also grew facility service product placements within our customer base, underscoring the breadth of our offerings, the durability of our customer relationships, and the long-term cross-selling opportunities embedded in our platform. In our First Aid and Safety Solutions segment, we continued our momentum with robust revenue growth of 15.3%, primarily reflecting the investments we have made in our First Aid van business, including some small bolt-on acquisitions.\n\nAlthough growth during the quarter was somewhat tempered by a softer employment climate affecting both rental and direct sale accounts, we remain confident that our ongoing investments are yielding measurable improvements in the key areas of our growth model. Our balance sheet and overall financial position remain robust. We maintained our disciplined approach to capital allocation focused on investing in growth and returning capital to our shareholders. Underscoring the Board and management team's confidence in our strategy, execution, and long-term growth prospects, we repurchased approximately $32 million of common stock during the quarter, and over $77 million in the past two quarters, and again increased the common stock dividend.\n\nAs always, I want to sincerely thank our team partners who continue to always deliver for each other and our customers. Every day, our team partners live our mission of serving the people who do the hard work—the people and workforce who keep our communities up and running—by providing the exceptional products, services, and support experiences that enable them to do their jobs successfully and safely. Through our \"always deliver\" philosophy, we remain committed to creating value for all stakeholders, including our employees, customers, the communities we serve, and shareholders. On that note, I want to briefly address the unsolicited non-binding proposal we received from Cintas recently.\n\nAs we stated in our December 22nd press release, the UniFirst Board of Directors has engaged independent financial and legal advisers to evaluate the proposal and determine the course of action that it believes is in the best interest of UniFirst, our shareholders, and our other stakeholders. That work remains ongoing, and we will provide an update as soon as it has been completed. I also want to acknowledge the active dialogue our management team and Board have had in recent weeks with many of our shareholders. We look forward to further constructive engagement to advance our common goal of enhancing shareholder value.\n\nWith that, I'll turn the call over to Shane, who will provide more details on our first quarter results as well as our outlook for the remainder of the year.\n\nOperator:Thanks, Steve. Consolidated revenues in our first quarter of 2026 were $621.3 million compared to $604.9 million a year ago. Consolidated operating income was $45.3 million compared to $55.5 million. Net income for the quarter decreased to $34.4 million, or $1.89 per diluted share, from $43.1 million, or $2.31 per diluted share. Consolidated adjusted EBITDA was $82.8 million compared to $94.0 million in the prior year. Our effective tax rate increased to 26.9% compared to 25.6% in the prior year, primarily due to the timing and amount of excess tax benefits and deficiencies related to employee share-based payments.\n\nAlthough we had a higher tax rate in the first quarter, we still believe that our tax rate for the full year will be approximately 26%. Our financial results in the first quarters of fiscal 2026 and 2025 included approximately $2.3 million and $2.5 million, respectively, in costs directly attributable to our ongoing ERP project or \"Key Initiative.\" During fiscal 2026, these costs decreased operating income and adjusted EBITDA by $2.3 million, net income by $1.7 million, and diluted EPS by $0.09. Revenues in our Uniform and Facility Service Solutions segment increased to $565.9 million during the quarter compared to $552.8 million in the first quarter of 2025.\n\nThe segment's organic growth, which adjusts for the estimated effect of acquisitions as well as fluctuations in the Canadian dollar, was 2.4%, driven by strong new account sales and improved customer retention. Uniform and Facility Service Solutions operating margin was 7.4% for the quarter, or $41.8 million, compared to 8.8% in the previous year, or $48.5 million. The segment's adjusted EBITDA margin was 13.6% compared to 15.4% in the previous year. The costs we incurred related to our Key Initiative were recorded to this segment and decreased both the Uniform and Facility Service Solutions operating and adjusted EBITDA margins by 0.4% and 0.5% in the first quarters of fiscal 2026 and 2025, respectively.\n\nSegment operating and adjusted EBITDA margin comparisons reflect the planned investments in accelerating growth and improving operating leverage, as well as the increased healthcare claims expense and legal costs during the quarter Steve discussed. Energy costs in the first quarter of 2026 were 4.1% of revenues. Our First Aid and Safety Solutions revenues increased by 15.3% to $30.2 million from $26.2 million in the prior year, driven by double-digit growth in our van operations. The segment had a nominal operating loss of $400,000 during the quarter, reflecting the investments we made to drive continued growth and improve long-term profitability.\n\nSpecialty Service Solutions revenues decreased 2.9% to $25.2 million from $25.9 million in the prior year, reflecting the anticipated start of a large refurbishment project wind-down and fewer reactor outages. The segment's operating margin for the quarter was 15.4%, down from the prior year due to the high fixed-cost nature of the business. As we mentioned in the past, the segment's results can vary significantly from period to period due to seasonality, as well as the timing and profitability of nuclear reactor outages and projects. At the end of our first fiscal quarter, we maintained a solid balance sheet and financial position with cash, cash equivalents, and short-term investments totaling $129.5 million and no long-term debt.\n\nIn the first three months of fiscal 2026, our free cash flows were impacted by lower profit and heavy working capital needs of the business, including merchandise in service primarily related to the installation of a couple of large national account customers, as well as the timing of income tax payments and vendor payments. We continue to invest in our future with capital expenditures of $38.9 million, repurchased $31.7 million worth of common stock, and acquired four first aid businesses for $14.9 million. As Steve mentioned, we are reaffirming our full-year fiscal 2026 guidance with a consolidated revenue range of $2.475 billion to $2.495 billion and fully diluted earnings per share between $6.58 and $6.98.\n\nThis guidance continues to include an estimated $7 million of costs directly attributable to our Key Initiative that we anticipate will be expensed in fiscal 2026. As a reminder, our guidance does not assume future share buybacks. This concludes our prepared remarks, and we would now be happy to answer your questions. Given Steve's update on the Cintas matter, we do not intend to be answering any additional questions regarding that situation and ask that you please focus your questions on our first quarter results and 2026 outlook. Thank you.\n\nRonan Kennedy:Good morning. This is Ronan Kennedy on for Manav Patnaik. Thank you for taking our questions. Steve, may I ask if you could please remind us of the timeline for achieving the long-term objectives of the mid-single-digit organic growth and high teens adjusted EBITDA margins? And then, specifically, any significant milestones we should be mindful of through fiscal 2026 and 2027? And lastly, what gives you confidence in successful execution?\n\nSteven Sintros:Good question, Ronan. As you mentioned, we had talked about those milestones over the last couple of years. We had not given specific fiscal years for the achievement of those particular milestones. But when you look out over the next couple of years, our guidance for '26 is our guidance for '26. We expect to see steady improvement as we go through '27 and '28, getting closer to those mid-single-digit numbers—I would say by the third year or so. When you look at the profitability side, again, this year our guidance is our guidance.\n\nWe have a lot inflecting in the next 18 to 24 months with the execution of our key initiatives and the completion of some of our tech projects. There's some large-scale profitability benefits that we're going to enable over the next year or so. And, again, we're not kind of giving guidance for '27 or '28 right now, but we believe that as we get through '27, you'll start to hit some of that inflection. Now, one of the things that at least over the course of this year into next year we have to keep an eye on is the impact of tariffs on our cost structure and so on.\n\nBut we do feel like as you get to a year from now, you're going to start to have better line of sight to the inflection of some of those large-scale initiatives that will be starting to come into our results. We have a lot of confidence in the plan we've put forth. We think there are a lot of real benefits to be yielded. It's really a matter of time and executing these tech transformations and getting to the finish line.\n\nRonan Kennedy:That's helpful. Thank you. And then if I'm not mistaken, I think fiscal 4Q 2025 was the highest quarter in new account installation. That momentum appears to have been sustained. Can you talk about those strategic investments in growth and the new customer acquisitions, but also the investments that you're making in the salesforce, the service organization, and any initial impact from the UniFirst Way initiatives through the COO?\n\nSteven Sintros:Starting with the sales organization, we talked a lot in the fourth quarter about the restructuring of the sales organization, adding different roles to ensure that we have the right level of sales representative in front of the right prospects. So, it's more of a tiered sales organization than it's been in the past. There were some strategic headcount increases that were made primarily in the back half of last year. And we're starting to see good progress on sales rep productivity and the yield from those additional resources in that restructuring.\n\nFrom a service perspective, again, kind of reiterating what we talked about in our fourth quarter earnings call: a number of strategic headcount additions to help bolster account management, account retention, adding some breadth and capacity to our service organization. Because when you think about our growth model, new account sales is obviously a key part of that. You look at the other key components of our growth formula—whether it be retention, strategic upsell into our customer base, as well as the management of price across our customer base—our service organization has a large responsibility in executing those three other pillars of growth.\n\nSo, adding some of those strategic resources is starting to get us ahead in a number of those areas. I talked about in the quarter how we're starting to see some momentum in customer upsell, as well as some continued improvement in existing account retention. So, it's really a number of those things in the service organization coming together to drive the growth model. And that does filter into the service operations execution with the UniFirst Way. When we talk about renewing accounts and the discipline around ensuring that we're managing our account renewal process, just as an example, in a very disciplined, organized way.\n\nWe've talked over the course of last year how our metrics around accounts renewed continued to sequentially improve. And it's not a surprise that's yielding improved overall customer retention. So, that's one example I can give of our overall operational execution discipline yielding benefits in our growth model through our service organization investment. I know you asked a lot of pieces to that question. Feel free to follow up if I didn't answer what you've asked.\n\nTim Mulrooney:Steve, Shane, good morning. Just sticking on this higher new account growth conversation. I think you characterized that in your prepared remarks even as strong new account sales. So, I was hoping you could unpack that a bit more for me. Curious if you know, the new accounts that you're winning, which I think you said was higher year-over-year, which was good to hear—does that broadly match your customer mix? Or are you noticing, I don't know, a higher number of new accounts from any particular industry or client type?\n\nSteven Sintros:I would talk about it less in terms of industry and probably more in terms of customer size. When I talk about some of the structural changes we've made in our sales organization to more of a tiered model, we had previously talked about sales in the context of national accounts or local accounts. Well, there's a large universe of accounts that fall in between the, say, $80-a-week account and the true national accounts. And we're really making more progress over time in those mid-sized accounts. And that was really part of that investment in this tiered selling organization where we have sales reps focused on that tier of customer as opposed to just the two ends of the spectrum.\n\nSo, that's been an evolution over the last couple of years, and that's something we're going to continue. Because we think we can yield a lot better success in that midsize customer demographic, and we're starting to see the success there.\n\nTim Mulrooney:Helpful color. Thank you. And you had strong new account growth, but you did mention in your prepared remarks growth was somewhat tempered by a softer employment climate, which, I guess, affected your rental customer accounts. You've highlighted net wearer levels as being a slight headwind the last couple of quarters. But has that gotten progressively more difficult the last couple of months? We all can see the job numbers. And, look, if you've got good, strong new account growth, but your organic growth is low single-digit, that implies that something is offsetting that. Right? So, I assume that's the net wearer levels.\n\nCan you set me straight on that and talk about if that's gotten progressively more of a headwind recently? Thank you.\n\nSteven Sintros:Probably the way I categorize it is it has gotten incrementally more impactful. And look, we are on a journey to building toward stronger growth. So, when we talk about stronger new account sales and better retention, we still have progress to make in those areas. And the one in particular is that existing account penetration. So, that is sort of the universe that encompasses the employment situation, but also the work that we do to continue to add product placements to our customers. So, yes, there was some incremental weakness in that area. And some of that was offset by some progress that we have made in product placements.\n\nI think that continues to be the biggest opportunity over the next couple of years combined with continuing our journey on improved retention to drive toward that mid-single-digit sustainable growth.\n\nJosh Chan:Hi. Good morning, Steve, Shane. Thanks for taking my questions. I was wondering about your unchanged revenue guidance because it sounds like you have decent momentum in the business. You know, it sounds like you're installing some national accounts customers in the quarter, a couple of acquisitions. So, I was wondering about the potential that the guidance could have been raised and maybe why it wasn't necessarily raised on the revenue side.\n\nSteven Sintros:Good question. I mean, I think we're one quarter into the year, but I think your comment is correct. I think we do feel like we have some good momentum on the top-line side. I think it's just a little early to make meaningful changes to any of the guidance. But, no, I think incrementally, we do feel positive about the top line. I think some of the economic weakness that I just talked about—I made in my comments some remarks on the direct sales side—some of our customers just have sort of incrementally less purchasing, so there's a little bit of a drag there as well.\n\nAnd given how early we are in the year, I think that's what landed us at the guidance that we've reiterated.\n\nJosh Chan:Okay. Great. Thank you for that. And then on your comment earlier about, you know, hitting some sort of inflection in '27 in terms of these margin improvement initiatives. Could you just kind of bucket for us what categories of savings you expect to achieve with these projects and how they will kind of operationally flow through into the business? Thank you.\n\nSteven Sintros:Sure. I mean, there are a number of things, and I talked about some of them in a little bit more depth last quarter. But when you look at some of the bigger opportunities that are out there, I'll give a couple of examples. One of them is sort of the enablement of what I'll call global inventory sharing, which is across our used garment portfolio. Today, we don't meaningfully share used garments across different facilities. So, that's something we're actively working through with our tech initiatives as well as our operational execution teams to put the technology and processes in place to enable that. That is a meaningful impact.\n\nNow, as you save on merchandise, as you all know, less new merchandise going in service ultimately materializes as what would have been new merchandise coming in service amortizing over time. It's not an immediate margin impact. So, that's something that as we go through '27, we hope to be enabling.\n\nI don't have a date right now that I would give to you to say when will that be enabled, but then there will be a longer tail to that to get the full benefit of starting to reutilize that used merchandise in a more meaningful way. A couple of other opportunities that are somewhat larger scale:We have some new products that we will be launching in the facility service area. That will allow us to penetrate our customers further but also allow for some meaningful sourcing improvements in some of those products. That's something, again, that we expect to be launching over the course of '27. So, part of the reason that '27 seems like a pivot year is because we believe it will be—that a number of these things will be going live. But the full impact of them won't be hitting until later in that year or even into the year after. So, as we go forward over the upcoming quarters, we'll be able to crystallize some of that timing better for everybody.\n\nBut there are some meaningful initiatives that we feel can inflect the margins.\n\nAt the same time, some of the operational improvement things are more ongoing and will start to build over the course of '27 into the upcoming years. That being said, there's still a fair amount of investment and execution around these tech and other initiatives to get them off the ground. And that will keep—we've talked about going through this year—some of the margins muted until we hit that inflection point.\n\nBut part of that journey is also, as you get to the other side of these things, meaningfully taking advantage of our new infrastructure to sort of moderate the G&A machine that we've been managing with all of these tech projects and other projects, to a point where some of them will be enabled by the technology (more automation, centralization, and efficiency), and some will just be the wind-down of some of the additional resources that are supporting all of these initiatives. So, hopefully, that gives you a sense. You know, it's not just around the corner, but we are getting to a much closer line of sight to these things starting to inflect.\n\nAlex Hess:Hi, everybody, and happy New Year. This is Alex Hess on for Andrew Steinerman. Wanted to maybe start with the margins in the quarter. Could you elaborate how much of the in-year sales and service investments fell in 1Q? And should we expect this pace to continue or will it moderate from here? Just trying to sort of think about the margin impact there.\n\nSteven Sintros:Yes, good question. And I made the comment that, you know, some of these investments sort of materialized over the back half of last year. So, when you think about that from a year-over-year quarter perspective, some of these margin impacts of these investments are more pronounced in the first quarter than they will be as you move throughout the year. And I don't think it's a stretch to say that the first quarter from some of those specifics is sort of the biggest impact, based on the way those costs trended last year and the way we expect them to trend this year. I think that's what you're getting at.\n\nAlex Hess:Correct, sir. Thank you. And then on the ERP implementation, can you let us just sort of know where that stands, what still needs to be done—and, keeping in mind this is a very big project for you guys—do you have a firmer sense of when in '27 ERP implementation will be complete? And then, you know, anything we need to just sort of keep in mind with respect to the ERP implementation.\n\nSteven Sintros:When you look at this year, there will be some releases scheduled for this year—the more core financial foundation of the ERP. In '27, there'll be some supply chain-centric and some procurement enhancements that will come online. Don't have the exact end dates for those yet, but in the bulk of the next 18 months, this will be largely playing out. And that sort of fits with the timeline I'm giving as some of these benefits start to materialize. So, this year is primarily still foundational. And then as we get into next year, there are some more of those supply chain pieces that will come online.\n\nOperator:What I would add is when we first started talking about the ERP, we said that the timeline took us largely through 2027, with that last release being supply chain-centric—delivering some of the capabilities Steve spoke about, sort of benefiting the latter half of '27 and into '28. That timeline really hasn't changed. Again, Steve had mentioned this year, we're going to be focused on the core finance modules and starting to progress that third and final release. That'll take us through 2027.\n\nSteven Sintros:I want to thank everyone for joining us this morning to review our first quarter results for fiscal twenty six. Thank you, and have a great day.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "prepared_remarks": "NYSE:UNF\n\nUniFirst\n\nImage source: The Motley Fool.\n\nDATE\n\nWednesday, January 7, 2026 at 9 a.m. ET\n\nCALL PARTICIPANTS\n\nTAKEAWAYS\n\nNeed a quote from a Motley Fool analyst? Email[email protected]\n\nRISKS\n\nSUMMARY\n\nThe board is formally examining an unsolicited, non-binding acquisition offer fromCintas(NASDAQ: CTAS) with advisor support, and no specific update or timetable was provided. Management reaffirmed annual guidance despite articulating positive momentum in topline results, citing caution due to macro headwinds and early-year timing as reasons for not revising projections upward. Progress on multi-year margin and growth initiatives will remain gradual, with significant margin inflection targeted for 2027 as long-term operational and technology investments reach advanced implementation phases. Strategic resource allocation includes continued capital return to shareholders and targeted acquisitions, while leadership maintains confidence in the operational improvements underway. The adoption of scalable, technology-enabled operations under “theUniFirst(UNF+0.64%)Way” is credited with producing steady account retention improvements sequentially.\n\nINDUSTRY GLOSSARY\n\nFull Conference Call Transcript\n\nSteven Sintros:Thank you, Shane, and good morning, everyone. Our first quarter results were largely in line with our expectations and our outlook for the full year remains unchanged. Revenues increased to $621.3 million, up 2.7% from the prior year period. Consistent with our guidance, operating income and adjusted EBITDA declined year-over-year, reflecting the impact of planned investments designed to accelerate growth and improve operating leverage, as well as higher than anticipated healthcare claims and legal costs during the quarter. As we discussed in our last call, we've been making investments in our sales and services organizations to build a stronger, more sustainable platform for accelerated growth.\n\nIn addition to making targeted additions to our sales team during 2025, we invested in strengthening our service teams, expanding both capacity and stability. These enhancements position us to drive improved performance across all key aspects of our growth model and are beginning to show up in our operating metric improvements like account retention, new account sales, and additional product placements with our existing customers. In addition to driving top-line growth and the resulting benefits to our drop-through margins, we continue to invest in and execute on several initiatives that we believe will meaningfully enhance our profitability over time.\n\nAs we have previously discussed, these priorities include operational excellence driven by the continued adoption of the UniFirst Way, our enterprise-wide operating framework focused on scalable, repeatable processes to enable consistent execution, operational efficiency, and continuous improvement. Enhanced inventory management, procurement, and sourcing are driven by our ongoing ERP implementation, which is improving inventory sharing, centralizing procurement, and expanding our global sourcing base while enabling enhanced supply chain execution. G&A productivity is driven by our broader digital transformation, which is designed to enhance scalability, cost discipline, and operating leverage. Turning to our segments, our core Uniform and Facility Service Solutions business delivered solid organic growth of 2.4%, with positive performance across both sales and service operations.\n\nNew customer wins exceeded those in the same period last year, and customer retention continued its positive trajectory, logging a second year in a row of quarter-over-quarter improvement. We also grew facility service product placements within our customer base, underscoring the breadth of our offerings, the durability of our customer relationships, and the long-term cross-selling opportunities embedded in our platform. In our First Aid and Safety Solutions segment, we continued our momentum with robust revenue growth of 15.3%, primarily reflecting the investments we have made in our First Aid van business, including some small bolt-on acquisitions.\n\nAlthough growth during the quarter was somewhat tempered by a softer employment climate affecting both rental and direct sale accounts, we remain confident that our ongoing investments are yielding measurable improvements in the key areas of our growth model. Our balance sheet and overall financial position remain robust. We maintained our disciplined approach to capital allocation focused on investing in growth and returning capital to our shareholders. Underscoring the Board and management team's confidence in our strategy, execution, and long-term growth prospects, we repurchased approximately $32 million of common stock during the quarter, and over $77 million in the past two quarters, and again increased the common stock dividend.\n\nAs always, I want to sincerely thank our team partners who continue to always deliver for each other and our customers. Every day, our team partners live our mission of serving the people who do the hard work—the people and workforce who keep our communities up and running—by providing the exceptional products, services, and support experiences that enable them to do their jobs successfully and safely. Through our \"always deliver\" philosophy, we remain committed to creating value for all stakeholders, including our employees, customers, the communities we serve, and shareholders. On that note, I want to briefly address the unsolicited non-binding proposal we received from Cintas recently.\n\nAs we stated in our December 22nd press release, the UniFirst Board of Directors has engaged independent financial and legal advisers to evaluate the proposal and determine the course of action that it believes is in the best interest of UniFirst, our shareholders, and our other stakeholders. That work remains ongoing, and we will provide an update as soon as it has been completed. I also want to acknowledge the active dialogue our management team and Board have had in recent weeks with many of our shareholders. We look forward to further constructive engagement to advance our common goal of enhancing shareholder value.\n\nWith that, I'll turn the call over to Shane, who will provide more details on our first quarter results as well as our outlook for the remainder of the year.\n\nOperator:Thanks, Steve. Consolidated revenues in our first quarter of 2026 were $621.3 million compared to $604.9 million a year ago. Consolidated operating income was $45.3 million compared to $55.5 million. Net income for the quarter decreased to $34.4 million, or $1.89 per diluted share, from $43.1 million, or $2.31 per diluted share. Consolidated adjusted EBITDA was $82.8 million compared to $94.0 million in the prior year. Our effective tax rate increased to 26.9% compared to 25.6% in the prior year, primarily due to the timing and amount of excess tax benefits and deficiencies related to employee share-based payments.\n\nAlthough we had a higher tax rate in the first quarter, we still believe that our tax rate for the full year will be approximately 26%. Our financial results in the first quarters of fiscal 2026 and 2025 included approximately $2.3 million and $2.5 million, respectively, in costs directly attributable to our ongoing ERP project or \"Key Initiative.\" During fiscal 2026, these costs decreased operating income and adjusted EBITDA by $2.3 million, net income by $1.7 million, and diluted EPS by $0.09. Revenues in our Uniform and Facility Service Solutions segment increased to $565.9 million during the quarter compared to $552.8 million in the first quarter of 2025.\n\nThe segment's organic growth, which adjusts for the estimated effect of acquisitions as well as fluctuations in the Canadian dollar, was 2.4%, driven by strong new account sales and improved customer retention. Uniform and Facility Service Solutions operating margin was 7.4% for the quarter, or $41.8 million, compared to 8.8% in the previous year, or $48.5 million. The segment's adjusted EBITDA margin was 13.6% compared to 15.4% in the previous year. The costs we incurred related to our Key Initiative were recorded to this segment and decreased both the Uniform and Facility Service Solutions operating and adjusted EBITDA margins by 0.4% and 0.5% in the first quarters of fiscal 2026 and 2025, respectively.\n\nSegment operating and adjusted EBITDA margin comparisons reflect the planned investments in accelerating growth and improving operating leverage, as well as the increased healthcare claims expense and legal costs during the quarter Steve discussed. Energy costs in the first quarter of 2026 were 4.1% of revenues. Our First Aid and Safety Solutions revenues increased by 15.3% to $30.2 million from $26.2 million in the prior year, driven by double-digit growth in our van operations. The segment had a nominal operating loss of $400,000 during the quarter, reflecting the investments we made to drive continued growth and improve long-term profitability.\n\nSpecialty Service Solutions revenues decreased 2.9% to $25.2 million from $25.9 million in the prior year, reflecting the anticipated start of a large refurbishment project wind-down and fewer reactor outages. The segment's operating margin for the quarter was 15.4%, down from the prior year due to the high fixed-cost nature of the business. As we mentioned in the past, the segment's results can vary significantly from period to period due to seasonality, as well as the timing and profitability of nuclear reactor outages and projects. At the end of our first fiscal quarter, we maintained a solid balance sheet and financial position with cash, cash equivalents, and short-term investments totaling $129.5 million and no long-term debt.\n\nIn the first three months of fiscal 2026, our free cash flows were impacted by lower profit and heavy working capital needs of the business, including merchandise in service primarily related to the installation of a couple of large national account customers, as well as the timing of income tax payments and vendor payments. We continue to invest in our future with capital expenditures of $38.9 million, repurchased $31.7 million worth of common stock, and acquired four first aid businesses for $14.9 million. As Steve mentioned, we are reaffirming our full-year fiscal 2026 guidance with a consolidated revenue range of $2.475 billion to $2.495 billion and fully diluted earnings per share between $6.58 and $6.98.\n\nThis guidance continues to include an estimated $7 million of costs directly attributable to our Key Initiative that we anticipate will be expensed in fiscal 2026. As a reminder, our guidance does not assume future share buybacks. This concludes our prepared remarks, and we would now be happy to answer your questions. Given Steve's update on the Cintas matter, we do not intend to be answering any additional questions regarding that situation and ask that you please focus your questions on our first quarter results and 2026 outlook. Thank you.\n\nRonan Kennedy:Good morning. This is Ronan Kennedy on for Manav Patnaik. Thank you for taking our questions. Steve, may I ask if you could please remind us of the timeline for achieving the long-term objectives of the mid-single-digit organic growth and high teens adjusted EBITDA margins? And then, specifically, any significant milestones we should be mindful of through fiscal 2026 and 2027? And lastly, what gives you confidence in successful execution?\n\nSteven Sintros:Good question, Ronan. As you mentioned, we had talked about those milestones over the last couple of years. We had not given specific fiscal years for the achievement of those particular milestones. But when you look out over the next couple of years, our guidance for '26 is our guidance for '26. We expect to see steady improvement as we go through '27 and '28, getting closer to those mid-single-digit numbers—I would say by the third year or so. When you look at the profitability side, again, this year our guidance is our guidance.\n\nWe have a lot inflecting in the next 18 to 24 months with the execution of our key initiatives and the completion of some of our tech projects. There's some large-scale profitability benefits that we're going to enable over the next year or so. And, again, we're not kind of giving guidance for '27 or '28 right now, but we believe that as we get through '27, you'll start to hit some of that inflection. Now, one of the things that at least over the course of this year into next year we have to keep an eye on is the impact of tariffs on our cost structure and so on.\n\nBut we do feel like as you get to a year from now, you're going to start to have better line of sight to the inflection of some of those large-scale initiatives that will be starting to come into our results. We have a lot of confidence in the plan we've put forth. We think there are a lot of real benefits to be yielded. It's really a matter of time and executing these tech transformations and getting to the finish line.\n\nRonan Kennedy:That's helpful. Thank you. And then if I'm not mistaken, I think fiscal 4Q 2025 was the highest quarter in new account installation. That momentum appears to have been sustained. Can you talk about those strategic investments in growth and the new customer acquisitions, but also the investments that you're making in the salesforce, the service organization, and any initial impact from the UniFirst Way initiatives through the COO?\n\nSteven Sintros:Starting with the sales organization, we talked a lot in the fourth quarter about the restructuring of the sales organization, adding different roles to ensure that we have the right level of sales representative in front of the right prospects. So, it's more of a tiered sales organization than it's been in the past. There were some strategic headcount increases that were made primarily in the back half of last year. And we're starting to see good progress on sales rep productivity and the yield from those additional resources in that restructuring.\n\nFrom a service perspective, again, kind of reiterating what we talked about in our fourth quarter earnings call: a number of strategic headcount additions to help bolster account management, account retention, adding some breadth and capacity to our service organization. Because when you think about our growth model, new account sales is obviously a key part of that. You look at the other key components of our growth formula—whether it be retention, strategic upsell into our customer base, as well as the management of price across our customer base—our service organization has a large responsibility in executing those three other pillars of growth.\n\nSo, adding some of those strategic resources is starting to get us ahead in a number of those areas. I talked about in the quarter how we're starting to see some momentum in customer upsell, as well as some continued improvement in existing account retention. So, it's really a number of those things in the service organization coming together to drive the growth model. And that does filter into the service operations execution with the UniFirst Way. When we talk about renewing accounts and the discipline around ensuring that we're managing our account renewal process, just as an example, in a very disciplined, organized way.\n\nWe've talked over the course of last year how our metrics around accounts renewed continued to sequentially improve. And it's not a surprise that's yielding improved overall customer retention. So, that's one example I can give of our overall operational execution discipline yielding benefits in our growth model through our service organization investment. I know you asked a lot of pieces to that question. Feel free to follow up if I didn't answer what you've asked.\n\nTim Mulrooney:Steve, Shane, good morning. Just sticking on this higher new account growth conversation. I think you characterized that in your prepared remarks even as strong new account sales. So, I was hoping you could unpack that a bit more for me. Curious if you know, the new accounts that you're winning, which I think you said was higher year-over-year, which was good to hear—does that broadly match your customer mix? Or are you noticing, I don't know, a higher number of new accounts from any particular industry or client type?\n\nSteven Sintros:I would talk about it less in terms of industry and probably more in terms of customer size. When I talk about some of the structural changes we've made in our sales organization to more of a tiered model, we had previously talked about sales in the context of national accounts or local accounts. Well, there's a large universe of accounts that fall in between the, say, $80-a-week account and the true national accounts. And we're really making more progress over time in those mid-sized accounts. And that was really part of that investment in this tiered selling organization where we have sales reps focused on that tier of customer as opposed to just the two ends of the spectrum.\n\nSo, that's been an evolution over the last couple of years, and that's something we're going to continue. Because we think we can yield a lot better success in that midsize customer demographic, and we're starting to see the success there.\n\nTim Mulrooney:Helpful color. Thank you. And you had strong new account growth, but you did mention in your prepared remarks growth was somewhat tempered by a softer employment climate, which, I guess, affected your rental customer accounts. You've highlighted net wearer levels as being a slight headwind the last couple of quarters. But has that gotten progressively more difficult the last couple of months? We all can see the job numbers. And, look, if you've got good, strong new account growth, but your organic growth is low single-digit, that implies that something is offsetting that. Right? So, I assume that's the net wearer levels.\n\nCan you set me straight on that and talk about if that's gotten progressively more of a headwind recently? Thank you.\n\nSteven Sintros:Probably the way I categorize it is it has gotten incrementally more impactful. And look, we are on a journey to building toward stronger growth. So, when we talk about stronger new account sales and better retention, we still have progress to make in those areas. And the one in particular is that existing account penetration. So, that is sort of the universe that encompasses the employment situation, but also the work that we do to continue to add product placements to our customers. So, yes, there was some incremental weakness in that area. And some of that was offset by some progress that we have made in product placements.\n\nI think that continues to be the biggest opportunity over the next couple of years combined with continuing our journey on improved retention to drive toward that mid-single-digit sustainable growth.\n\nJosh Chan:Hi. Good morning, Steve, Shane. Thanks for taking my questions. I was wondering about your unchanged revenue guidance because it sounds like you have decent momentum in the business. You know, it sounds like you're installing some national accounts customers in the quarter, a couple of acquisitions. So, I was wondering about the potential that the guidance could have been raised and maybe why it wasn't necessarily raised on the revenue side.\n\nSteven Sintros:Good question. I mean, I think we're one quarter into the year, but I think your comment is correct. I think we do feel like we have some good momentum on the top-line side. I think it's just a little early to make meaningful changes to any of the guidance. But, no, I think incrementally, we do feel positive about the top line. I think some of the economic weakness that I just talked about—I made in my comments some remarks on the direct sales side—some of our customers just have sort of incrementally less purchasing, so there's a little bit of a drag there as well.\n\nAnd given how early we are in the year, I think that's what landed us at the guidance that we've reiterated.\n\nJosh Chan:Okay. Great. Thank you for that. And then on your comment earlier about, you know, hitting some sort of inflection in '27 in terms of these margin improvement initiatives. Could you just kind of bucket for us what categories of savings you expect to achieve with these projects and how they will kind of operationally flow through into the business? Thank you.\n\nSteven Sintros:Sure. I mean, there are a number of things, and I talked about some of them in a little bit more depth last quarter. But when you look at some of the bigger opportunities that are out there, I'll give a couple of examples. One of them is sort of the enablement of what I'll call global inventory sharing, which is across our used garment portfolio. Today, we don't meaningfully share used garments across different facilities. So, that's something we're actively working through with our tech initiatives as well as our operational execution teams to put the technology and processes in place to enable that. That is a meaningful impact.\n\nNow, as you save on merchandise, as you all know, less new merchandise going in service ultimately materializes as what would have been new merchandise coming in service amortizing over time. It's not an immediate margin impact. So, that's something that as we go through '27, we hope to be enabling.\n\nI don't have a date right now that I would give to you to say when will that be enabled, but then there will be a longer tail to that to get the full benefit of starting to reutilize that used merchandise in a more meaningful way. A couple of other opportunities that are somewhat larger scale:We have some new products that we will be launching in the facility service area. That will allow us to penetrate our customers further but also allow for some meaningful sourcing improvements in some of those products. That's something, again, that we expect to be launching over the course of '27. So, part of the reason that '27 seems like a pivot year is because we believe it will be—that a number of these things will be going live. But the full impact of them won't be hitting until later in that year or even into the year after. So, as we go forward over the upcoming quarters, we'll be able to crystallize some of that timing better for everybody.\n\nBut there are some meaningful initiatives that we feel can inflect the margins.\n\nAt the same time, some of the operational improvement things are more ongoing and will start to build over the course of '27 into the upcoming years. That being said, there's still a fair amount of investment and execution around these tech and other initiatives to get them off the ground. And that will keep—we've talked about going through this year—some of the margins muted until we hit that inflection point.\n\nBut part of that journey is also, as you get to the other side of these things, meaningfully taking advantage of our new infrastructure to sort of moderate the G&A machine that we've been managing with all of these tech projects and other projects, to a point where some of them will be enabled by the technology (more automation, centralization, and efficiency), and some will just be the wind-down of some of the additional resources that are supporting all of these initiatives. So, hopefully, that gives you a sense. You know, it's not just around the corner, but we are getting to a much closer line of sight to these things starting to inflect.\n\nAlex Hess:Hi, everybody, and happy New Year. This is Alex Hess on for Andrew Steinerman. Wanted to maybe start with the margins in the quarter. Could you elaborate how much of the in-year sales and service investments fell in 1Q? And should we expect this pace to continue or will it moderate from here? Just trying to sort of think about the margin impact there.\n\nSteven Sintros:Yes, good question. And I made the comment that, you know, some of these investments sort of materialized over the back half of last year. So, when you think about that from a year-over-year quarter perspective, some of these margin impacts of these investments are more pronounced in the first quarter than they will be as you move throughout the year. And I don't think it's a stretch to say that the first quarter from some of those specifics is sort of the biggest impact, based on the way those costs trended last year and the way we expect them to trend this year. I think that's what you're getting at.\n\nAlex Hess:Correct, sir. Thank you. And then on the ERP implementation, can you let us just sort of know where that stands, what still needs to be done—and, keeping in mind this is a very big project for you guys—do you have a firmer sense of when in '27 ERP implementation will be complete? And then, you know, anything we need to just sort of keep in mind with respect to the ERP implementation.\n\nSteven Sintros:When you look at this year, there will be some releases scheduled for this year—the more core financial foundation of the ERP. In '27, there'll be some supply chain-centric and some procurement enhancements that will come online. Don't have the exact end dates for those yet, but in the bulk of the next 18 months, this will be largely playing out. And that sort of fits with the timeline I'm giving as some of these benefits start to materialize. So, this year is primarily still foundational. And then as we get into next year, there are some more of those supply chain pieces that will come online.\n\nOperator:What I would add is when we first started talking about the ERP, we said that the timeline took us largely through 2027, with that last release being supply chain-centric—delivering some of the capabilities Steve spoke about, sort of benefiting the latter half of '27 and into '28. That timeline really hasn't changed. Again, Steve had mentioned this year, we're going to be focused on the core finance modules and starting to progress that third and final release. That'll take us through 2027.\n\nSteven Sintros:I want to thank everyone for joining us this morning to review our first quarter results for fiscal twenty six. Thank you, and have a great day.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript.Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned.As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see ourTerms and Conditionsfor additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has adisclosure policy.\n\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.",
  "qa_section": "",
  "source": "motley-fool",
  "word_count": 4420,
  "scraped_at": "2026-01-11T10:52:37.128725",
  "filename": "UNF_2026_Q1_0687d0.json"
}